'use client';

import { useState, useCallback, useMemo, useEffect } from 'react';
import { useSearchParams, useRouter } from 'next/navigation';
import { getQuestionsByCategory, getPreviewQuestions, getDifficultyCount, getRandomQuestionsByDifficulty, getDifficultyCountByPrefix, getPreviewQuestionsByPrefix, type Question } from '../data/questions';
import { getStudents, type Student } from '../data/students';
import { formatMath } from '../utils/mathUtils';
import { generateNumberLine } from '../utils/mathGraphics';
import { getAvatarById } from '../data/avatars';

const grades = [
    { id: 'e1', name: '小1' }, { id: 'e2', name: '小2' }, { id: 'e3', name: '小3' },
    { id: 'e4', name: '小4' }, { id: 'e5', name: '小5' }, { id: 'e6', name: '小6' },
    { id: 'j1', name: '中1' }, { id: 'j2', name: '中2' }, { id: 'j3', name: '中3' },
    { id: 'j_all', name: '中学無学年' },
    { id: 'h_all', name: '高校無学年' }
];

const treeData = [
    {
        id: '11', name: '正負の数', children: [
            {
                id: '11-01', name: '正負の数', children: [
                    {
                        id: '11-01-01', name: '正負の数の表し方', details: [
                            { id: '11-01-01-01', name: '+-を使って正負の数を表す' },
                            { id: '11-01-01-02', name: '数の大小' },
                            { id: '11-01-01-03', name: '整数・自然数・負の数' },
                            { id: '11-01-01-04', name: '反対の性質をもつ量' },
                            { id: '11-01-01-05', name: '基準量との増減' },
                            { id: '11-01-01-06', name: '平均との差' },
                            { id: '11-01-01-07', name: '負の数を使わずに表す' }
                        ]
                    },
                    {
                        id: '11-01-03', name: '正負の数の大小', details: [
                            { id: '11-01-03-01', name: '数直線上に表す・読む' },
                            { id: '11-01-03-02', name: '絶対値' },
                            { id: '11-01-03-03', name: '絶対値の利用（大小・個数）' },
                            { id: '11-01-03-04', name: '絶対値の利用（範囲）' },
                            { id: '11-01-03-05', name: '変域と絶対値（発展）' },
                            { id: '11-01-03-06', name: '絶対値の大小比較' },
                            { id: '11-01-03-07', name: '不等号を使った大小(2数)' },
                            { id: '11-01-03-08', name: '不等号を使った大小(多点比較)' },
                            { id: '11-01-03-09', name: '数の大小(並べかえ)' },
                            { id: '11-01-03-10', name: '2数の間の整数を探す' },
                            { id: '11-01-03-11', name: '条件にあう正負の数を求める' },
                            { id: '11-01-03-12', name: '条件にあう数を選ぶ' }
                        ]
                    },

                ]
            },
            {
                id: '11-02', name: '正の数・負の数の加法・減法', children: [
                    {
                        id: '11-02-01', name: '正の数・負の数の加法', details: [
                            { id: '11-02-01-01', name: '正・負の数の加法／同符号(整数)' },
                            { id: '11-02-01-02', name: '負の数の加法／異符号(整数、0を含む)' },
                            { id: '11-02-01-03', name: '負の数の加法／同符号・異符号(小数・分数)' },
                            { id: '11-02-01-04', name: '負の数の加法／3数以上(整数)' },
                            { id: '11-02-01-05', name: '負の数の加法／3数以上(整数・小数・分数)' }
                        ]
                    },
                    {
                        id: '11-02-02', name: '正の数・負の数の減法', details: [
                            { id: '11-02-02-01', name: '負の数の減法／加法になおして計算する' },
                            { id: '11-02-02-02', name: '負の数の減法(整数)' },
                            { id: '11-02-02-03', name: '負の数の減法(小数・分数)' },
                            { id: '11-02-02-04', name: '負の数の減法／3数以上(整数)' }
                        ]
                    },
                    {
                        id: '11-02-03', name: '正の数・負の数の加減／2数～', details: [
                            { id: '11-02-03-01', name: '負の項を求める／項のかっこなし' },
                            { id: '11-02-03-02', name: '負の項を求める／項のかっこあり' },
                            { id: '11-02-03-03', name: '正・負の数の加減／加法だけの式になおして計算' },
                            { id: '11-02-03-04', name: '正・負の数の加減／項を並べた式' },
                            { id: '11-02-03-05', name: '正・負の数の加減／項を並べた式になおして計算' },
                            { id: '11-02-03-06', name: '正・負の数の加減／まとめ(2数)' },
                            { id: '11-02-03-07', name: '負の数の加減／まとめ(整数)' },
                            { id: '11-02-03-08', name: '正・負の数の加減／まとめ(整数・小数・分数)' },
                            { id: '11-02-03-09', name: '正・負の数の加減／まとめ(小数と分数の加減あり)' }
                        ]
                    },
                    {
                        id: '11-02-04', name: '正の数・負の数の加減／かっこのある式', details: [
                            { id: '11-02-04-01', name: '正・負の数の加減／かっこあり(整数)' },
                            { id: '11-02-04-02', name: '正・負の数の加減／かっこあり(整数・小数・分数)' }
                        ]
                    }
                ]
            },
            {
                id: '11-03', name: '正の数・負の数の乗法・除法', children: [
                    {
                        id: '11-03-01', name: '正の数・負の数の乗法', details: [
                            { id: '11-03-01-01', name: '正・負の数の乗法／同符号' },
                            { id: '11-03-01-02', name: '正・負の数の乗法／同符号・異符号(整数)' },
                            { id: '11-03-01-03', name: '正・負の数の乗法・異符号(0・1を含む)' },
                            { id: '11-03-01-04', name: '正・負の数の乗法／同符号・異符号(小数・分数)' }
                        ]
                    },
                    {
                        id: '11-03-02', name: '正の数・負の数の乗法／3数以上', details: [
                            { id: '11-03-02-01', name: '正・負の数の乗法／3数以上、くふうして計算(交換・結合法則)' },
                            { id: '11-03-02-02', name: '正・負の数の乗法／3数以上、符号をきめて計算' }
                        ]
                    },
                    {
                        id: '11-03-03', name: '正の数・負の数の累乗', details: [
                            { id: '11-03-03-01', name: '数の積を累乗の指数を使って表す' },
                            { id: '11-03-03-02', name: '正・負の数の累乗(整数)' },
                            { id: '11-03-03-03', name: '正・負の数の累乗(小数・分数)' },
                            { id: '11-03-03-04', name: '負の数の累乗を含む乗法の計算' }
                        ]
                    },
                    {
                        id: '11-03-04', name: '正の数・負の数の逆数', details: [
                            { id: '11-03-04-01', name: '負の数の逆数を求める' }
                        ]
                    },
                    {
                        id: '11-03-05', name: '正の数・負の数の除法', details: [
                            { id: '11-03-05-01', name: '正・負の数の除法／同符号' },
                            { id: '11-03-05-02', name: '正・負の数の除法／同符号・異符号' },
                            { id: '11-03-05-03', name: '負の数の除法(小数)' },
                            { id: '11-03-05-04', name: '負の数の除法／乗法になおして計算する' }
                        ]
                    },
                    {
                        id: '11-03-06', name: '正の数・負の数の乗除', details: [
                            { id: '11-03-06-01', name: '負の数の乗除／2数' },
                            { id: '11-03-06-02', name: '負の数の乗除／3数以上、累乗なし' },
                            { id: '11-03-06-03', name: '正・負の数の乗除／～3数、累乗あり' },
                            { id: '11-03-06-04', name: '正・負の数の乗除／まとめ(3数以上)' }
                        ]
                    }
                ]
            },
            {
                id: '11-04', name: '正の数・負の数の四則の混じった計算', children: [
                    {
                        id: '11-04-01', name: '正の数・負の数の四則の混じった計算', details: [
                            { id: '11-04-01-01', name: '正・負の数の四則の混じった計算／累乗なし(整数)' },
                            { id: '11-04-01-02', name: '正・負の数の四則の混じった計算(小数・分数)' },
                            { id: '11-04-01-03', name: '正・負の数の四則の混じった計算／累乗あり(整数)' },
                            { id: '11-04-01-04', name: '正・負の数の四則の混じった計算／累乗あり(小数・分数)' },
                            { id: '11-04-01-05', name: '正・負の数の四則の混じった計算／累乗あり(小数・分数混)' },
                            { id: '11-04-01-06', name: '正・負の数の四則・( )のある計算／累乗なし(整数)' },
                            { id: '11-04-01-07', name: '正・負の数の四則・( )のある計算／累乗なし(小数・分数)' },
                            { id: '11-04-01-08', name: '正・負の数の四則・( )のある計算／累乗あり(整数)' },
                            { id: '11-04-01-09', name: '正・負の数の四則・( )のある計算／累乗あり(整数・小数・分数)' },
                            { id: '11-04-01-10', name: '正・負の数の四則・( )のある計算／複雑な式' },
                            { id: '11-04-01-11', name: '正・負の数の四則の混じった計算／まとめ' },
                            { id: '11-04-01-12', name: '正・負の数の四則・( )のある計算／まとめ' }
                        ]
                    },
                    {
                        id: '11-04-02', name: '分配法則を利用した正の数・負の数の計算', details: [
                            { id: '11-04-02-01', name: '正・負の数の四則混合計算／分配法則を利用' },
                            { id: '11-04-02-02', name: '正・負の数の四則混合計算／分配法則、99=100-1を利用' }
                        ]
                    },
                    {
                        id: '11-04-03', name: '数の範囲と四則計算', details: [
                            { id: '11-04-03-01', name: '四則計算の結果の範囲' },
                            { id: '11-04-03-02', name: '2数の符号と四則計算の結果' },
                            { id: '11-04-03-03', name: '計算結果や条件からそれぞれの数の符号を求める' }
                        ]
                    }
                ]
            },
            {
                id: '11-05', name: '正の数・負の数の利用', children: [
                    {
                        id: '11-05-01', name: '正の数・負の数の利用', details: [
                            { id: '11-05-01-01', name: '基準量との差を正の数・負の数で表す' },
                            { id: '11-05-01-02', name: '数で表された基準量との差より実際の値を求める' },
                            { id: '11-05-01-03', name: '基準量との差を表す、差より値を求める／まとめ' }
                        ]
                    },
                    {
                        id: '11-05-02', name: '正の数・負の数の加減の利用', details: [
                            { id: '11-05-02-01', name: 'ゲームの合計得点を求める' },
                            { id: '11-05-02-02', name: 'あてはまる数を求める' },
                            { id: '11-05-02-03', name: '3×3マスの縦・横・ななめの和をそろえる' }
                        ]
                    },
                    {
                        id: '11-05-03', name: '正の数・負の数の加減の利用／基準との差', details: [
                            { id: '11-05-03-01', name: '正・負の数の加減の利用／示された基準量との差より値を求める' },
                            { id: '11-05-03-02', name: '正・負の数の加減の利用／基準量との差の平均を求める' },
                            { id: '11-05-03-03', name: '正・負の数の加減の利用／基準量を求めて値を求める' },
                            { id: '11-05-03-04', name: '正・負の数の加減の利用／基準量を求めて平均を求める' },
                            { id: '11-05-03-05', name: '正・負の数の加減の利用／変化する基準量より値を求める' },
                            { id: '11-05-03-06', name: '正・負の数の加減の利用／変化する基準量より値を求める' },
                            { id: '11-05-03-07', name: '正・負の数の加減の利用／まとめ(基準量との差)' },
                            { id: '11-05-03-08', name: '正・負の数の加減の利用／身近なもの' }
                        ]
                    },
                    {
                        id: '11-05-04', name: '正の数・負の数の四則計算の利用', details: [
                            { id: '11-05-04-01', name: 'ことがらを式で表し計算をする' },
                            { id: '11-05-04-02', name: 'ゲームの合計得点を求める' },
                            { id: '11-05-04-03', name: 'ゲームの合計得点から場合の数' },
                            { id: '11-05-04-04', name: '小町算を完成させる' },
                            { id: '11-05-04-05', name: '複雑な分数(部分分数、繁分数)の計算' },
                            { id: '11-05-04-06', name: '等差数列の和' }
                        ]
                    },
                    {
                        id: '11-05-05', name: '正・負の数の四則計算の利用／基準量との差', details: [
                            { id: '11-05-05-01', name: '基準量との差より平均と差を求める' },
                            { id: '11-05-05-02', name: '基準量との差と平均より基準量を求める' }
                        ]
                    }
                ]
            },
            {
                id: '11-06', name: '素因数分解', children: [
                    {
                        id: '11-06-01', name: '素因数分解', details: [
                            { id: '11-06-01-01', name: 'ある範囲内の素数をすべて求める' },
                            { id: '11-06-01-02', name: '素数を選ぶ' },
                            { id: '11-06-01-03', name: '素因数分解する' },
                            { id: '11-06-01-04', name: '素因数分解の利用／2乗するとaになる数を求める' },
                            { id: '11-06-01-05', name: '素因数分解の利用／a×n=b²となる最小のnを求める' },
                            { id: '11-06-01-06', name: '素因数分解の利用／a÷n=b²となる最小のnを求める' },
                            { id: '11-06-01-07', name: '素因数分解の利用／分数を約分する' },
                            { id: '11-06-01-08', name: '素因数分解の利用／約数をすべて求める' },
                            { id: '11-06-01-09', name: '素因数分解の利用／約数の個数を求める' },
                            { id: '11-06-01-10', name: '素因数分解の利用／最大公約数・最小公倍数を求める' },
                            { id: '11-06-01-11', name: '素因数分解の利用／最大公約数・最小公倍数から、2数の一方の値' },
                            { id: '11-06-01-12', name: '素因数分解の利用／n/a、n/bがともに整数となるnを求める' },
                            { id: '11-06-01-13', name: '素因数分解の利用／×a/b、÷c/dどちらも自然数となる分数' },
                            { id: '11-06-01-14', name: '素因数分解の利用／約数の個数について、条件にあてはまる数など' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '12', name: '文字の式', children: [
            {
                id: '12-01', name: '文字を使った式', children: [
                    {
                        id: '12-01-01', name: '数量を文字を使った式で表す(×÷あり)', details: [
                            { id: '12-01-01-01', name: '規則的に並べるものの個数を文字を使った式で表す' },
                            { id: '12-01-01-02', name: 'いろいろな数量を文字を使った式で表す' }
                        ]
                    }
                ]
            },
            {
                id: '12-02', name: '文字の式の表し方', children: [
                    {
                        id: '12-02-01', name: '文字式の表し方／積', details: [
                            { id: '12-02-01-01', name: '文字式の積の表し方で表す／累乗なし' },
                            { id: '12-02-01-02', name: '文字式の積の表し方で表す／累乗あり' },
                            { id: '12-02-01-03', name: '文字式の積の表し方で表す／かっこあり' },
                            { id: '12-02-01-04', name: 'まとめ／文字式の積の表し方で表す' },
                            { id: '12-02-01-05', name: '文字式を×を使って表す' }
                        ]
                    },
                    {
                        id: '12-02-02', name: '文字式の表し方／商', details: [
                            { id: '12-02-02-01', name: '文字式の商の表し方で表す／かっこなし' },
                            { id: '12-02-02-02', name: '文字式の商の表し方で表す／かっこあり' },
                            { id: '12-02-02-03', name: '文字式を÷を使って表す' }
                        ]
                    },
                    {
                        id: '12-02-03', name: '文字式の表し方／四則の混じった式', details: [
                            { id: '12-02-03-01', name: '文字式の表し方で表す(×÷のみの式)' },
                            { id: '12-02-03-02', name: '文字式の表し方で表す(×÷+-が混じった式)' },
                            { id: '12-02-03-03', name: '文字式の表し方で表す(×÷+-が混じった式)／かっこあり' },
                            { id: '12-02-03-04', name: '文字式の表し方で表す(×÷+-が混じった式)／まとめ' },
                            { id: '12-02-03-05', name: '文字式を×÷を使って表す' }
                        ]
                    }
                ]
            },
            {
                id: '12-03', name: '数量を文字を使った式で表す', children: [
                    {
                        id: '12-03-01', name: 'いろいろな数量を文字式で表す', details: [
                            { id: '12-03-01-01', name: '数量を文字式で表す／全体の数量' },
                            { id: '12-03-01-02', name: '数量を文字式で表す／残りの数量' },
                            { id: '12-03-01-03', name: '数量を文字式で表す／単位あたりの数量・分配' },
                            { id: '12-03-01-04', name: '数量を文字式で表す／平均' },
                            { id: '12-03-01-05', name: '数量を文字式で表す／ある数' },
                            { id: '12-03-01-06', name: '数量を文字式で表す／単位変換' },
                            { id: '12-03-01-07', name: '数量を文字式で表す／単位変換(2つの和)' },
                            { id: '12-03-01-08', name: '数量を文字式で表す／速さ・道のり・時間' },
                            { id: '12-03-01-09', name: '数量を文字式で表す／平面図形' },
                            { id: '12-03-01-10', name: '数量を文字式で表す／空間図形' },
                            { id: '12-03-01-11', name: '数量を文字式で表す／割合' },
                            { id: '12-03-01-12', name: '数量を文字式で表す／食塩水の濃度' },
                            { id: '12-03-01-13', name: '数量を文字式で表す／規則的に並べるもの' },
                            { id: '12-03-01-14', name: '数量を文字式で表す／カレンダー' },
                            { id: '12-03-01-15', name: '数量を文字式で表す／まとめ' }
                        ]
                    },
                    {
                        id: '12-03-02', name: '文字の式が表す意味', details: [
                            { id: '12-03-02-01', name: '文字式が表す意味を考える／全体の数量' },
                            { id: '12-03-02-02', name: '文字式が表す意味を考える／速さ・道のり・時間' },
                            { id: '12-03-02-03', name: '文字式が表す意味を考える／平面図形' },
                            { id: '12-03-02-04', name: '文字式が表す意味を考える／空間図形' },
                            { id: '12-03-02-05', name: '文字式が表す意味を考える／ある数' }
                        ]
                    }
                ]
            },
            {
                id: '12-04', name: '式の値', children: [
                    {
                        id: '12-04-01', name: '文字が1種類', details: [
                            { id: '12-04-01-01', name: '式の値を求める／文字1種類(整数)' },
                            { id: '12-04-01-02', name: '式の値を求める／文字1種類・累乗あり(整数)' },
                            { id: '12-04-01-03', name: '式の値を求める／文字1種類(小数・分数)' }
                        ]
                    },
                    {
                        id: '12-04-02', name: '文字が2～3種類', details: [
                            { id: '12-04-02-01', name: '式の値を求める／文字2種類(整数)' },
                            { id: '12-04-02-02', name: '式の値を求める／文字2種類(整数・小数・分数)' },
                            { id: '12-04-02-03', name: '式の値を求める／文字3種類・分数式あり(整数)' },
                            { id: '12-04-02-04', name: '式の値を求める／文字3種類(整数・小数・分数)' }
                        ]
                    },
                    {
                        id: '12-04-03', name: 'まとめ／文字が1～3種類', details: [
                            { id: '12-04-03-01', name: '式の値を求める／まとめ(文字1種類)' },
                            { id: '12-04-03-02', name: '式の値を求める／まとめ(文字2種類)' },
                            { id: '12-04-03-03', name: '式の値を求める／まとめ(文字1～3種類)' }
                        ]
                    }
                ]
            },
            {
                id: '12-05', name: '1次式の計算', children: [
                    {
                        id: '12-05-01', name: '文字式の項と係数', details: [
                            { id: '12-05-01-01', name: '1次式の項・係数を答える' },
                            { id: '12-05-01-02', name: '文字の式の中から1次式を選ぶ' }
                        ]
                    },
                    {
                        id: '12-05-02', name: '項をまとめる', details: [
                            { id: '12-05-02-01', name: '文字の項・数の項をまとめて簡単にする' }
                        ]
                    },
                    {
                        id: '12-05-03', name: '1次式の加法・減法', details: [
                            { id: '12-05-03-01', name: '1次式の加法／かっこをはずす' },
                            { id: '12-05-03-02', name: '1次式の加法／多項式＋多項式' },
                            { id: '12-05-03-03', name: '1次式の減法／かっこをはずす' },
                            { id: '12-05-03-04', name: '1次式の減法／多項式－多項式' },
                            { id: '12-05-03-05', name: '1次式の加法・減法／まとめ' },
                            { id: '12-05-03-06', name: '1次式の加法／3つの多項式' },
                            { id: '12-05-03-07', name: '1次式の加減／縦書きの計算' },
                            { id: '12-05-03-08', name: '1次式の加減／与えられた2式をたす・ひく' },
                            { id: '12-05-03-09', name: '1次式の加減を利用してある式を求める' }
                        ]
                    },
                    {
                        id: '12-05-04', name: '1次式の乗法・除法', details: [
                            { id: '12-05-04-01', name: '項1つの1次式と数の乗法' },
                            { id: '12-05-04-02', name: '項1つの1次式と数の除法' },
                            { id: '12-05-04-03', name: '項1つの1次式と数の乗法・除法／まとめ' },
                            { id: '12-05-04-04', name: '文字の項と数の項の1次式と数の乗法' },
                            { id: '12-05-04-05', name: '文字の項と数の項の1次式と数の除法' },
                            { id: '12-05-04-06', name: '文字の項と数の項の1次式と数の乗法・除法／まとめ' },
                            { id: '12-05-04-07', name: '分子が1次式の分数と数の乗除' },
                            { id: '12-05-04-08', name: '1次式の乗法・除法／まとめ' }
                        ]
                    },
                    {
                        id: '12-05-05', name: '1次式の四則計算', details: [
                            { id: '12-05-05-01', name: '1次式と数の乗除、1次式の加減を含むいろいろな計算' },
                            { id: '12-05-05-02', name: '分子が1次式の分数など分数を含む1次式の加減' },
                            { id: '12-05-05-03', name: '1次式の四則計算／まとめ' },
                            { id: '12-05-05-04', name: '1次式の加減乗除を利用してある式を求める' },
                            { id: '12-05-05-05', name: '文字に1次式を代入して計算する' }
                        ]
                    }
                ]
            },
            {
                id: '12-06', name: '数量の関係を表す文字式', children: [
                    {
                        id: '12-06-01', name: '等しい関係を等式で表す', details: [
                            { id: '12-06-01-01', name: '等しい関係を等式で表す／全体の数量' },
                            { id: '12-06-01-02', name: '等しい関係を等式で表す／残りの数量' },
                            { id: '12-06-01-03', name: '等しい関係を等式で表す／数量のやりとり・移動' },
                            { id: '12-06-01-04', name: '等しい関係を等式で表す／過不足' },
                            { id: '12-06-01-05', name: '等しい関係を等式で表す／平均' },
                            { id: '12-06-01-06', name: '等しい関係を等式で表す／ある数' },
                            { id: '12-06-01-07', name: '等しい関係を等式で表す／速さ・道のり・時間' },
                            { id: '12-06-01-08', name: '等しい関係を等式で表す／平面図形・空間図形(公式)' },
                            { id: '12-06-01-09', name: '等しい関係を等式で表す／色の部分の面積(三角形・四角形)' },
                            { id: '12-06-01-10', name: '等しい関係を等式で表す／円周や円の面積など' },
                            { id: '12-06-01-11', name: '等しい関係を等式で表す／割合・濃度' },
                            { id: '12-06-01-12', name: '等しい関係を等式で表す／規則的にならんだ数' },
                            { id: '12-06-01-13', name: '等しい関係を等式で表す／まとめ' }
                        ]
                    },
                    {
                        id: '12-06-02', name: '大小関係を不等式で表す', details: [
                            { id: '12-06-02-01', name: '大小関係を不等式で表す／全体の数量、分配' },
                            { id: '12-06-02-02', name: '大小関係を不等式で表す／平均' },
                            { id: '12-06-02-03', name: '大小関係を不等式で表す／ある数' },
                            { id: '12-06-02-04', name: '大小関係を不等式で表す／速さ・道のり・時間' },
                            { id: '12-06-02-05', name: '大小関係を不等式で表す／いろいろな数量' },
                            { id: '12-06-02-06', name: '大小関係を不等式で表す／まとめ' }
                        ]
                    },
                    {
                        id: '12-06-03', name: '数量の関係を表す式の意味', details: [
                            { id: '12-06-03-01', name: '等式が表す数量の関係を考える／数量の和と差' },
                            { id: '12-06-03-02', name: '等式が表す数量の関係を考える／平面図形' },
                            { id: '12-06-03-03', name: '不等式が表す数量の関係を考える／全体の数量' },
                            { id: '12-06-03-04', name: '不等式が表す数量の関係を考える／残りの数量' },
                            { id: '12-06-03-05', name: '不等式が表す数量の関係を考える／数量の比較' },
                            { id: '12-06-03-06', name: '不等式が表す数量の関係を考える／平面図形' }
                        ]
                    },
                    {
                        id: '12-06-04', name: 'まとめ／数量の関係を表す文字式', details: [
                            { id: '12-06-04-01', name: '数量の関係を等式・不等式で表す' },
                            { id: '12-06-04-02', name: '等式・不等式が表す数量の関係を考える' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '13', name: '方程式', children: [
            {
                id: '13-01', name: '方程式の解き方', children: [
                    {
                        id: '13-01-01', name: '方程式とその解', details: [
                            { id: '13-01-01-01', name: '方程式の解となる数を代入して調べる' },
                            { id: '13-01-01-02', name: '与えられた解となる方程式を選ぶ' }
                        ]
                    },
                    {
                        id: '13-01-02', name: '方程式を等式の性質を使って解く', details: [
                            { id: '13-01-02-01', name: '等式の性質を使って方程式を解く／加法・減法1回' },
                            { id: '13-01-02-02', name: '等式の性質を使って方程式を解く／乗法・除法1回' },
                            { id: '13-01-02-03', name: '等式の性質を使って方程式を解く／まとめ' },
                            { id: '13-01-02-04', name: '方程式を等式の性質を使って解く　ax+b=c　を解く' },
                            { id: '13-01-02-05', name: '等式の性質を使って方程式を解き、使った性質を選ぶ' }
                        ]
                    },
                    {
                        id: '13-01-03', name: '1次方程式を解く', details: [
                            { id: '13-01-03-01', name: '1次方程式を解く／移項を使って' },
                            { id: '13-01-03-02', name: '1次方程式を解く／かっこのある方程式' },
                            { id: '13-01-03-03', name: '1次方程式を解く／小数係数の方程式' },
                            { id: '13-01-03-04', name: '1次方程式を解く／何十・何百の係数の方程式' },
                            { id: '13-01-03-05', name: '1次方程式を解く／分数係数の方程式(分子が単項式)' },
                            { id: '13-01-03-06', name: '1次方程式を解く／分数係数の方程式(分子が多項式)' },
                            { id: '13-01-03-07', name: '1次方程式を解く／分数・小数・かっこのある方程式' },
                            { id: '13-01-03-08', name: '1次方程式を解く／まとめ' }
                        ]
                    },
                    {
                        id: '13-01-04', name: '方程式の解から値を求める', details: [
                            { id: '13-01-04-01', name: '方程式の解を代入し、文字の値を求める' },
                            { id: '13-01-04-02', name: '2つの方程式の共通解を代入し、文字の値を求める' }
                        ]
                    },
                    {
                        id: '13-01-05', name: '約束記号(演算記号)', details: [
                            { id: '13-01-05-01', name: '約束記号の計算でxの値を求める' }
                        ]
                    }
                ]
            },
            {
                id: '13-02', name: '方程式の利用', children: [
                    {
                        id: '13-02-01', name: '代金と個数に関する方程式の問題', details: [
                            { id: '13-02-01-01', name: '方程式の利用／代金と個数(値段)から値段(個数)を求める' },
                            { id: '13-02-01-02', name: '方程式の利用／代金と個数の関係から個々の数を求める' },
                            { id: '13-02-01-03', name: '方程式の利用／代金と値段の関係から個々の値段を求める' },
                            { id: '13-02-01-04', name: '方程式の利用／個数の組み合わせと代金の関係から値段を求める' },
                            { id: '13-02-01-05', name: '方程式の利用／仕入れと利益・売り上げ高から個数を求める' }
                        ]
                    },
                    {
                        id: '13-02-02', name: '過不足に関する方程式の問題', details: [
                            { id: '13-02-02-01', name: '方程式の利用／ものを分配するとき、ものや人の数を求める' },
                            { id: '13-02-02-02', name: '方程式の利用／班分け・配車等をするとき、数を求める' },
                            { id: '13-02-02-03', name: '方程式の利用／値段・所持金を求める(所持金の過不足)' }
                        ]
                    },
                    {
                        id: '13-02-03', name: '分配に関する方程式の問題', details: [
                            { id: '13-02-03-01', name: '方程式の利用／全体と個々の数量の差から個々の数量を求める' },
                            { id: '13-02-03-02', name: '方程式の利用／全体と個々の数量(割合)から個々の数量を求める' },
                            { id: '13-02-03-03', name: '方程式の利用／全体の数量に対する割合から個々の数量を求める' },
                            { id: '13-02-03-04', name: '方程式の利用／個々の数量の比から個々の数量を求める' },
                            { id: '13-02-03-05', name: '方程式の利用／数量に対する割合から全体の数量を求める' },
                            { id: '13-02-03-06', name: '方程式の利用／全体をグループに分けるときのグループ数を求める' }
                        ]
                    },
                    {
                        id: '13-02-04', name: '数量移動や変動に関する方程式の問題', details: [
                            { id: '13-02-04-01', name: '方程式の利用／移動前・後の数量から移動する数量を求める' },
                            { id: '13-02-04-02', name: '方程式の利用／移動後・移動する数量から移動前の数量を求める' },
                            { id: '13-02-04-03', name: '方程式の利用／所持金・残金等から金額を求める' },
                            { id: '13-02-04-04', name: '方程式の利用／所持金・代金・残金から初めの所持金を求める' },
                            { id: '13-02-04-05', name: '方程式の利用／貯金した期間を求める(一定の変動)' },
                            { id: '13-02-04-06', name: '方程式の利用／2つの水そうに水を入れた時間を求める' },
                            { id: '13-02-04-07', name: '方程式の利用／水そうに水を入れた時間・容量を求める' }
                        ]
                    },
                    {
                        id: '13-02-05', name: '年齢・平均に関する方程式の問題', details: [
                            { id: '13-02-05-01', name: '方程式の利用／現在と過去・未来との数量関係から年齢を求める' },
                            { id: '13-02-05-02', name: '方程式の利用／現在と未来の年齢との数量関係から時期を求める' },
                            { id: '13-02-05-03', name: '方程式の利用／現在との年齢の数量関係から時期を求める(解が負)' },
                            { id: '13-02-05-04', name: '方程式の利用／個々の数量と平均から1つの数量を求める' },
                            { id: '13-02-05-05', name: '方程式の利用／2つの平均から1つの数量を求める' },
                            { id: '13-02-05-06', name: '方程式の利用／個々の数量の関係と平均から1つの数量を求める' },
                            { id: '13-02-05-07', name: '方程式の利用／個々の平均と全体の平均から個数を求める' },
                            { id: '13-02-05-08', name: '方程式の利用／2つの平均から個数を求める' }
                        ]
                    },
                    {
                        id: '13-02-06', name: '数に関する方程式の問題', details: [
                            { id: '13-02-06-01', name: '方程式の利用／ある数を求める' },
                            { id: '13-02-06-02', name: '方程式の利用／和と差から2つの整数(自然数)を求める' },
                            { id: '13-02-06-03', name: '方程式の利用／和から連続する整数を求める' },
                            { id: '13-02-06-04', name: '方程式の利用／各位の和や差から2けたの数を求める' },
                            { id: '13-02-06-05', name: '方程式の利用／各位の数を入れかえた差から2けたの数を求める' }
                        ]
                    },
                    {
                        id: '13-02-07', name: '速さに関する方程式の問題', details: [
                            { id: '13-02-07-01', name: '方程式の利用／所要時間の和から道のりを求める' },
                            { id: '13-02-07-02', name: '方程式の利用／所要時間の和とロスタイムから道のりを求める' },
                            { id: '13-02-07-03', name: '方程式の利用／所要時間の差から道のりを求める' },
                            { id: '13-02-07-04', name: '方程式の利用／基準時刻との差から道のりを求める' },
                            { id: '13-02-07-05', name: '方程式の利用／速さから道のり(時間)を求める' },
                            { id: '13-02-07-06', name: '方程式の利用／所要時間の和・差から時間を求める' },
                            { id: '13-02-07-07', name: '方程式の利用／2つが動くとき、追いつく時間を求める' },
                            { id: '13-02-07-08', name: '方程式の利用／2つが動くとき、追いつく距離を求める' },
                            { id: '13-02-07-09', name: '方程式の利用／2つが動くとき、出会う時間を求める' },
                            { id: '13-02-07-10', name: '方程式の利用／2つが動くとき、距離の和から追いつく時間' },
                            { id: '13-02-07-11', name: '方程式の利用／2つが動くとき、時間の和から出会う距離・時間' },
                            { id: '13-02-07-12', name: '方程式の利用／長さがあるもの(列車)について長さなど' },
                            { id: '13-02-07-13', name: '方程式の利用／長さがあるもの(列車)が通り抜ける時間' }
                        ]
                    },
                    {
                        id: '13-02-08', name: '時計に関する方程式の問題', details: [
                            { id: '13-02-08-01', name: '方程式の利用／長針と短針が重なる時刻を求める' },
                            { id: '13-02-08-02', name: '方程式の利用／長針と短針が一直線になる時刻を求める' },
                            { id: '13-02-08-03', name: '方程式の利用／長針と短針が直角になる時刻を求める' }
                        ]
                    },
                    {
                        id: '13-02-09', name: '図形に関する方程式の問題', details: [
                            { id: '13-02-09-01', name: '方程式の利用／平面図形の辺・周の長さや面積を求める' },
                            { id: '13-02-09-02', name: '方程式の利用／長方形の面積やその中にできる三角形の面積' },
                            { id: '13-02-09-03', name: '方程式の利用／三角形・長方形の辺上を1点が動く' },
                            { id: '13-02-09-04', name: '方程式の利用／三角形の辺上を2点が動く(追いつく時間)' },
                            { id: '13-02-09-05', name: '方程式の利用／長方形の辺上を2点が動く(面積、時間)' }
                        ]
                    },
                    {
                        id: '13-02-10', name: '割合に関する方程式の問題', details: [
                            { id: '13-02-10-01', name: '方程式の利用／全体と一部の割合から数量を求める' },
                            { id: '13-02-10-02', name: '方程式の利用／一部の割合・残りの割合から全体を求める' },
                            { id: '13-02-10-03', name: '方程式の利用／数量の増減の割合から数量を求める' },
                            { id: '13-02-10-04', name: '方程式の利用／仕事量(割合)から日数を求める' }
                        ]
                    },
                    {
                        id: '13-02-11', name: '売買の割合に関する方程式の問題', details: [
                            { id: '13-02-11-01', name: '方程式の利用／売価と割引率から定価を求める' },
                            { id: '13-02-11-02', name: '方程式の利用／売価-原価=利益　から定価を求める' },
                            { id: '13-02-11-03', name: '方程式の利用／売価-原価=利益　から割引率や割増率を求める' },
                            { id: '13-02-11-04', name: '方程式の利用／定価と割増率(利益)から原価を求める' },
                            { id: '13-02-11-05', name: '方程式の利用／利益率(定価)・値引額・値引率から原価を求める' },
                            { id: '13-02-11-06', name: '方程式の利用／定価・割引率・割増率(利益)から原価を求める' },
                            { id: '13-02-11-07', name: '方程式の利用／利益率(定価)・値引額・利益から原価を求める' }
                        ]
                    },
                    {
                        id: '13-02-12', name: '濃度に関する方程式の問題', details: [
                            { id: '13-02-12-01', name: '方程式の利用／加える水・食塩、蒸発させる水の量を求める' },
                            { id: '13-02-12-02', name: '方程式の利用／水・塩を加える前の食塩水の量を求める' },
                            { id: '13-02-12-03', name: '方程式の利用／まぜる食塩水の濃度を求める(2種類の食塩水)' },
                            { id: '13-02-12-04', name: '方程式の利用／まぜる食塩水の量を求める(2種類・3種類)' },
                            { id: '13-02-12-05', name: '方程式の利用／取り出した食塩水・加えた水・できた濃度を求める' },
                            { id: '13-02-12-06', name: '方程式の利用／できた食塩水の濃度からまぜた濃度を求める' }
                        ]
                    },
                    {
                        id: '13-02-13', name: '規則性に関する方程式の問題', details: [
                            { id: '13-02-13-01', name: '方程式の利用／規則的に並んでいる図形の個数の和から列' },
                            { id: '13-02-13-02', name: '方程式の利用／規則的に並んでいる図形の個数や周の長さについて' },
                            { id: '13-02-13-03', name: '方程式の利用／規則的に並んでいる数について' }
                        ]
                    }
                ]
            },
            {
                id: '13-03', name: '比と比例式', children: [
                    {
                        id: '13-03-01', name: '比と比の値', details: [
                            { id: '13-03-01-01', name: '簡単な整数の比になおす' },
                            { id: '13-03-01-02', name: '比の値を求める' },
                            { id: '13-03-01-03', name: '比例式で表す' }
                        ]
                    },
                    {
                        id: '13-03-02', name: '比例式を解く', details: [
                            { id: '13-03-02-01', name: '比例式を解く／整数のみ' },
                            { id: '13-03-02-02', name: '比例式を解く／xの係数あり' },
                            { id: '13-03-02-03', name: '比例式を解く／分数・小数あり' },
                            { id: '13-03-02-04', name: '比例式を解く／かっこあり' },
                            { id: '13-03-02-05', name: '比例式を解く／まとめ' }
                        ]
                    },
                    {
                        id: '13-03-03', name: '比例式の利用', details: [
                            { id: '13-03-03-01', name: '比例式の利用／比の一方の量、比に分ける' },
                            { id: '13-03-03-02', name: '比例式の利用／数量の変化' },
                            { id: '13-03-03-03', name: '比例式の利用／面積、縮図' }
                        ]
                    }
                ]
            },
            {
                id: '13-04', name: '〈教発〉不等式', children: [
                    {
                        id: '13-04-01', name: '〈教発〉不等式の性質', details: [
                            { id: '13-04-01-01', name: '〈教発〉多項式と数、単項式の大小について、不等式の解を調べる' },
                            { id: '13-04-01-02', name: '〈教発〉2式の大小関係を不等号で表す／同じ数の加減乗除1回' }
                        ]
                    },
                    {
                        id: '13-04-02', name: '〈教発〉不等式の性質を使って解く', details: [
                            { id: '13-04-02-01', name: '〈教発〉不等式の性質を使って解く／x+a<b(整数のみ)' },
                            { id: '13-04-02-02', name: '〈教発〉不等式の性質を使って解く／ax>b' },
                            { id: '13-04-02-03', name: '〈教発〉不等式の性質を使って解く／ax+b>c' },
                            { id: '13-04-02-04', name: '〈教発〉不等式の性質を使って解く／ax+b>cx+d' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '14', name: '比例と反比例', children: [
            {
                id: '14-01', name: 'ともなって変わる2つの量', children: [
                    {
                        id: '14-01-01', name: 'ともなって変わる2つの量', details: [
                            { id: '14-01-01-01', name: '「yがxの関数である」ものを選ぶ' },
                            { id: '14-01-01-02', name: '変域を不等号で表す' },
                            { id: '14-01-01-03', name: 'x、yの関係式、変域などを求める' }
                        ]
                    }
                ]
            },
            {
                id: '14-02', name: '比例', children: [
                    {
                        id: '14-02-01', name: 'xとyの比例の関係を式で表す', details: [
                            { id: '14-02-01-01', name: '1組のx、yの値から比例定数を求める' },
                            { id: '14-02-01-02', name: 'xとyの比例の関係を式で表す／1組のx、yの値から' },
                            { id: '14-02-01-03', name: 'xとyの比例の関係を式で表す／事象から' },
                            { id: '14-02-01-04', name: 'xとyの比例の関係を式で表す／具体的な事象(文章)から' }
                        ]
                    },
                    {
                        id: '14-02-02', name: '比例の識別', details: [
                            { id: '14-02-02-01', name: '比例の式から対応する値や値の変化など比例の特徴について' },
                            { id: '14-02-02-02', name: '比例しているものを選ぶ／xとyの関係式から' },
                            { id: '14-02-02-03', name: '比例しているものを選ぶ／xとyの関係を考えて' }
                        ]
                    },
                    {
                        id: '14-02-03', name: '対応する値を求める', details: [
                            { id: '14-02-03-01', name: '比例の式から対応する値を求める' },
                            { id: '14-02-03-02', name: '比例定数から比例の式を求め、対応する値を求める' },
                            { id: '14-02-03-03', name: '1組のx、yの値から比例の式を求め、対応する値を求める' },
                            { id: '14-02-03-04', name: 'x、yの値(表形式)から比例の式を求め、対応する値を求める' },
                            { id: '14-02-03-05', name: '1組のx、yの値から比例の式、xの変域からyの変域を求める' }
                        ]
                    }
                ]
            },
            {
                id: '14-03', name: '座標', children: [
                    {
                        id: '14-03-01', name: '座標平面上の点', details: [
                            { id: '14-03-01-01', name: '座標平面上の点の座標をよむ' },
                            { id: '14-03-01-02', name: '座標平面上に点を示す' },
                            { id: '14-03-01-03', name: '対称な点の座標を答える' },
                            { id: '14-03-01-04', name: 'まとめ／座標に点を示す・座標の点や対称な点の座標を答える' },
                            { id: '14-03-01-05', name: '移動した点の座標について答える' },
                            { id: '14-03-01-06', name: '座標上の2つの点の中点を求める' },
                            { id: '14-03-01-07', name: '座標上のある点について対称な点を求める' },
                            { id: '14-03-01-08', name: '移動した点や対称の点の座標から文字の値や座標を答える' }
                        ]
                    },
                    {
                        id: '14-03-02', name: '座標平面上にできる図形', details: [
                            { id: '14-03-02-01', name: '座標平面上の三角形の面積を求める' },
                            { id: '14-03-02-02', name: '座標平面上の四角形の面積を求める' },
                            { id: '14-03-02-03', name: '座標平面上で平行四辺形となる残りの1つの頂点の座標を求める' },
                            { id: '14-03-02-04', name: '座標平面上で平行四辺形となる座標を求める／方程式' },
                            { id: '14-03-02-05', name: '座標平面上の平行四辺形の対角線と頂点の座標について' }
                        ]
                    }
                ]
            },
            {
                id: '14-04', name: '比例のグラフ', children: [
                    {
                        id: '14-04-01', name: '比例のグラフをかく', details: [
                            { id: '14-04-01-01', name: '比例のグラフをかく／x、yの対応表から' },
                            { id: '14-04-01-02', name: '比例のグラフをかく／式から' },
                            { id: '14-04-01-03', name: '比例のグラフをかく／式から(変域あり)' },
                            { id: '14-04-01-04', name: '1組のx、yの値から比例の式を求めてグラフをかく' },
                            { id: '14-04-01-05', name: '比例のグラフをかく／まとめ(変域あり、なし)' }
                        ]
                    },
                    {
                        id: '14-04-02', name: '比例のグラフの特徴', details: [
                            { id: '14-04-02-01', name: '比例のグラフの特徴からグラフを選ぶ' }
                        ]
                    },
                    {
                        id: '14-04-03', name: '比例のグラフの式を求める', details: [
                            { id: '14-04-03-01', name: '比例のグラフの式を求める／あてはまる式を選ぶ' },
                            { id: '14-04-03-02', name: '比例のグラフの式を求める／方眼のグラフから' },
                            { id: '14-04-03-03', name: '比例のグラフの式を求める／グラフが通る1点の座標から' },
                            { id: '14-04-03-04', name: '比例のグラフの式を求める／x、yの増減から' },
                            { id: '14-04-03-05', name: '比例のグラフの式を求める／x、yの変域から文字の値' },
                            { id: '14-04-03-06', name: '比例のグラフの式を求める／x軸、y軸に対称な比例のグラフ' },
                            { id: '14-04-03-07', name: 'まとめ／条件をみたす比例の式を求める' }
                        ]
                    },
                    {
                        id: '14-04-04', name: '比例のグラフ上の点', details: [
                            { id: '14-04-04-01', name: '比例のグラフ上の点を求める' },
                            { id: '14-04-04-02', name: '1点から比例の式を求め、別の座標を求める' },
                            { id: '14-04-04-03', name: 'グラフから比例の式と座標を求める' }
                        ]
                    },
                    {
                        id: '14-04-05', name: '比例と比例のグラフ', details: [
                            { id: '14-04-05-01', name: 'まとめ／比例と比例のグラフ' }
                        ]
                    }
                ]
            },
            {
                id: '14-05', name: '反比例', children: [
                    {
                        id: '14-05-01', name: 'xとyの反比例の関係を式で表す', details: [
                            { id: '14-05-01-01', name: '1組のx、yの値から比例定数を求める' },
                            { id: '14-05-01-02', name: 'xとyの反比例の関係を式で表す／1組のx、yの値から' },
                            { id: '14-05-01-03', name: 'xとyの反比例の関係を式で表す／具体的な事象(文章)から' }
                        ]
                    },
                    {
                        id: '14-05-02', name: '反比例の識別', details: [
                            { id: '14-05-02-01', name: '反比例の式から対応する値や値の変化など反比例の特徴について' },
                            { id: '14-05-02-02', name: '反比例しているものを選ぶ／xとyの関係式から' },
                            { id: '14-05-02-03', name: '反比例しているものを選ぶ／xとyの関係を考えて' }
                        ]
                    },
                    {
                        id: '14-05-03', name: '対応する値を求める', details: [
                            { id: '14-05-03-01', name: '反比例の式から対応する値を求める' },
                            { id: '14-05-03-02', name: '比例定数から反比例の式を求め、対応する値を求める' },
                            { id: '14-05-03-03', name: '1組のx、yの値から反比例の式を求め、対応する値を求める' },
                            { id: '14-05-03-04', name: 'x、yの値(表形式)から反比例の式を求め、対応する値を求める' },
                            { id: '14-05-03-05', name: '1組のx、yの値から反比例の式、xの変域からyの変域を求める' }
                        ]
                    }
                ]
            },
            {
                id: '14-06', name: '反比例のグラフ', children: [
                    {
                        id: '14-06-01', name: '反比例のグラフをかく', details: [
                            { id: '14-06-01-01', name: '反比例のグラフをかく／x、yの対応表から' },
                            { id: '14-06-01-02', name: '反比例のグラフをかく／式から' },
                            { id: '14-06-01-03', name: '反比例のグラフをかく／式から(変域あり)' },
                            { id: '14-06-01-04', name: '1組のx、yの値から反比例の式を求めてグラフをかく' },
                            { id: '14-06-01-05', name: '反比例のグラフをかく／まとめ(変域あり、なし)' }
                        ]
                    },
                    {
                        id: '14-06-02', name: '反比例のグラフの特徴', details: [
                            { id: '14-06-02-01', name: '反比例のグラフの特徴を求める' },
                            { id: '14-06-02-02', name: '反比例のグラフの特徴からx、yの対応表を選ぶ' }
                        ]
                    },
                    {
                        id: '14-06-03', name: '反比例のグラフの式を求める', details: [
                            { id: '14-06-03-01', name: '反比例のグラフの式を求める／あてはまる式を選ぶ' },
                            { id: '14-06-03-02', name: '反比例のグラフの式を求める／方眼のグラフから' },
                            { id: '14-06-03-03', name: '反比例のグラフの式を求める／グラフが通る1点の座標から' },
                            { id: '14-06-03-04', name: '反比例のグラフの式を求める／x、yの変域から文字の値' },
                            { id: '14-06-03-05', name: '反比例のグラフの式を求める／x軸、y軸に対称な反比例のグラフ' },
                            { id: '14-06-03-06', name: 'まとめ／条件をみたす反比例の式を求める' }
                        ]
                    },
                    {
                        id: '14-06-04', name: '反比例のグラフ上の点', details: [
                            { id: '14-06-04-01', name: '反比例のグラフ上の点を求める' },
                            { id: '14-06-04-02', name: '1点から反比例の式を求め、別の座標を求める' }
                        ]
                    },
                    {
                        id: '14-06-05', name: '反比例と反比例のグラフ', details: [
                            { id: '14-06-05-01', name: 'まとめ／反比例と反比例のグラフ' }
                        ]
                    }
                ]
            },
            {
                id: '14-07', name: '比例と反比例の利用', children: [
                    {
                        id: '14-07-01', name: '比例の利用', details: [
                            { id: '14-07-01-01', name: '比例の利用／体積・水面の高さ' },
                            { id: '14-07-01-02', name: '比例の利用／速さ' },
                            { id: '14-07-01-03', name: '比例の利用／面積' },
                            { id: '14-07-01-04', name: '比例の利用／身近なもの' },
                            { id: '14-07-01-05', name: '比例の利用／ばね・ろうそく' },
                            { id: '14-07-01-06', name: '比例の利用／計量' },
                            { id: '14-07-01-07', name: '比例の利用／ランドルト環・遠近' },
                            { id: '14-07-01-08', name: '比例の利用／計量のしかた を説明する' },
                            { id: '14-07-01-09', name: '2つのものが動くときの距離や時間について、比例のグラフを読む' },
                            { id: '14-07-01-10', name: '2つのものが動くときの距離や時間についてグラフ等(追いかけ)' },
                            { id: '14-07-01-11', name: '比例のグラフや軸などの直線で囲まれた図形の面積を求める' },
                            { id: '14-07-01-12', name: '比例のグラフ上の点を頂点に持つ正方形をつくるときの座標' }
                        ]
                    },
                    {
                        id: '14-07-02', name: '反比例の利用', details: [
                            { id: '14-07-02-01', name: '反比例の利用／体積' },
                            { id: '14-07-02-02', name: '反比例の利用／速さ' },
                            { id: '14-07-02-03', name: '反比例の利用／面積' },
                            { id: '14-07-02-04', name: '反比例の利用／てんびん' },
                            { id: '14-07-02-05', name: '反比例の利用／歯車・仕事量' },
                            { id: '14-07-02-06', name: '反比例の利用／電子レンジ' },
                            { id: '14-07-02-07', name: '反比例の利用／ランドルト環・遠近' },
                            { id: '14-07-02-08', name: '反比例のグラフ上の点などでできる図形の面積について' },
                            { id: '14-07-02-09', name: '反比例のグラフ上にある格子点の数を求める' },
                            { id: '14-07-02-10', name: '反比例のグラフ上の点が動くとき、線分の長さや面積について' }
                        ]
                    }
                ]
            },
            {
                id: '14-08', name: '比例と反比例', children: [
                    {
                        id: '14-08-01', name: '比例と反比例の識別', details: [
                            { id: '14-08-01-01', name: '比例と反比例の識別／式・事象から' },
                            { id: '14-08-01-02', name: '比例と反比例の識別／x、yの値(対応表)から' },
                            { id: '14-08-01-03', name: '比例と反比例の識別／グラフから' }
                        ]
                    },
                    {
                        id: '14-08-02', name: 'xとyの関係を式で表す', details: [
                            { id: '14-08-02-01', name: '比例・反比例のxとyの関係を式で表す／1組のx、yの値から' },
                            { id: '14-08-02-02', name: '比例・反比例のxとyの関係を式で表す／具体的な事象から' },
                            { id: '14-08-02-03', name: '比例・反比例のグラフの式を求める／方眼のグラフから' },
                            { id: '14-08-02-04', name: '比例・反比例のグラフの式を求める／グラフが通る1点の座標から' }
                        ]
                    },
                    {
                        id: '14-08-03', name: '対応する値を求める', details: [
                            { id: '14-08-03-01', name: '1組のx、yの値から比例・反比例の式を求め、対応する値' },
                            { id: '14-08-03-02', name: '比例・反比例の関係にあるx、y、zから対応する値を求める' },
                            { id: '14-08-03-03', name: '比例・反比例のグラフ上の点を求める' }
                        ]
                    },
                    {
                        id: '14-08-04', name: '比例と反比例のグラフ', details: [
                            { id: '14-08-04-01', name: '比例・反比例のグラフをかく／式から' },
                            { id: '14-08-04-02', name: '比例・反比例のグラフをかく／1組のx、yの値から式を求めて' },
                            { id: '14-08-04-03', name: '比例・反比例のグラフの特徴から条件をみたす式を選ぶ' }
                        ]
                    },
                    {
                        id: '14-08-05', name: '比例と反比例のグラフの利用', details: [
                            { id: '14-08-05-01', name: '比例と反比例のグラフ上の点と線分の長さ' },
                            { id: '14-08-05-02', name: '比例と反比例のグラフ上の点と三角形の面積' },
                            { id: '14-08-05-03', name: '比例と反比例のグラフの交点とできる図形などについて' },
                            { id: '14-08-05-04', name: '比例と反比例のグラフの交点の座標から求める' },
                            { id: '14-08-05-05', name: '比例と反比例のグラフに囲まれた格子点の数' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '15', name: '平面図形', children: [
            {
                id: '15-01', name: '直線と角', children: [
                    {
                        id: '15-01-01', name: '直線と線分', details: [
                            { id: '15-01-01-01', name: '2点を通る直線の本数を求める' },
                            { id: '15-01-01-02', name: '直線・線分・半直線' },
                            { id: '15-01-01-03', name: '2点間の距離' },
                            { id: '15-01-01-04', name: '線分の長さや長さの関係を表す式' }
                        ]
                    },
                    {
                        id: '15-01-02', name: '角', details: [
                            { id: '15-01-02-01', name: '角の表し方／文字3つを使って表す' },
                            { id: '15-01-02-02', name: '∠を使って表された角の大きさを求める' },
                            { id: '15-01-02-03', name: '三角形を∠を使って表す' },
                            { id: '15-01-02-04', name: '作図／三角形をかく' },
                            { id: '15-01-02-05', name: '三角形が1通りにきまる条件を求める' }
                        ]
                    },
                    {
                        id: '15-01-03', name: '垂直と平行', details: [
                            { id: '15-01-03-01', name: '平行と垂直の関係を記号使って表す' },
                            { id: '15-01-03-02', name: '同じ平面上の3直線について平行や垂直の位置関係' },
                            { id: '15-01-03-03', name: '点と直線の距離' }
                        ]
                    }
                ]
            },
            {
                id: '15-02', name: '基本の作図', children: [
                    {
                        id: '15-02-01', name: '点の集合', details: [
                            { id: '15-02-01-01', name: '1直線から一定の距離にある点の集合' },
                            { id: '15-02-01-02', name: '作図／1直線から等しい距離にある平行線' },
                            { id: '15-02-01-03', name: '1点から等しい距離にある点の集まり' },
                            { id: '15-02-01-04', name: '作図／1点から一定の距離にある点の集合' },
                            { id: '15-02-01-05', name: '2点から等しい距離にある点の集合' },
                            { id: '15-02-01-06', name: '角をつくる2辺から等しい距離にある点の集合' },
                            { id: '15-02-01-07', name: '作図／2点からそれぞれ等しい距離にある点' },
                            { id: '15-02-01-08', name: '作図／1点と1直線から等しい距離にある点' }
                        ]
                    },
                    {
                        id: '15-02-02', name: '基本の作図', details: [
                            { id: '15-02-02-01', name: '垂直二等分線の性質' },
                            { id: '15-02-02-02', name: '作図／垂直二等分線' },
                            { id: '15-02-02-03', name: '作図／線分の中点' },
                            { id: '15-02-02-04', name: '角の二等分線の性質' },
                            { id: '15-02-02-05', name: '作図／角の二等分線' },
                            { id: '15-02-02-06', name: '作図／180°を2つに分けた角の二等分線とその大きさ' },
                            { id: '15-02-02-07', name: '作図／直線上の点を通る垂線' },
                            { id: '15-02-02-08', name: '作図／直線上にない点を通る垂線' }
                        ]
                    },
                    {
                        id: '15-02-03', name: '作図／垂直二等分線の利用', details: [
                            { id: '15-02-03-01', name: '作図／線分を4等分する' },
                            { id: '15-02-03-02', name: '作図／2点から等しい距離にある線上や円上の点' },
                            { id: '15-02-03-03', name: '作図／AB＝AP＋PC　となる点P' },
                            { id: '15-02-03-04', name: '作図／2点を通る円をかく' },
                            { id: '15-02-03-05', name: '作図／3点から等しい距離にある点を求める' },
                            { id: '15-02-03-06', name: '作図／弧や円から円の中心を求める' },
                            { id: '15-02-03-07', name: '作図／三角形を2等分する' },
                            { id: '15-02-03-08', name: '作図／いろいろな図形の折り目をかく' },
                            { id: '15-02-03-09', name: '〈教発〉作図／3点を通る円の中心を求める(外接円)' }
                        ]
                    },
                    {
                        id: '15-02-04', name: '作図／角の二等分線の利用', details: [
                            { id: '15-02-04-01', name: '作図／角を4等分する、15°、30°の角をつくる' },
                            { id: '15-02-04-02', name: '作図／2直線から等しい距離にある点の集合' },
                            { id: '15-02-04-03', name: '作図／2直線から等しい距離の線や円上の点' },
                            { id: '15-02-04-04', name: '作図／3辺から等しい距離にある点を求める' },
                            { id: '15-02-04-05', name: '作図／底辺が等しい三角形の面積が等しくなる点' },
                            { id: '15-02-04-06', name: '〈教発〉作図／3辺から等しい距離にある点を求める(内接円)' }
                        ]
                    },
                    {
                        id: '15-02-05', name: '作図／垂線の利用', details: [
                            { id: '15-02-05-01', name: '作図／三角形・平行四辺形の高さを求める' },
                            { id: '15-02-05-02', name: '作図／長方形・正方形をかく' },
                            { id: '15-02-05-03', name: '作図／線上にない点を通る平行線をひく' }
                        ]
                    },
                    {
                        id: '15-02-06', name: '作図／組み合わせ', details: [
                            { id: '15-02-06-01', name: '作図／75°、105°などの角をつくる' },
                            { id: '15-02-06-02', name: '作図／2点と2辺から等しい距離の点' },
                            { id: '15-02-06-03', name: '作図／2点から等距離と他の条件から' },
                            { id: '15-02-06-04', name: '作図／正多角形(正八角形、正十二角形等)をかく' },
                            { id: '15-02-06-05', name: '作図／線上にない点と線に接する円' },
                            { id: '15-02-06-06', name: '作図／線上の点と2直線に接する円' },
                            { id: '15-02-06-07', name: '作図／線上にない点と2直線に接する円' }
                        ]
                    }
                ]
            },
            {
                id: '15-03', name: '図形の移動', children: [
                    {
                        id: '15-03-01', name: '平行移動', details: [
                            { id: '15-03-01-01', name: '平行移動の性質' },
                            { id: '15-03-01-02', name: '作図／平行移動した図(方眼あり)' },
                            { id: '15-03-01-03', name: '作図／平行移動した図(方眼なし)' }
                        ]
                    },
                    {
                        id: '15-03-02', name: '回転移動', details: [
                            { id: '15-03-02-01', name: '回転移動の性質' },
                            { id: '15-03-02-02', name: '作図／回転移動した図' },
                            { id: '15-03-02-03', name: '作図／回転の中心を求める(線分の回転移動)' },
                            { id: '15-03-02-04', name: '作図／回転の中心を求める(三角形・四角形の回転移動)' },
                            { id: '15-03-02-05', name: '点対称移動の性質' },
                            { id: '15-03-02-06', name: '作図／点対称移動した図' },
                            { id: '15-03-02-07', name: '作図／回転の中心を求める(線分の点対称移動)' }
                        ]
                    },
                    {
                        id: '15-03-03', name: '対称移動', details: [
                            { id: '15-03-03-01', name: '対称移動の性質' },
                            { id: '15-03-03-02', name: '作図／対称移動した図(方眼あり)' },
                            { id: '15-03-03-03', name: '作図／対称移動した図(方眼なし)' },
                            { id: '15-03-03-04', name: '作図／対称の軸を求める' },
                            { id: '15-03-03-05', name: '角の辺を軸として対称移動した点でできる角の大きさ' }
                        ]
                    },
                    {
                        id: '15-03-04', name: '平行・対称・回転移動', details: [
                            { id: '15-03-04-01', name: '平行移動・対称移動・回転移動の性質' },
                            { id: '15-03-04-02', name: '作図／平行移動・対称移動・回転移動の組合せ' },
                            { id: '15-03-04-03', name: 'どのように移動したかを説明する' },
                            { id: '15-03-04-04', name: '方眼上の合同な図形についてどのように移動したか' },
                            { id: '15-03-04-05', name: '合同な図形をしきつめた図形／1回の移動で重ねる' },
                            { id: '15-03-04-06', name: '合同な図形をしきつめた図形／2回の移動で重ねる' },
                            { id: '15-03-04-07', name: '移動前後の2つの図形／1回で重ねる' },
                            { id: '15-03-04-08', name: '対称移動のくり返し' },
                            { id: '15-03-04-09', name: '作図／多角形が直線上を転がるとき、頂点が動いたあと' },
                            { id: '15-03-04-10', name: '作図／折れ線が最短距離となる点' },
                            { id: '15-03-04-11', name: '作図／円のあるものを挟んだ2点の最短距離' }
                        ]
                    }
                ]
            },
            {
                id: '15-04', name: '円', children: [
                    {
                        id: '15-04-01', name: '円の性質', details: [
                            { id: '15-04-01-01', name: '円の弧と弦' },
                            { id: '15-04-01-02', name: '交わる2つの円の性質' },
                            { id: '15-04-01-03', name: '円と直線の位置関係と交点の数' },
                            { id: '15-04-01-04', name: '円の接線の性質' },
                            { id: '15-04-01-05', name: '作図／円の接線' },
                            { id: '15-04-01-06', name: '接線の性質を利用して角の大きさを求める' }
                        ]
                    }
                ]
            },
            {
                id: '15-05', name: '円とおうぎ形', children: [
                    {
                        id: '15-05-01', name: '円の周の長さと面積', details: [
                            { id: '15-05-01-01', name: '円周の長さと面積を求める' }
                        ]
                    },
                    {
                        id: '15-05-02', name: 'おうぎ形の弧の長さと面積', details: [
                            { id: '15-05-02-01', name: 'おうぎ形の中心角と弧の長さ・面積の関係' },
                            { id: '15-05-02-02', name: 'おうぎ形の弧の長さと面積を求める' },
                            { id: '15-05-02-03', name: 'おうぎ形の中心角や面積を求める' },
                            { id: '15-05-02-04', name: 'おうぎ形の面積を求める／半径と弧の長さの公式から' },
                            { id: '15-05-02-05', name: '弧の長さが円周に等しいおうぎ形の中心角を求める' },
                            { id: '15-05-02-06', name: 'おうぎ形の中心角や弧の長さ を求める' }
                        ]
                    },
                    {
                        id: '15-05-03', name: 'おうぎ形の利用', details: [
                            { id: '15-05-03-01', name: 'おうぎ形を組み合わせた図形の周の長さと面積' },
                            { id: '15-05-03-02', name: 'おうぎ形と三角形・四角形を組み合わせた図形の周の長さと面積' },
                            { id: '15-05-03-03', name: '多角形の頂点に固定した糸が通るあとと面積' },
                            { id: '15-05-03-04', name: '図形が回転移動したあとと面積' },
                            { id: '15-05-03-05', name: '図形が直線上を転がるときの頂点の移動' },
                            { id: '15-05-03-06', name: '円が多角形の周を転がるときの点の移動と面積' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '16', name: '空間図形', children: [
            {
                id: '16-01', name: 'いろいろな立体', children: [
                    {
                        id: '16-01-01', name: '立体の分類', details: [
                            { id: '16-01-01-01', name: '立体をいろいろな見方で分類する' }
                        ]
                    },
                    {
                        id: '16-01-02', name: '多面体', details: [
                            { id: '16-01-02-01', name: '何面体かを答える' },
                            { id: '16-01-02-02', name: '見取り図から角柱・角錐の名前を答える' },
                            { id: '16-01-02-03', name: '角柱・角錐の面・辺・頂点の数を答える' }
                        ]
                    },
                    {
                        id: '16-01-03', name: '正多面体', details: [
                            { id: '16-01-03-01', name: '正多面体の定義と種類について' },
                            { id: '16-01-03-02', name: '正多面体の頂点・辺の数、面の形とその数について' },
                            { id: '16-01-03-03', name: '立体の面・辺・頂点の数から関係を求める(オイラーの多面体定理)' },
                            { id: '16-01-03-04', name: '正多面体のかどを切り取ってできる立体の名前などを答える' },
                            { id: '16-01-03-05', name: '正多面体の各面の中心を頂点としてできる立体の名前などを答える' },
                            { id: '16-01-03-06', name: '正多面体の見取図をかく' }
                        ]
                    }
                ]
            },
            {
                id: '16-02', name: '直線や平面の平行と垂直', children: [
                    {
                        id: '16-02-01', name: '平面の決定', details: [
                            { id: '16-02-01-01', name: '平面が1つに決まる条件を選ぶ' },
                            { id: '16-02-01-02', name: '考えられる平面の数を求める' }
                        ]
                    },
                    {
                        id: '16-02-02', name: '直線の位置関係', details: [
                            { id: '16-02-02-01', name: '2直線の位置関係／直方体・立方体・角柱' },
                            { id: '16-02-02-02', name: '2直線の位置関係／錐体' },
                            { id: '16-02-02-03', name: '2直線の位置関係／切られた立体' },
                            { id: '16-02-02-04', name: '3直線の位置関係' }
                        ]
                    },
                    {
                        id: '16-02-03', name: '直線と平面の距離・位置関係', details: [
                            { id: '16-02-03-01', name: '直線と平面が垂直に交わる条件' },
                            { id: '16-02-03-02', name: '角柱・円柱・錐体の高さ' },
                            { id: '16-02-03-03', name: '辺と面の位置関係／柱体・角錐' },
                            { id: '16-02-03-04', name: '辺と面の位置関係・距離／まとめ(柱体・角錐)' },
                            { id: '16-02-03-05', name: '2辺のつくる角／柱体' }
                        ]
                    },
                    {
                        id: '16-02-04', name: '平面の位置関係', details: [
                            { id: '16-02-04-01', name: '2平面の位置関係／柱体' },
                            { id: '16-02-04-02', name: '2平面の位置関係と距離／柱体' },
                            { id: '16-02-04-03', name: '2平面の位置関係と2平面のつくる角／柱体' },
                            { id: '16-02-04-04', name: '3平面の位置関係' },
                            { id: '16-02-04-05', name: '2平面に交わる平面(交線)の位置関係' }
                        ]
                    },
                    {
                        id: '16-02-05', name: '直線と平面の位置関係', details: [
                            { id: '16-02-05-01', name: 'まとめ／辺と面の位置関係(柱体)' },
                            { id: '16-02-05-02', name: 'まとめ／辺と面の位置関係と距離(柱体)' },
                            { id: '16-02-05-03', name: 'まとめ／空間内の直線と平面の位置関係' }
                        ]
                    }
                ]
            },
            {
                id: '16-03', name: '線や面が動いてできる立体', children: [
                    {
                        id: '16-03-01', name: '面や線を動かしてできる立体', details: [
                            { id: '16-03-01-01', name: '面を垂直方向に動かしてできる立体の名前を答える' },
                            { id: '16-03-01-02', name: '立体についてどんな図形をどのように移動したものか答える' },
                            { id: '16-03-01-03', name: '線分を垂面に立てて動かしてできる立体の名前を答える' },
                            { id: '16-03-01-04', name: '1点を通る線分を周にそって動かしてできる立体の名前を答える' }
                        ]
                    },
                    {
                        id: '16-03-02', name: '回転体', details: [
                            { id: '16-03-02-01', name: '面を回転させてできる立体の名前を答える' },
                            { id: '16-03-02-02', name: '回転体の切り口の形を答える／円錐・円柱' },
                            { id: '16-03-02-03', name: '回転体の切り口の形など／球' },
                            { id: '16-03-02-04', name: '作図／面を回転させてできる立体の見取図' },
                            { id: '16-03-02-05', name: '平面図形を回転させてできた立体からもとの図形を答える' }
                        ]
                    }
                ]
            },
            {
                id: '16-04', name: '立体の投影図', children: [
                    {
                        id: '16-04-01', name: '立体の投影図が表す立体', details: [
                            { id: '16-04-01-01', name: '投影図から立体の名前を答える' },
                            { id: '16-04-01-02', name: '投影図が表す立体の見取図を選ぶ(作図あり)' },
                            { id: '16-04-01-03', name: '2つ以上の立体が考えられる投影図' }
                        ]
                    },
                    {
                        id: '16-04-02', name: '立体の投影図', details: [
                            { id: '16-04-02-01', name: '作図／投影図をかく' },
                            { id: '16-04-02-02', name: '作図／投影図にしてできる立体の見取図と投影図' }
                        ]
                    }
                ]
            },
            {
                id: '16-05', name: '立体の展開図', children: [
                    {
                        id: '16-05-01', name: '角柱・円柱の展開図', details: [
                            { id: '16-05-01-01', name: '作図／角柱の展開図' },
                            { id: '16-05-01-02', name: '作図／円柱の展開図' },
                            { id: '16-05-01-03', name: '角柱の展開図が表す立体の名前を答える' },
                            { id: '16-05-01-04', name: '角柱や直方体の展開図から辺や面の位置関係を答える' },
                            { id: '16-05-01-05', name: '角柱の展開図を2通りで表す' }
                        ]
                    },
                    {
                        id: '16-05-02', name: '角錐や円錐の展開図', details: [
                            { id: '16-05-02-01', name: '作図／角錐の展開図' },
                            { id: '16-05-02-02', name: '円錐の展開図の中心角を求める' },
                            { id: '16-05-02-03', name: '作図／円錐の展開図' },
                            { id: '16-05-02-04', name: '角錐の展開図が表す立体の名前(作図あり)' },
                            { id: '16-05-02-05', name: '角錐の展開図から重なる点・辺を求める' },
                            { id: '16-05-02-06', name: '角錐の展開図を2通りで表す' }
                        ]
                    },
                    {
                        id: '16-05-03', name: '正多面体の展開図', details: [
                            { id: '16-05-03-01', name: '展開図が表している正多面体の名前を答える' },
                            { id: '16-05-03-02', name: '正六面体(立方体)の正しい展開図を選ぶ' },
                            { id: '16-05-03-03', name: '立方体の展開図から重なる点・辺・面や位置関係などを求める' },
                            { id: '16-05-03-04', name: '正四面体の展開図から重なる点や辺などを求める' },
                            { id: '16-05-03-05', name: '正八面体の展開図から重なる点・辺・面などを求める' },
                            { id: '16-05-03-06', name: '正十二面体の展開図から重なる点・辺・面などを求める' }
                        ]
                    },
                    {
                        id: '16-05-04', name: '展開図の利用／最短経路', details: [
                            { id: '16-05-04-01', name: '直方体・立方体の2～3面を通り最短となる経路(作図含む)' },
                            { id: '16-05-04-02', name: '正三角錐・正四面体の2面を通り最短となる経路' },
                            { id: '16-05-04-03', name: '作図／錐体の側面を最短距離で1周させる経路' },
                            { id: '16-05-04-04', name: '作図／角柱・円柱の側面を最短距離で1～2周させる経路' },
                            { id: '16-05-04-05', name: '錐体の側面を最短距離で1周する長さを求める(正三角形)' }
                        ]
                    }
                ]
            },
            {
                id: '16-06', name: '立体の表面積と体積', children: [
                    {
                        id: '16-06-01', name: '立体の表面積', details: [
                            { id: '16-06-01-01', name: '表面積・側面積(底面積)を求める／角柱' },
                            { id: '16-06-01-02', name: '表面積・側面積(底面積)を求める／円柱' },
                            { id: '16-06-01-03', name: '表面積を求める／正四角錐' },
                            { id: '16-06-01-04', name: '表面積(側面積)を求める／円錐' },
                            { id: '16-06-01-05', name: '表面積を求める／円錐台' },
                            { id: '16-06-01-06', name: 'まとめ／表面積を求める(柱体・錐体の見取図から)' },
                            { id: '16-06-01-07', name: '円錐の底面の円の半径・表面積を求める／展開図' },
                            { id: '16-06-01-08', name: '円錐の母線の長さ・表面積を求める／展開図' },
                            { id: '16-06-01-09', name: '底面の円の半径・表面積を求める／円錐を転がした図' },
                            { id: '16-06-01-10', name: '母線の長さ・表面積を求める／円錐を転がした図' }
                        ]
                    },
                    {
                        id: '16-06-02', name: '回転体の表面積', details: [
                            { id: '16-06-02-01', name: '回転体の表面積を求める／長方形を回転' },
                            { id: '16-06-02-02', name: '回転体の表面積を求める／長方形を半回転' },
                            { id: '16-06-02-03', name: '回転体の表面積を求める／三角形を回転' },
                            { id: '16-06-02-04', name: '回転体の表面積を求める／台形(三角形－三角形)を回転' },
                            { id: '16-06-02-05', name: '回転体の表面積を求める／台形(四角形＋三角形)を回転' },
                            { id: '16-06-02-06', name: '回転体の表面積を求める／台形(四角形－三角形)を回転' },
                            { id: '16-06-02-07', name: '回転体の表面積を求める／平行四辺形を回転' },
                            { id: '16-06-02-08', name: '回転体の表面積を求める／軸から離れた三角形を回転' },
                            { id: '16-06-02-09', name: '回転体の表面積を求める／三角形を回転(移動して考える)' }
                        ]
                    },
                    {
                        id: '16-06-03', name: '立体の体積', details: [
                            { id: '16-06-03-01', name: '立体の体積を求める／角柱' },
                            { id: '16-06-03-02', name: '立体の体積を求める／円柱' },
                            { id: '16-06-03-03', name: '立体の体積を求める／角錐' },
                            { id: '16-06-03-04', name: '立体の体積を求める／円錐' },
                            { id: '16-06-03-05', name: 'まとめ／立体の体積を求める' },
                            { id: '16-06-03-06', name: 'まとめ／立体の表面積・体積を求める' },
                            { id: '16-06-03-07', name: '正方形を折ってつくる三角錐の体積を求める' },
                            { id: '16-06-03-08', name: '容器に入った水の体積と水面の高さについて' }
                        ]
                    },
                    {
                        id: '16-06-04', name: '回転体の体積', details: [
                            { id: '16-06-04-01', name: '回転体の体積を求める／長方形を回転' },
                            { id: '16-06-04-02', name: '回転体の体積を求める／長方形を半回転' },
                            { id: '16-06-04-03', name: '回転体の体積を求める／三角形を回転' },
                            { id: '16-06-04-04', name: '回転体の体積を求める／台形(三角形－三角形)を回転' },
                            { id: '16-06-04-05', name: '回転体の体積を求める／台形(四角形＋三角形)を回転' },
                            { id: '16-06-04-06', name: '回転体の体積を求める／台形(四角形－三角形)を回転' },
                            { id: '16-06-04-07', name: '回転体の体積を求める／平行四辺形を回転' },
                            { id: '16-06-04-08', name: '回転体の体積を求める／軸から離れた三角形を回転' },
                            { id: '16-06-04-09', name: '回転体の表面積・体積を求める／長方形を回転' },
                            { id: '16-06-04-10', name: '回転体の表面積・体積を求める／三角形を回転' },
                            { id: '16-06-04-11', name: '回転体の表面積・体積を求める／台形を回転' }
                        ]
                    },
                    {
                        id: '16-06-05', name: '球の表面積・体積', details: [
                            { id: '16-06-05-01', name: '球の表面積を求める' },
                            { id: '16-06-05-02', name: '球の体積を求める' },
                            { id: '16-06-05-03', name: '球の表面積・体積を求める' },
                            { id: '16-06-05-04', name: '球の一部の表面積・体積を求める' },
                            { id: '16-06-05-05', name: '球の一部を組み合わせた立体の表面積・体積を求める' },
                            { id: '16-06-05-06', name: '表面積比・体積比を求める／円柱の中の球について' },
                            { id: '16-06-05-07', name: '表面積比・体積比を求める／円柱の中の球・円錐について' },
                            { id: '16-06-05-08', name: '回転体の表面積・体積を求める／半円' },
                            { id: '16-06-05-09', name: '回転体の表面積・体積を求める／90°のおうぎ形と三・四角形' },
                            { id: '16-06-05-10', name: '球の表面積に等しい円柱、体積に等しい円柱・円錐' },
                            { id: '16-06-05-11', name: '半径の違う球の表面積・体積の比を求める' },
                            { id: '16-06-05-12', name: '大きい球と同じ体積の小さい球をつくる' }
                        ]
                    }
                ]
            },
            {
                id: '16-07', name: '〈教外・発〉立体の切断', children: [
                    {
                        id: '16-07-01', name: '底面に平行・垂直に切るとき', details: [
                            { id: '16-07-01-01', name: '切り口の形／錐体・柱体を底面に平行な面で切る' },
                            { id: '16-07-01-02', name: '切り口の形／柱体を底面に垂直な面で切る' },
                            { id: '16-07-01-03', name: '切り口の形／正四角錐を底面に平行・垂直な面で切る' }
                        ]
                    },
                    {
                        id: '16-07-02', name: '〈教発〉柱体の切り口', details: [
                            { id: '16-07-02-01', name: '〈教発〉立方体の切り口の図形／3～4点を通る' },
                            { id: '16-07-02-02', name: '〈教発〉立方体の切り口の図形／辺の中点を通る平面で切るとき' },
                            { id: '16-07-02-03', name: '〈教発〉作図／立方体の切り口を見取図に表す' },
                            { id: '16-07-02-04', name: '〈教発〉立方体の切り口の変化' },
                            { id: '16-07-02-05', name: '〈教発〉作図／立方体の切り口を展開図に表す' },
                            { id: '16-07-02-06', name: '〈教外〉切り口の図形を答える／直方体' },
                            { id: '16-07-02-07', name: '〈教外〉切り口の図形を答える／三角柱' },
                            { id: '16-07-02-08', name: '〈教外〉作図／角柱を切断した立体の展開図をかく' }
                        ]
                    },
                    {
                        id: '16-07-03', name: '〈教外〉すいは、正多面体の切り口', details: [
                            { id: '16-07-03-01', name: '〈教外〉切り口の図形を答える／正四面体・正四角錐' },
                            { id: '16-07-03-02', name: '〈教外〉作図／正四面体の切り口を展開図に表す' },
                            { id: '16-07-03-03', name: '〈教外〉切り口の図形を答える／正八面体' }
                        ]
                    },
                    {
                        id: '16-07-04', name: '〈教外〉立体の切断と体積', details: [
                            { id: '16-07-04-01', name: '〈教外〉切断によってできた立体の形を答える' },
                            { id: '16-07-04-02', name: '〈教外〉立方体・直方体を切断した立体の体積を求める' },
                            { id: '16-07-04-03', name: '〈教外〉柱体を切断した立体の体積を求める' },
                            { id: '16-07-04-04', name: '〈教外〉錐体を切断した立体の体積を求める' }
                        ]
                    },
                    {
                        id: '16-07-05', name: '〈教外〉立体の切断と体積／はり合わせ', details: [
                            { id: '16-07-05-01', name: '〈教外〉はり合わせてできる立体の体積を求める①' },
                            { id: '16-07-05-02', name: '〈教外〉はり合わせてできる立体の体積を求める②' }
                        ]
                    },
                    {
                        id: '16-07-06', name: '〈教外〉立体の体積と立体の分割', details: [
                            { id: '16-07-06-01', name: '〈教外〉分割した立体の体積を求める①' },
                            { id: '16-07-06-02', name: '〈教外〉分割した立体の体積を求める②' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '17', name: 'データの活用', children: [
            {
                id: '17-01', name: 'データの活用', children: [
                    {
                        id: '17-01-01', name: '度数分布表', details: [
                            { id: '17-01-01-01', name: '度数分布表を見て，階級と階級の幅を求める' },
                            { id: '17-01-01-02', name: '度数分布表をつくる' },
                            { id: '17-01-01-03', name: '度数分布表をつくり，それを見て答える' },
                            { id: '17-01-01-04', name: '度数分布表をつくり，それを見て答える／割合を含む' }
                        ]
                    },
                    {
                        id: '17-01-02', name: 'ヒストグラムと度数分布多角形(度数折れ線)', details: [
                            { id: '17-01-02-02', name: '度数分布表・ヒストグラム・度数分布多角形をかく' },
                            { id: '17-01-02-03', name: '度数分布表をよむ，ヒストグラムと度数分布多角形をかく' },
                            { id: '17-01-02-05', name: 'ヒストグラムをよむ，度数分布多角形をかく' },
                            { id: '17-01-02-06', name: 'ヒストグラムをよむ(割合含む)，度数分布多角形をかく' }
                        ]
                    },
                    {
                        id: '17-01-03', name: '相対度数', details: [
                            { id: '17-01-03-01', name: '度数分布表から相対度数を求める' },
                            { id: '17-01-03-02', name: 'ヒストグラムから，相対度数を求める' },
                            { id: '17-01-03-03', name: '相対度数より度数を求める' },
                            { id: '17-01-03-04', name: '相対度数の度数分布多角形をかき，2つの分布の比較' },
                            { id: '17-01-03-05', name: '2つの度数分布表(相対度数含む)の比較／割合を含む' },
                            { id: '17-01-03-06', name: '2つの相対度数の度数分布多角形をよみとる' }
                        ]
                    },
                    {
                        id: '17-01-04', name: '累積度数', details: [
                            { id: '17-01-04-01', name: '度数分布表から累積度数を求める' },
                            { id: '17-01-04-02', name: '度数分布表から累積相対度数を求める' },
                            { id: '17-01-04-03', name: '度数分布表から累積相対度数とグラフ' },
                            { id: '17-01-04-04', name: '2つの度数分布表(累積相対度数含む)の比較' }
                        ]
                    }
                ]
            },
            {
                id: '17-02', name: '代表値と散らばり', children: [
                    {
                        id: '17-02-01', name: '平均値', details: [
                            { id: '17-02-01-01', name: 'データの範囲を求める' },
                            { id: '17-02-01-03', name: 'それぞれの平均と全体の平均より平均を求める' },
                            { id: '17-02-01-04', name: '階級・階級値などを求める' },
                            { id: '17-02-01-05', name: '度数分布表から階級値を使って平均値を求める' },
                            { id: '17-02-01-06', name: 'ヒストグラムから階級値を使って平均値を求める' },
                            { id: '17-02-01-07', name: '平均値と過不足の平均から仮平均を求める' },
                            { id: '17-02-01-08', name: '仮平均と平均値から過不足の値，個々の値を求める' },
                            { id: '17-02-01-09', name: '仮平均と過不足の平均から平均値を求める' },
                            { id: '17-02-01-10', name: '仮平均と過不足表より，平均値についての問い' },
                            { id: '17-02-01-11', name: '度数分布表から仮平均を利用して平均を求める' }
                        ]
                    },
                    {
                        id: '17-02-02', name: '中央値・最頻値', details: [
                            { id: '17-02-02-01', name: '記録より中央値を求める／記録奇数' },
                            { id: '17-02-02-02', name: '記録より中央値を求める／記録偶数' },
                            { id: '17-02-02-03', name: '度数分布表より中央値の階級を求める' },
                            { id: '17-02-02-04', name: '記録より最頻値を求める' },
                            { id: '17-02-02-05', name: '度数分布表より最頻値を求める' },
                            { id: '17-02-02-06', name: '記録より範囲・平均値・中央値・最頻値などを求める' },
                            { id: '17-02-02-07', name: '説明よりあてはまるヒストグラムを選ぶ' },
                            { id: '17-02-02-08', name: 'ヒストグラムから中央値を求める' },
                            { id: '17-02-02-09', name: 'ヒストグラムから代表値などを求める' },
                            { id: '17-02-02-10', name: 'ヒストグラムの活用' },
                            { id: '17-02-02-11', name: 'どの代表値を選ぶのが適切か答える' },
                            { id: '17-02-02-12', name: '中央値より記録を求める' }
                        ]
                    }
                ]
            },
            {
                id: '17-03', name: 'まとめ／度数分布・ヒストグラム', children: [
                    {
                        id: '17-03-01', name: 'まとめ／度数分布・ヒストグラム', details: [
                            { id: '17-03-01-01', name: 'まとめ／度数分布表をつくり，平均値を求める' },
                            { id: '17-03-01-02', name: 'まとめ／度数分布表をつくり，それを見て答える' },
                            { id: '17-03-01-03', name: 'まとめ／度数分布表を見て答える(度数の増減あり)' },
                            { id: '17-03-01-04', name: 'まとめ／相対度数の度数分布表を見て答える' },
                            { id: '17-03-01-05', name: 'まとめ／2つの資料の比較' },
                            { id: '17-03-01-06', name: 'まとめ／2つの度数分布表の比較' },
                            { id: '17-03-01-07', name: 'まとめ／2つのヒストグラムの比較' }
                        ]
                    }
                ]
            },
            {
                id: '17-04', name: 'ことがらの起こりやすさ', children: [
                    {
                        id: '17-04-01', name: '多数回試行と確率', details: [
                            { id: '17-04-01-01', name: '多数回試行における相対度数を求める' },
                            { id: '17-04-01-02', name: '多数回試行の相対度数の変化について' },
                            { id: '17-04-01-03', name: '多数回試行の結果より確率を求める' },
                            { id: '17-04-01-04', name: 'どちらが起こりやすいか確率を求める' },
                            { id: '17-04-01-05', name: '多数回試行について正しいかどうか答える' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '21', name: '式の計算', children: [
            {
                id: '21-01', name: '単項式と多項式', children: [
                    {
                        id: '21-01-01', name: '単項式と多項式', details: [
                            { id: '21-01-01-01', name: '単項式と多項式の識別' },
                            { id: '21-01-01-02', name: '多項式の項・係数を答える' },
                            { id: '21-01-01-03', name: '多項式の定数項を答える' }
                        ]
                    },
                    {
                        id: '21-01-02', name: '式の次数', details: [
                            { id: '21-01-02-01', name: '式の次数を答える' },
                            { id: '21-01-02-02', name: '何次式かを答える' },
                            { id: '21-01-02-03', name: 'まとめ／単項式・多項式と次数' }
                        ]
                    }
                ]
            },
            {
                id: '21-02', name: '多項式の加法・減法', children: [
                    {
                        id: '21-02-01', name: '多項式の同類項', details: [
                            { id: '21-02-01-01', name: '多項式の同類項を答える' },
                            { id: '21-02-01-02', name: '同類項をまとめる／整数係数' },
                            { id: '21-02-01-03', name: '同類項をまとめる／小数・分数係数' }
                        ]
                    },
                    {
                        id: '21-02-02', name: '多項式の加法・減法', details: [
                            { id: '21-02-02-01', name: '多項式の加法／整数係数' },
                            { id: '21-02-02-02', name: '多項式の加法／小数・分数係数' },
                            { id: '21-02-02-03', name: '多項式の減法／整数係数' },
                            { id: '21-02-02-04', name: '多項式の減法／小数・分数係数' },
                            { id: '21-02-02-05', name: '多項式の加法／縦書きの計算' },
                            { id: '21-02-02-06', name: '多項式の加味／2つの式の和・差を求める(整数係数)' },
                            { id: '21-02-02-07', name: '多項式の加味／2つの式の和・差を求める' },
                            { id: '21-02-02-08', name: 'まとめ／多項式の加法・減法' },
                            { id: '21-02-02-09', name: '多項式の加味／2重かっこあり' },
                            { id: '21-02-02-10', name: '多項式の加味／あてはまる式を求める' }
                        ]
                    }
                ]
            },
            {
                id: '21-03', name: '式の乗法・除法', children: [
                    {
                        id: '21-03-01', name: '数と多項式の乗法・除法', details: [
                            { id: '21-03-01-01', name: '数と多項式の乗法' },
                            { id: '21-03-01-02', name: '数と多項式の除法' },
                            { id: '21-03-01-03', name: 'まとめ／数と多項式の乗除' }
                        ]
                    },
                    {
                        id: '21-03-02', name: '数と多項式の乗法・除法の和と差', details: [
                            { id: '21-03-02-01', name: '整数×多項式の和と差' },
                            { id: '21-03-02-02', name: '分数×多項式の和と差' },
                            { id: '21-03-02-03', name: '整数×多項式(分数係数)の和と差' },
                            { id: '21-03-02-04', name: '分子が多項式の和と差' },
                            { id: '21-03-02-05', name: '小数×多項式の和と差' },
                            { id: '21-03-02-06', name: '整数×多項式, 多項式÷整数の和と差' },
                            { id: '21-03-02-07', name: '数×多項式の和と差／まとめ' }
                        ]
                    },
                    {
                        id: '21-03-03', name: '多項式の計算の利用', details: [
                            { id: '21-03-03-01', name: '多項式の計算の利用／文字に式を代入' },
                            { id: '21-03-03-02', name: '多項式の計算の利用／文字に式を代入(2重かっこあり)' },
                            { id: '21-03-03-03', name: '多項式の計算の利用／あてはまる式を求める' },
                            { id: '21-03-03-04', name: '多項式の計算の利用／あてはまる式を求める(文字に式を代入)' }
                        ]
                    },
                    {
                        id: '21-03-04', name: '単項式の乗法・除法', details: [
                            { id: '21-03-04-01', name: '単項式どうしの積／指数なし' },
                            { id: '21-03-04-02', name: '単項式どうしの積／指数あり' },
                            { id: '21-03-04-03', name: '単項式の累乗' },
                            { id: '21-03-04-04', name: '単項式の累乗との積' },
                            { id: '21-03-04-05', name: 'まとめ／単項式の乗法' },
                            { id: '21-03-04-06', name: '単項式の除法' },
                            { id: '21-03-04-07', name: '3つの単項式の乗除' },
                            { id: '21-03-04-08', name: '単項式の乗除／まとめ' }
                        ]
                    },
                    {
                        id: '21-03-05', name: '単項式の乗除の利用', details: [
                            { id: '21-03-05-01', name: '単項式の乗除／あてはまる単項式を求める' }
                        ]
                    },
                    {
                        id: '21-03-06', name: '数と単項式と多項式の四則のまじった計算', details: [
                            { id: '21-03-06-01', name: '数と単項式と多項式の四則のまじった計算' }
                        ]
                    }
                ]
            },
            {
                id: '21-04', name: '式の値', children: [
                    {
                        id: '21-04-01', name: '式の値', details: [
                            { id: '21-04-01-01', name: '式の値を求める／文字2つ' },
                            { id: '21-04-01-02', name: '式の値を求める／文字3つ' },
                            { id: '21-04-01-03', name: '式の値を求める／分子が多項式' }
                        ]
                    }
                ]
            },
            {
                id: '21-05', name: '文字式の利用', children: [
                    {
                        id: '21-05-01', name: '式の利用／整数の性質について', details: [
                            { id: '21-05-01-01', name: '数を文字式で表す' },
                            { id: '21-05-01-02', name: '偶数と奇数の和や差についての説明' },
                            { id: '21-05-01-03', name: '2けたの数と各位の数を入れかえた数の和や差の説明' },
                            { id: '21-05-01-04', name: '3けたの数と百と一の位の数を入れかえた数の差の説明' },
                            { id: '21-05-01-05', name: '一定の性質をもつ複数の整数の和についての説明' },
                            { id: '21-05-01-06', name: '2けたと3けたの数の各位の数の和についての説明' },
                            { id: '21-05-01-07', name: '同じ数の倍数どうしの和や差についての説明' },
                            { id: '21-05-01-08', name: '同じ数でわった商や余りについて数の和や差の説明' },
                            { id: '21-05-01-09', name: '数表(カレンダー)の数の性質について証明' }
                        ]
                    },
                    {
                        id: '21-05-02', name: '等式の変形', details: [
                            { id: '21-05-02-01', name: '等式の変形／ax + by + c = 0 の形' },
                            { id: '21-05-02-02', name: '等式の変形／ax = b の形' },
                            { id: '21-05-02-03', name: '等式の変形／分数を含む式' },
                            { id: '21-05-02-04', name: '等式の変形／かっこを含む式' },
                            { id: '21-05-02-05', name: '等式の変形／数と単項式と多項式の四則のまじった形' },
                            { id: '21-05-02-06', name: '等式の変形／比で表されている形' },
                            { id: '21-05-02-07', name: '等式の変形／まとめ' }
                        ]
                    },
                    {
                        id: '21-05-03', name: '式の利用／さまざまな事象', details: [
                            { id: '21-05-03-01', name: 'さまざまな事象について文字式で表す' },
                            { id: '21-05-03-02', name: '速さ・道のり・時間の関係について文字式で表す' },
                            { id: '21-05-03-03', name: '平均を文字式で表す' },
                            { id: '21-05-03-04', name: '比の性質と式の値(文字の比)' }
                        ]
                    },
                    {
                        id: '21-05-04', name: '式の利用／図形について', details: [
                            { id: '21-05-04-01', name: '体積・面積を文字の式で表し，等式の変形や式の値などを求める' },
                            { id: '21-05-04-02', name: '表面積・体積を文字の式で表す' },
                            { id: '21-05-04-03', name: '複雑な平面図形の面積を文字式で表し，等式の変形など' },
                            { id: '21-05-04-04', name: 'もとの図形をx倍したとき体積・面積などの変化' },
                            { id: '21-05-04-05', name: '回転体の体積を文字の式で表す' },
                            { id: '21-05-04-06', name: '円に内接する2つの円の円周などを求める' },
                            { id: '21-05-04-07', name: 'トラックのスタート位置を求める' },
                            { id: '21-05-04-08', name: 'おうぎ形の面積の公式の証明' },
                            { id: '21-05-04-09', name: '円から一定距離を離して円を作るときの長さ' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '22', name: '連立方程式', children: [
            {
                id: '22-01', name: '連立方程式', children: [
                    {
                        id: '22-01-01', name: '2元1次方程式とその解', details: [
                            { id: '22-01-01-01', name: '2元1次方程式を成り立たせるx，yの値の組／表示形式' },
                            { id: '22-01-01-02', name: '2元1次方程式を成り立たせる整数x，yの値の組／式や値を選ぶ' },
                            { id: '22-01-01-03', name: '2元1次方程式を成り立たせる整数x，yの値の組' }
                        ]
                    },
                    {
                        id: '22-01-02', name: '連立方程式とその解', details: [
                            { id: '22-01-02-01', name: '表などを利用して，連立方程式の解を求める／解が整数のみ' },
                            { id: '22-01-02-02', name: '連立方程式とその解' }
                        ]
                    }
                ]
            },
            {
                id: '22-02', name: '連立方程式の解き方', children: [
                    {
                        id: '22-02-01', name: '加減法', details: [
                            { id: '22-02-01-01', name: '連立方程式の解き方／2式をそのまま加減する' },
                            { id: '22-02-01-02', name: '連立方程式の解き方／一方の式を何倍かにして加減する' },
                            { id: '22-02-01-03', name: '連立方程式の解き方／2式とも何倍かにして加減する' }
                        ]
                    },
                    {
                        id: '22-02-02', name: '代入法', details: [
                            { id: '22-02-02-01', name: '連立方程式の解き方／そのまま代入する' },
                            { id: '22-02-02-02', name: '連立方程式の解き方／そのまま代入する(1以外の係数)' },
                            { id: '22-02-02-03', name: '連立方程式の解き方／式の変形をして代入する' }
                        ]
                    },
                    {
                        id: '22-02-03', name: '加減法と代入法', details: [
                            { id: '22-02-03-01', name: '連立方程式の解き方／まとめ' }
                        ]
                    }
                ]
            },
            {
                id: '22-03', name: 'いろいろな連立方程式', children: [
                    {
                        id: '22-03-01', name: '連立方程式を整理してから解く', details: [
                            { id: '22-03-01-01', name: '連立方程式を解く／同類項のある連立方程式' },
                            { id: '22-03-01-02', name: '連立方程式を解く／何十・何百の係数の連立方程式' },
                            { id: '22-03-01-03', name: '連立方程式を解く／かっこのある連立方程式' },
                            { id: '22-03-01-04', name: '連立方程式を解く／小数係数の連立方程式' },
                            { id: '22-03-01-05', name: '連立方程式を解く／分数係数の連立方程式' },
                            { id: '22-03-01-06', name: '連立方程式を解く／分子が多項式の分数の連立方程式' },
                            { id: '22-03-01-07', name: '連立方程式を解く／分数・小数・かっこのある連立方程式' },
                            { id: '22-03-01-08', name: '連立方程式を解く／比例式で表示されている連立方程式' }
                        ]
                    },
                    {
                        id: '22-03-02', name: 'A=B=C の連立方程式を解く', details: [
                            { id: '22-03-02-01', name: 'A=B=C の連立方程式／整数係数' },
                            { id: '22-03-02-02', name: 'A=B=C の連立方程式／分数係数' },
                            { id: '22-03-02-03', name: 'A=B=C の連立方程式／小数係数，かっこを含む' },
                            { id: '22-03-02-04', name: 'A=B=C の連立方程式／比例式(A:B:C=a:b:c)' },
                            { id: '22-03-02-05', name: 'A=B=C の連立方程式／まとめ' }
                        ]
                    },
                    {
                        id: '22-03-03', name: 'いろいろな連立方程式を解く', details: [
                            { id: '22-03-03-01', name: 'いろいろな連立方程式／分母に文字を含む連立方程式' },
                            { id: '22-03-03-02', name: '〈教発〉いろいろな連立方程式／3元1次連立方程式' },
                            { id: '22-03-03-03', name: 'いろいろな連立方程式／連立方程式を解き，解を比で表す' }
                        ]
                    },
                    {
                        id: '22-03-04', name: 'まとめ／連立方程式を解く', details: [
                            { id: '22-03-04-01', name: '連立方程式を解く／まとめ' }
                        ]
                    }
                ]
            },
            {
                id: '22-04', name: '連立方程式の解の利用', children: [
                    {
                        id: '22-04-01', name: '連立方程式の解より', details: [
                            { id: '22-04-01-01', name: '連立方程式の与えられた解から文字の値を求める' },
                            { id: '22-04-01-02', name: '連立方程式の解を求め，文字の値を求める' },
                            { id: '22-04-01-03', name: '連立方程式の解の関係より解を求める' }
                        ]
                    },
                    {
                        id: '22-04-02', name: '同じ解をもつ連立方程式', details: [
                            { id: '22-04-02-01', name: '同じ解をもつ3つの方程式から文字の値，解を求める' },
                            { id: '22-04-02-02', name: '同じ解をもつ2組の連立方程式から文字の値を求める' }
                        ]
                    },
                    {
                        id: '22-04-03', name: '連立方程式の解の利用', details: [
                            { id: '22-04-03-01', name: '連立方程式の間違った解から文字の値，正しい解を求める' },
                            { id: '22-04-03-02', name: '連立方程式の解の入れかえから文字の値を求める' },
                            { id: '22-04-03-03', name: '2元1次方程式を満たす自然数の解を求める' },
                            { id: '22-04-03-04', name: '3元1次方程式の解の比を求める' }
                        ]
                    }
                ]
            },
            {
                id: '22-05', name: '連立方程式の利用', children: [
                    {
                        id: '22-05-01', name: '代金と個数に関する連立方程式の問題', details: [
                            { id: '22-05-01-01', name: '連立方程式の利用／代金と個数の組み合わせから単価を求める' },
                            { id: '22-05-01-02', name: '連立方程式の利用／個数により同額となる2種類のものの単価' },
                            { id: '22-05-01-03', name: '連立方程式の利用／個数の関係と代金から個数を求める' },
                            { id: '22-05-01-04', name: '連立方程式の利用／個数の和，代金，おつりなどから個数を求める' }
                        ]
                    },
                    {
                        id: '22-05-02', name: '数量と合計に関する連立方程式の問題', details: [
                            { id: '22-05-02-01', name: '連立方程式の利用／組数と全体の合計から個数を求める' },
                            { id: '22-05-02-02', name: '連立方程式の利用／2種類の全体の合計から個数を求める' },
                            { id: '22-05-02-03', name: '連立方程式の利用／2つのものの和と差からそれぞれの数量' }
                        ]
                    },
                    {
                        id: '22-05-03', name: '過不足に関する連立方程式の問題', details: [
                            { id: '22-05-03-01', name: '連立方程式の利用／AをBに分配するときのA，Bを求める' }
                        ]
                    },
                    {
                        id: '22-05-04', name: '数量移動や変動に関する連立方程式の問題', details: [
                            { id: '22-05-04-01', name: '連立方程式の利用／移動前・後・移動する数量からはじめの所持金' },
                            { id: '22-05-04-02', name: '連立方程式の利用／移動後・移動量からはじめの所持金／割合あり' },
                            { id: '22-05-04-03', name: '連立方程式の利用／水そうに入る単位時間あたりの水量を求める' },
                            { id: '22-05-04-04', name: '連立方程式の利用／水そうが満水(空)になる時間を求める(容積有)' },
                            { id: '22-05-04-05', name: '連立方程式の利用／水そうが満水(空)になる時間を求める(容積無)' },
                            { id: '22-05-04-06', name: '連立方程式の利用／同時に水を入れ・くみ出す時の単位あたりの量' }
                        ]
                    },
                    {
                        id: '22-05-05', name: '年齢・平均に関する連立方程式の問題', details: [
                            { id: '22-05-05-01', name: '連立方程式の利用／現在・過去(未来)の違いから現在の年齢' },
                            { id: '22-05-05-02', name: '連立方程式の利用／個々の平均と全体の平均から個数を求める' },
                            { id: '22-05-05-03', name: '連立方程式の利用／個々・全体の平均と一部の割合から個数' }
                        ]
                    },
                    {
                        id: '22-05-06', name: '数に関する連立方程式の問題', details: [
                            { id: '22-05-06-01', name: '連立方程式の利用／和と差から2つの整数を求める' },
                            { id: '22-05-06-02', name: '連立方程式の利用／2通りの数の比較から2つの整数を求める' },
                            { id: '22-05-06-03', name: '連立方程式の利用／各位の比較と各位の入れかえから2桁の整数①' },
                            { id: '22-05-06-04', name: '連立方程式の利用／各位の比較と各位の入れかえから2桁の整数②' },
                            { id: '22-05-06-05', name: '連立方程式の利用／各位を入れかえた数の比較から2けたの整数' },
                            { id: '22-05-06-06', name: '連立方程式の利用／各位の数の和と各位の比較から2けたの整数' },
                            { id: '22-05-06-07', name: '連立方程式の利用／1つの位の数がわかっているときの3桁の整数' },
                            { id: '22-05-06-08', name: '連立方程式の利用／3桁整数の入れかえ／3元1次方程式の解の組' }
                        ]
                    },
                    {
                        id: '22-05-07', name: '速さに関する連立方程式の問題', details: [
                            { id: '22-05-07-01', name: '連立方程式の利用／所要時間の和から道のり(速さの変化あり)' },
                            { id: '22-05-07-02', name: '連立方程式の利用／所要時間の和から道のり(2通りの速さの変化)' },
                            { id: '22-05-07-03', name: '連立方程式の利用／2通りの所要時間から速さ(速さの変化あり)' },
                            { id: '22-05-07-04', name: '連立方程式の利用／所要時間と速さの差から速さ(速さの変化あり)' },
                            { id: '22-05-07-05', name: '連立方程式の利用／速さと所要時間の和から時間(速さの変化あり)' },
                            { id: '22-05-07-06', name: '連立方程式の利用／周上で出会う時間から速さ(2つが動く)' },
                            { id: '22-05-07-07', name: '連立方程式の利用／周上で出会う，追いつく速さ(2つが動く)' },
                            { id: '22-05-07-08', name: '連立方程式の利用／2点から出会うまでの道のり(2つが動く)' },
                            { id: '22-05-07-09', name: '連立方程式の利用／橋を渡りきるまでの時間から速さ・列車の長さ' },
                            { id: '22-05-07-10', name: '連立方程式の利用／列車がすれちがう時間から速さ・列車の長さ' },
                            { id: '22-05-07-11', name: '連立方程式の利用／違う長さを渡りきる時間から速さ・列車の長さ' }
                        ]
                    },
                    {
                        id: '22-05-08', name: '割合に関する連立方程式の問題', details: [
                            { id: '22-05-08-01', name: '連立方程式の利用／全体に対する一部の割合から求める' },
                            { id: '22-05-08-02', name: '連立方程式の利用／単位量あたりの数量(2種類)から求める' },
                            { id: '22-05-08-03', name: '連立方程式の利用／個々の増減の割合と増減後の和(差)から求める' },
                            { id: '22-05-08-04', name: '連立方程式の利用／個々の増減・全体の増減後の割合から求める' },
                            { id: '22-05-08-05', name: '連立方程式の利用／個々・全体に対する一部の増減割合から求める' }
                        ]
                    },
                    {
                        id: '22-05-09', name: '売買の割合に関する連立方程式の問題', details: [
                            { id: '22-05-09-01', name: '連立方程式の利用／定価と割引率から定価を求める' },
                            { id: '22-05-09-02', name: '連立方程式の利用／原(定)価と割引(増)後の売価の差から原(定)価' },
                            { id: '22-05-09-03', name: '連立方程式の利用／定価の合計と割引後の合計の差から個数' },
                            { id: '22-05-09-04', name: '連立方程式の利用／値引後の売上げの合計と一部の割合から個数' },
                            { id: '22-05-09-05', name: '連立方程式の利用／利益率(定価)・売れ残り・利益から原価と個数' },
                            { id: '22-05-09-06', name: '連立方程式の利用／原価の和と売上げ(売れ残りを割引)から求める' }
                        ]
                    },
                    {
                        id: '22-05-10', name: '濃度に関する連立方程式の問題', details: [
                            { id: '22-05-10-01', name: '連立方程式の利用／濃度と食塩水の量から加える食塩の量を求める' },
                            { id: '22-05-10-02', name: '連立方程式の利用／まぜる食塩水の濃度を求める(2種類の食塩水)' },
                            { id: '22-05-10-03', name: '連立方程式の利用／まぜる食塩水の濃度・量など(2種類の食塩水)' },
                            { id: '22-05-10-04', name: '連立方程式の利用／まぜる割合(比)を間違えた時(2種類の食塩水)' },
                            { id: '22-05-10-05', name: '連立方程式の利用／2回以上まぜあわせる(2種類の食塩水)' },
                            { id: '22-05-10-06', name: '連立方程式の利用／まぜる合金の量を求める(2種類の合金)' }
                        ]
                    },
                    {
                        id: '22-05-11', name: '図形に関する連立方程式の問題', details: [
                            { id: '22-05-11-01', name: '連立方程式の利用／図形のまわりの長さから辺の長さを求める' }
                        ]
                    },
                    {
                        id: '22-05-12', name: '規則性に関する連立方程式の問題', details: [
                            { id: '22-05-12-01', name: '並びたものの個数や長さについて求める' }
                        ]
                    },
                    {
                        id: '22-05-13', name: 'さまざまな事象の連立方程式の問題', details: [
                            { id: '22-05-13-01', name: 'ゲームの勝敗と得点から回数を求める' },
                            { id: '22-05-13-02', name: '試合数と勝率などから勝ち数を求める' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '23', name: '1次関数', children: [
            {
                id: '23-01', name: '1次関数', children: [
                    {
                        id: '23-01-01', name: '1次関数の式', details: [
                            { id: '23-01-01-01', name: '1次関数の式についてxに比例する項，定数項を求める' },
                            { id: '23-01-01-02', name: '式からyがxの1次関数であるものを選ぶ' },
                            { id: '23-01-01-03', name: '具体的な事象からyをxの式で表す／変域なし' },
                            { id: '23-01-01-04', name: '具体的な事象からyをxの式で表す／変域あり' },
                            { id: '23-01-01-05', name: '具体的な事象からyをxの式で表し1次関数を選ぶ' },
                            { id: '23-01-01-06', name: '具体的な事象からyをxの式で表し対応する値を求める' }
                        ]
                    }
                ]
            },
            {
                id: '23-02', name: '1次関数の値の変化', children: [
                    {
                        id: '23-02-01', name: '1次関数の値の変化', details: [
                            { id: '23-02-01-01', name: '1次関数の式からx，yに対応する値を求める' },
                            { id: '23-02-01-02', name: '1次関数の式からxの増加量，yの増加量を求める' }
                        ]
                    },
                    {
                        id: '23-02-02', name: '1次関数の変化の割合', details: [
                            { id: '23-02-02-01', name: '1次関数のxの増加量，yの増加量から変化の割合を求める' },
                            { id: '23-02-02-02', name: '1次関数の式から変化の割合を求める' }
                        ]
                    },
                    {
                        id: '23-02-03', name: '1次関数の値の変化と変化の割合', details: [
                            { id: '23-02-03-01', name: '1次関数のxの増加量からyの増加量を求める' },
                            { id: '23-02-03-02', name: '1次関数の増加量や変化の割合などを求める' },
                            { id: '23-02-03-03', name: '反比例の変化の割合を求める' }
                        ]
                    }
                ]
            },
            {
                id: '23-03', name: '1次関数のグラフ', children: [
                    {
                        id: '23-03-01', name: '1次関数のグラフ上の点', details: [
                            { id: '23-03-01-01', name: '1次関数の式からグラフ上にある点を選ぶ' },
                            { id: '23-03-01-02', name: '1次関数の式からグラフ上の点を求める' },
                            { id: '23-03-01-03', name: '1次関数のグラフとx軸，y軸との交点を求める' }
                        ]
                    },
                    {
                        id: '23-03-02', name: '1次関数のグラフと比例のグラフとの関係', details: [
                            { id: '23-03-02-01', name: '1次関数のグラフと比例のグラフの位置関係を答える' },
                            { id: '23-03-02-02', name: '比例のグラフを利用して1次関数のグラフをかく' }
                        ]
                    },
                    {
                        id: '23-03-03', name: '1次関数のグラフの切片と傾き', details: [
                            { id: '23-03-03-01', name: '1次関数の式から，グラフの切片を求める' },
                            { id: '23-03-03-02', name: '1次関数の式から，グラフの傾きを求める' },
                            { id: '23-03-03-03', name: '1次関数の式から，グラフの傾きと切片を求める' },
                            { id: '23-03-03-04', name: '1次関数のグラフから，傾き，切片の符号を答える' },
                            { id: '23-03-03-05', name: '1次関数のグラフから，傾きを上下左右で答える' }
                        ]
                    },
                    {
                        id: '23-03-04', name: '1次関数の式とグラフ', details: [
                            { id: '23-03-04-01', name: 'いくつかの1次関数の式から条件にあてはまる式を求める' },
                            { id: '23-03-04-02', name: 'x軸，y軸，原点について対称な1次関数のグラフの式を求める' },
                            { id: '23-03-04-03', name: '1次関数のグラフをどのように平行移動したものかを答える' },
                            { id: '23-03-04-04', name: 'y軸方向に平行移動した1次関数のグラフの式を求める' }
                        ]
                    },
                    {
                        id: '23-03-05', name: '1次関数のグラフをかく', details: [
                            { id: '23-03-05-01', name: '1次関数のグラフをかく／x，yの対応表から' },
                            { id: '23-03-05-02', name: '1次関数のグラフをかく／切片と傾きから' },
                            { id: '23-03-05-03', name: '1次関数のグラフをかく／適当な2点を見つけて' },
                            { id: '23-03-05-04', name: '1次関数のグラフをかく／まとめ' },
                            { id: '23-03-05-05', name: 'まとめ／1次関数について(傾き・切片，グラフなど)' }
                        ]
                    },
                    {
                        id: '23-03-06', name: '1次関数のグラフと変域', details: [
                            { id: '23-03-06-01', name: 'xの変域がある1次関数のグラフをかく' },
                            { id: '23-03-06-02', name: '1次関数のxの変域からyの変域を求める' },
                            { id: '23-03-06-03', name: '1次関数のyの変域からxの変域を求める' },
                            { id: '23-03-06-04', name: '1次関数の変域について／xの変域⇄yの変域' },
                            { id: '23-03-06-05', name: '1次関数のx，yの変域(最大値，最小値)から文字の値を求める' }
                        ]
                    },
                    {
                        id: '23-03-07', name: '1次関数の式とグラフと変域', details: [
                            { id: '23-03-07-01', name: 'まとめ／1次関数について(式，グラフ，変域など)' }
                        ]
                    }
                ]
            },
            {
                id: '23-04', name: '1次関数の式', children: [
                    {
                        id: '23-04-01', name: '1次関数の式を求める／傾きと切片から', details: [
                            { id: '23-04-01-01', name: '1次関数の式を求める／傾き(変化の割合)と切片から' }
                        ]
                    },
                    {
                        id: '23-04-02', name: '1次関数の式を求める／グラフから', details: [
                            { id: '23-04-02-01', name: '1次関数の式を求める／方眼のグラフから' },
                            { id: '23-04-02-02', name: '1次関数の式を求める／方眼なしのグラフから' }
                        ]
                    },
                    {
                        id: '23-04-03', name: '1次関数の式を求める／1点の座標から', details: [
                            { id: '23-04-03-01', name: '1次関数の式を求める／1点の座標と傾き(増加量)から' },
                            { id: '23-04-03-02', name: '1次関数の式を求める／1点の座標と切片から' }
                        ]
                    },
                    {
                        id: '23-04-04', name: '1次関数の式を求める／2点の座標から', details: [
                            { id: '23-04-04-01', name: '1次関数の式を求める／2点の座標から' },
                            { id: '23-04-04-02', name: '1次関数の式を求める／2点の座標から(中点あり)' },
                            { id: '23-04-04-03', name: '1次関数の式を求める／x，yの変域から' },
                            { id: '23-04-04-04', name: '1次関数の式を求める／1点の座標とx軸と交わる点から' }
                        ]
                    },
                    {
                        id: '23-04-05', name: '1次関数の式を求める／平行・垂直', details: [
                            { id: '23-04-05-01', name: '1次関数の式を求める／1点の座標と平行な直線から' },
                            { id: '23-04-05-02', name: '1次関数の式を求める／1点の座標と垂直な直線から' }
                        ]
                    },
                    {
                        id: '23-04-06', name: '1次関数の式を求める／平行移動', details: [
                            { id: '23-04-06-01', name: '1次関数の式を求める／グラフをx軸・y軸方向に平行移動する' }
                        ]
                    },
                    {
                        id: '23-04-07', name: '1次関数の式を求める／同一直線上の3点', details: [
                            { id: '23-04-07-01', name: '1次関数の式を求める／同一直線上の3点' }
                        ]
                    },
                    {
                        id: '23-04-08', name: '1次関数の式を求める／傾き・切片・座標から', details: [
                            { id: '23-04-08-01', name: '1次関数の式を求める／まとめ' }
                        ]
                    }
                ]
            },
            {
                id: '23-05', name: '2元1次方程式とグラフ', children: [
                    {
                        id: '23-05-01', name: 'ax + by + c = 0 の形の式', details: [
                            { id: '23-05-01-01', name: 'ax + by + c = 0 の形式／x，yに対応する値を求める' },
                            { id: '23-05-01-02', name: 'ax + by + c = 0 の形式／y = ax + b の形に変形する' },
                            { id: '23-05-01-03', name: 'ax + by + c = 0 の形式／傾きと切片を求める' },
                            { id: '23-05-01-04', name: 'ax + by + c = 0 の形式／x軸，y軸との交点を求める' }
                        ]
                    },
                    {
                        id: '23-05-02', name: '2元1次方程式のグラフ上の点', details: [
                            { id: '23-05-02-01', name: '2元1次方程式からグラフ上にある点を選ぶ' }
                        ]
                    },
                    {
                        id: '23-05-03', name: '2元1次方程式のグラフをかく', details: [
                            { id: '23-05-03-01', name: 'ax + by + c = 0 のグラフをかく／y = ax + b の形に変形' },
                            { id: '23-05-03-02', name: 'y = a，x軸に平行なグラフをかく' },
                            { id: '23-05-03-03', name: 'x = b，y軸に平行なグラフをかく' },
                            { id: '23-05-03-04', name: 'ax + by + c = 0 のグラフをかく／適当な2点を見つけて' },
                            { id: '23-05-03-05', name: '2元1次方程式のグラフをかく／まとめ' }
                        ]
                    },
                    {
                        id: '23-05-04', name: '直線の式と2元1次方程式', details: [
                            { id: '23-05-04-01', name: 'グラフの式を ax + by + c = 0 の形で求める' },
                            { id: '23-05-04-02', name: 'ax + by = c の形の直線の式／1点の座標と平行な直線' },
                            { id: '23-05-04-03', name: 'ax + by = c の形の直線の式／1点と軸に平行な直線' },
                            { id: '23-05-04-04', name: 'ax + by = c の形の直線の通る点や文字の値を求める' },
                            { id: '23-05-04-05', name: 'ax + by = c の形2直線の位置関係を求める' }
                        ]
                    }
                ]
            },
            {
                id: '23-06', name: '1次関数と方程式', children: [
                    {
                        id: '23-06-01', name: '連立方程式の解とグラフの交点', details: [
                            { id: '23-06-01-01', name: 'グラフをかき，連立方程式の解を求める' },
                            { id: '23-06-01-02', name: 'グラフをかき，連立方程式の解を求める／平行' },
                            { id: '23-06-01-03', name: 'グラフをかき，連立方程式の解を求める／重なる' },
                            { id: '23-06-01-04', name: 'グラフをかき，連立方程式の解を求める／まとめ' }
                        ]
                    },
                    {
                        id: '23-06-02', name: '2直線の交点', details: [
                            { id: '23-06-02-01', name: '2直線の交点の座標を求める／グラフあり' },
                            { id: '23-06-02-02', name: '2直線の交点の座標を求める／グラフなし' },
                            { id: '23-06-02-03', name: '2直線の交点の数を求める' },
                            { id: '23-06-02-04', name: '連立方程式の解(解なし・無数)から文字の値を求める' }
                        ]
                    },
                    {
                        id: '23-06-03', name: '2直線の交点と直線の式', details: [
                            { id: '23-06-03-01', name: '2直線の交点と別の1点を通る直線の式などを求める' },
                            { id: '23-06-03-02', name: '2直線の交点の座標から，直線の式(文字の値)を求める' },
                            { id: '23-06-03-03', name: '2直線の交点の座標から，直線・座標(文字の値)を求める' },
                            { id: '23-06-03-04', name: '2直線が軸上で交わるとき，直線の式(文字の値)を求める' },
                            { id: '23-06-03-05', name: '2直線の式を求め，その2直線の交点を求める' },
                            { id: '23-06-03-06', name: 'グラフより，直線の式や交点の座標などを求める' },
                            { id: '23-06-03-07', name: '与えられた範囲で直線が交わるとき，傾き・切片の値の範囲' },
                            { id: '23-06-03-08', name: '1次関数と双曲線との交点の座標から文字の値を求める' }
                        ]
                    },
                    {
                        id: '23-06-04', name: '3直線の交点', details: [
                            { id: '23-06-04-01', name: '3直線が1点で交わるとき，文字の値を求める' },
                            { id: '23-06-04-02', name: '3直線で三角形ができないようにするとき，文字の値を求める' }
                        ]
                    }
                ]
            },
            {
                id: '23-07', name: '1次関数のグラフと図形', children: [
                    {
                        id: '23-07-01', name: '1次関数のグラフと三角形・四角形の面積', details: [
                            { id: '23-07-01-01', name: '直線と軸に囲まれた三角形の面積を求める' },
                            { id: '23-07-01-02', name: '2直線と軸に平行な直線に囲まれた三角形の面積を求める' },
                            { id: '23-07-01-03', name: '3直線に囲まれた三角形の面積を求める' },
                            { id: '23-07-01-04', name: 'いくつかの直線に囲まれた台形の面積を求める' },
                            { id: '23-07-01-05', name: '2つの三角形の面積を加減して四角形の面積を求める' },
                            { id: '23-07-01-06', name: 'いくつかの直線に囲まれた三角形の面積比(底辺・高さの比)' },
                            { id: '23-07-01-07', name: '面積が与えられているときの直線の式を求める' },
                            { id: '23-07-01-08', name: '2つの三角形の面積の関係から直線の式を求める' }
                        ]
                    },
                    {
                        id: '23-07-02', name: '面積を分割する直線の式', details: [
                            { id: '23-07-02-01', name: '三角形の面積を2等分する直線の式／頂点を通る' },
                            { id: '23-07-02-02', name: '三角形の面積を2等分する直線の式／頂点を通る，中点公式' },
                            { id: '23-07-02-03', name: '三角形の面積を2等分する直線の式／頂点を通らない' },
                            { id: '23-07-02-04', name: '対辺が等しい四角形の面積を2等分する直線の式' },
                            { id: '23-07-02-05', name: '三角形・四角形を等積変形する直線の式(平行な直線)' },
                            { id: '23-07-02-06', name: '三角形の面積を分割する直線の式' },
                            { id: '23-07-02-07', name: '四角形の面積を分割する直線の式' }
                        ]
                    },
                    {
                        id: '23-07-03', name: '直線のグラフと格子点', details: [
                            { id: '23-07-03-01', name: '格子点の数を求める(直線上，直線に囲まれた部分)' },
                            { id: '23-07-03-02', name: '格子点の数と直線の傾きの範囲を求める' }
                        ]
                    },
                    {
                        id: '23-07-04', name: '直線のグラフと線分の長さ', details: [
                            { id: '23-07-04-01', name: '直線の式と線分の長さを求める' },
                            { id: '23-07-04-02', name: '線分の長さを利用して，直線の式や座標を求める' },
                            { id: '23-07-04-03', name: '2直線とx軸に平行な直線からなる四角形' },
                            { id: '23-07-04-04', name: '直線上の点と軸上の点からなる四角形の座標等' },
                            { id: '23-07-04-05', name: 'y軸に平行な直線と2直線の交点から座標など' }
                        ]
                    }
                ]
            },
            {
                id: '23-08', name: '1次関数の利用', children: [
                    {
                        id: '23-08-01', name: '具体的な事象と1次関数', details: [
                            { id: '23-08-01-01', name: '具体的な事象(変化の割合・定数)から1次関数の式・対応する値' },
                            { id: '23-08-01-02', name: '具体的な事象(2組の値)から1次関数の式・値等を求める' },
                            { id: '23-08-01-03', name: '具体的な事象(表示形式)から1次関数の式・対応する値などを求める' },
                            { id: '23-08-01-04', name: '誤差のある測定値から1次関数の式・対応する値などを求める' }
                        ]
                    },
                    {
                        id: '23-08-02', name: '1次関数の利用／おもりの重さ', details: [
                            { id: '23-08-02-01', name: '1次関数の利用／おもりの重さとばねの長さの関係から式・値など' }
                        ]
                    },
                    {
                        id: '23-08-03', name: '1次関数の利用／料金', details: [
                            { id: '23-08-03-01', name: '1次関数の利用／料金プランから読みとる(一定料金あり)' },
                            { id: '23-08-03-02', name: '1次関数の利用／料金プランの比較(一定料金なし)' },
                            { id: '23-08-03-03', name: '1次関数の利用／料金プランの比較(一定料金あり)' },
                            { id: '23-08-03-04', name: '1次関数の利用／具体的事象の料金プランの比較' }
                        ]
                    },
                    {
                        id: '23-08-04', name: '1次関数の利用／時間と水量の変化', details: [
                            { id: '23-08-04-01', name: '1次関数の利用／一定量で給水・排水する' },
                            { id: '23-08-04-02', name: '1次関数の利用／一定量で給水・排水する(単位変換あり)' },
                            { id: '23-08-04-03', name: '1次関数の利用／同時に給水と排水を行う' },
                            { id: '23-08-04-04', name: '1次関数の利用／給水の途中で給水する量が変化する' },
                            { id: '23-08-04-05', name: '1次関数の利用／水そうの形状により，容器の底面積が変化する' }
                        ]
                    },
                    {
                        id: '23-08-05', name: '1次関数の利用／時間・距離・速さ', details: [
                            { id: '23-08-05-01', name: '1次関数の利用／速さが一定のものが動く' },
                            { id: '23-08-05-02', name: '1次関数の利用／速さが変化するものが動く' },
                            { id: '23-08-05-03', name: '1次関数の利用／速さが変化するものが動く(グラフをよむ)' },
                            { id: '23-08-05-04', name: '1次関数の利用／速さが変化する(グラフをよむ・かく)' },
                            { id: '23-08-05-05', name: '1次関数の利用／速さが一定の2つのものが動く' },
                            { id: '23-08-05-06', name: '1次関数の利用／速さが一定の2つのものが動く(グラフをよむ)' },
                            { id: '23-08-05-07', name: '1次関数の利用／一方の速さが変化する2つのもの(グラフをよむ)' },
                            { id: '23-08-05-08', name: '1次関数の利用／3つのものが動く(グラフをよむ)' },
                            { id: '23-08-05-09', name: '1次関数の利用／ダイヤグラムの利用' },
                            { id: '23-08-05-10', name: '1次関数の利用／線分上を2点が往復して動く' },
                            { id: '23-08-05-11', name: '1次関数の利用／長針と短針の作る角度から時刻を求める' },
                            { id: '23-08-05-12', name: '1次関数の利用／長針と短針の作る角度から時刻を求める(グラフ)' }
                        ]
                    },
                    {
                        id: '23-08-06', name: '1次関数の利用／動点と図形の面積', details: [
                            { id: '23-08-06-01', name: '1次関数の利用／四角形の辺上を1点が動くときの三角形の面積' },
                            { id: '23-08-06-02', name: '1次関数の利用／四角形の辺上を1点が動くときの面積など' },
                            { id: '23-08-06-03', name: '1次関数の利用／三角形の辺上を1点が動くときの三角形の面積' },
                            { id: '23-08-06-04', name: '1次関数の利用／三角形の辺上を1点が動くときの面積など' },
                            { id: '23-08-06-05', name: '1次関数の利用／四角形の3辺上を1点が動く(速さが変化)' },
                            { id: '23-08-06-06', name: '1次関数の利用／いろいろな図形の辺上を1点が動くときの面積等' },
                            { id: '23-08-06-07', name: '1次関数の利用／四角形の辺上を2点が動くときの面積など' }
                        ]
                    },
                    {
                        id: '23-08-07', name: '1次関数の利用／座標上の点の移動と直線', details: [
                            { id: '23-08-07-01', name: '1次関数の利用／座標上の直線上の動点を頂点とする正方形' },
                            { id: '23-08-07-02', name: '1次関数の利用／座標軸上の動点を通る直線の式と面積' },
                            { id: '23-08-07-03', name: '1次関数の利用／座標上の図形の辺上を1点が動くとき面積の変化' },
                            { id: '23-08-07-04', name: '1次関数の利用／座標上の図形の辺上を2点が動くとき面積の変化' }
                        ]
                    },
                    {
                        id: '23-08-08', name: '1次関数の利用／動点と立体の体積', details: [
                            { id: '23-08-08-01', name: '1次関数の利用／角柱の辺上を1点が動くとき' },
                            { id: '23-08-08-02', name: '1次関数の利用／角柱の辺上を2点が動くとき' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '24', name: '平行と合同', children: [
            {
                id: '24-01', name: '平行線と角', children: [
                    {
                        id: '24-01-01', name: '対頂角・同位角・錯角', details: [
                            { id: '24-01-01-01', name: '対頂角／角の大きさを求める' },
                            { id: '24-01-01-02', name: '対頂角／角の大きさを求める(方程式)' },
                            { id: '24-01-01-03', name: '対頂角／角の和を求める' },
                            { id: '24-01-01-04', name: '同位角・錯角／位置関係を答える' },
                            { id: '24-01-01-05', name: '同位角・錯角／位置関係とその大きさを求める' }
                        ]
                    },
                    {
                        id: '24-01-02', name: '平行になるための条件について', details: [
                            { id: '24-01-02-01', name: '平行な直線の組をみつけ，角の大きさ等を求める' },
                            { id: '24-01-02-02', name: '平行条件を説明する／ℓ//m，m//n → ℓ//n' },
                            { id: '24-01-02-03', name: '平行条件を説明する／ℓ//m ⇄ 同位角・錯角が等しい' },
                            { id: '24-01-02-04', name: '平行条件を説明する／ℓ//m ⇄ 同側内角の和は180°' }
                        ]
                    },
                    {
                        id: '24-01-03', name: '平行線の性質の利用', details: [
                            { id: '24-01-03-01', name: '角の大きさを求める' },
                            { id: '24-01-03-02', name: '角の大きさを求める／関係式等' },
                            { id: '24-01-03-03', name: '補助線をひき，角の大きさを求める' },
                            { id: '24-01-03-04', name: '補助線をひき，角の大きさを求める／比を使う' }
                        ]
                    }
                ]
            },
            {
                id: '24-02', name: '三角形の角', children: [
                    {
                        id: '24-02-01', name: '三角形の内角・外角', details: [
                            { id: '24-02-01-01', name: '三角形の内角・外角の性質について説明する' },
                            { id: '24-02-01-02', name: '三角形の角の大きさを求める' },
                            { id: '24-02-01-03', name: '三角形の角の大きさを求める／方程式' }
                        ]
                    },
                    {
                        id: '24-02-02', name: '三角形の内角・外角の利用', details: [
                            { id: '24-02-02-01', name: '角の大きさを求める／分割した三角形' },
                            { id: '24-02-02-02', name: '角の大きさを求める／連続する三角形' },
                            { id: '24-02-02-03', name: '角の大きさを求める／1つの角を共有する三角形' },
                            { id: '24-02-02-04', name: '角の大きさを求める／底辺を共有する三角形' },
                            { id: '24-02-02-05', name: '角の大きさを求める／へこみのある三角形(補助線)' },
                            { id: '24-02-02-06', name: '角の大きさを求める／平行線に交わってできる三角形' },
                            { id: '24-02-02-07', name: '角の和を求める／平行線に交わる直線でできる角(補助線をひく)' },
                            { id: '24-02-02-08', name: '角の大きさを求める／長方形の折り返し①(頂点が辺上)' },
                            { id: '24-02-02-09', name: '角の大きさを求める／長方形の折り返し②' },
                            { id: '24-02-02-10', name: '角の大きさを求める／長方形の対角線で折る' },
                            { id: '24-02-02-11', name: '角の大きさを求める／回転した三角形' }
                        ]
                    },
                    {
                        id: '24-02-03', name: '三角形の内角・外角の利用／角の二等分線', details: [
                            { id: '24-02-03-01', name: '内角の二等分線から成る三角形の角の大きさ／分割した三角形' },
                            { id: '24-02-03-02', name: '内角の二等分線から成る三角形の角の大きさ／底辺を共有' },
                            { id: '24-02-03-04', name: '内角・外角の二等分線から成る三角形の角の大きさ' },
                            { id: '24-02-03-05', name: '角の二等分線と等しい角から成る三角形の角の大きさ' },
                            { id: '24-02-03-06', name: '同側内角の二等分線から成る三角形の角の大きさ' }
                        ]
                    },
                    {
                        id: '24-02-04', name: '鋭角・直角・鈍角の三角形', details: [
                            { id: '24-02-04-01', name: '鋭角・鈍角に分類する' },
                            { id: '24-02-04-02', name: '内角の大きさから鋭角・直角・鈍角三角形に分類する' }
                        ]
                    }
                ]
            },
            {
                id: '24-03', name: '多角形の内角・外角', children: [
                    {
                        id: '24-03-01', name: '多角形の内角・外角', details: [
                            { id: '24-03-01-01', name: '多角形の頂点・辺・対角線・内部にできる三角形の数などを求める' },
                            { id: '24-03-01-02', name: '多角形の内角の和を求める' },
                            { id: '24-03-01-03', name: '正多角形の1つの内角の大きさを求める' },
                            { id: '24-03-01-04', name: '多角形の内角の和より何角形になるかを求める' },
                            { id: '24-03-01-05', name: '正多角形の1つの外角の大きさより何角形になるかを求める' },
                            { id: '24-03-01-06', name: '正多角形の1つの外角の大きさを求める' },
                            { id: '24-03-01-07', name: '多角形の内角について／まとめ' },
                            { id: '24-03-01-08', name: '正多角形の外角について／まとめ' },
                            { id: '24-03-01-09', name: '多角形の内角・外角の差や比より何角形になるかなどを求める' },
                            { id: '24-03-01-10', name: '多角形の対角線の総数を求める' },
                            { id: '24-03-01-11', name: 'まとめ／多角形の角について' },
                            { id: '24-03-01-12', name: '多角形の性質について(多角形の内角・外角，対角線など)' },
                            { id: '24-03-01-13', name: '多角形の外角の和について，多角形の内角の和を使って説明する' }
                        ]
                    },
                    {
                        id: '24-03-02', name: '多角形の内角・外角を利用', details: [
                            { id: '24-03-02-01', name: '多角形の内角の大きさを求める' },
                            { id: '24-03-02-02', name: '多角形の内角・外角の大きさを求める' },
                            { id: '24-03-02-03', name: '正多角形の内角・外角の和より，角の大きさを求める' }
                        ]
                    },
                    {
                        id: '24-03-03', name: '多角形の内角・外角を利用／複雑な図形', details: [
                            { id: '24-03-03-01', name: 'へこみのある多角形の角の大きさ／2つの三角形に分ける' },
                            { id: '24-03-03-02', name: 'へこみのある多角形の角の大きさ／補助線ひいて多角形と三角形' },
                            { id: '24-03-03-03', name: '多角形の内角・外角の和より，角の大きさを求める／等しい角' },
                            { id: '24-03-03-04', name: '複雑な図形の角の大きさを求める／三角形と多角形の内角・外角' },
                            { id: '24-03-03-05', name: '複雑な図形の角の大きさを求める／補助線ひいて多角形と三角形' },
                            { id: '24-03-03-06', name: '複雑な図形の角の和を求める／星型，三角形の内角・外角' },
                            { id: '24-03-03-07', name: '複雑な図形の角 home_和を求める／補助線ひいて多角形と三角形' },
                            { id: '24-03-03-08', name: '複雑な図形の角の和を求める／三角形と多角形・対頂角の利用' },
                            { id: '24-03-03-09', name: '複雑な図形の角の和を求める／穴のあいた三角形の和' }
                        ]
                    }
                ]
            },
            {
                id: '24-04', name: '三角形の合同条件', children: [
                    {
                        id: '24-04-01', name: '合同な図形の性質', details: [
                            { id: '24-04-01-01', name: '合同な図形を「≡」を使って表す' },
                            { id: '24-04-01-02', name: '合同な図形の対応する辺や角を求める' },
                            { id: '24-04-01-03', name: '合同な図形の辺や角の大きさなどを求める／平行・対称移動' },
                            { id: '24-04-01-04', name: '合同な図形の辺や角の大きさなどを求める／回転移動' },
                            { id: '24-04-01-05', name: '合同な図形を作図する' }
                        ]
                    },
                    {
                        id: '24-04-02', name: '三角形の合同条件', details: [
                            { id: '24-04-02-01', name: '与えられた条件のうち，三角形が合同になるものを選ぶ' },
                            { id: '24-04-02-02', name: '合同になるための条件を加え，合同条件を答える' },
                            { id: '24-04-02-03', name: '合同な三角形の組をみつけ，そのとき使った合同条件を答える' },
                            { id: '24-04-02-04', name: '合同な三角形を「≡」を使って表し，合同条件を答える' }
                        ]
                    }
                ]
            },
            {
                id: '24-05', name: '図形と証明', children: [
                    {
                        id: '24-05-01', name: '証明のすすめ方', details: [
                            { id: '24-05-01-01', name: '仮定と結論をいう' },
                            { id: '24-05-01-02', name: '証明の流れと根拠' }
                        ]
                    },
                    {
                        id: '24-05-02', name: '証明／角の性質・平行線の性質を利用', details: [
                            { id: '24-05-02-01', name: '共通の角を加減して，角が等しいことを証明' },
                            { id: '24-05-02-02', name: '三角形の外角と平行線の性質より角についての証明' },
                            { id: '24-05-02-03', name: '二等辺三角形の頂点の外角の二等分線と底角の関係を証明' },
                            { id: '24-05-02-04', name: '平行線の性質より角についての証明' },
                            { id: '24-05-02-05', name: '∠A + ∠B = 180°の∠A，∠Bの二等分線に関して証明' },
                            { id: '24-05-02-06', name: '平行線の同位角・錯角の二等分線どうしが平行になる証明' }
                        ]
                    },
                    {
                        id: '24-05-03', name: '証明／作図について', details: [
                            { id: '24-05-03-01', name: '二等分線・垂直線等の作図方法とその証明' }
                        ]
                    },
                    {
                        id: '24-05-04', name: '証明／三角形の合同を利用', details: [
                            { id: '24-05-04-01', name: '1辺を共有する三角形の合同を証明／3辺が等しい' },
                            { id: '24-05-04-02', name: '1辺を共有する三角形の合同を証明／2辺とその間の角が等しい' },
                            { id: '24-05-04-03', name: '1辺を共有する三角形の合同を証明／1辺とその両端の角が等しい' },
                            { id: '24-05-04-04', name: '点対称な三角形の合同を証明／2辺とその間の角が等しい' },
                            { id: '24-05-04-05', name: '点対称な三角形の合同を証明／1辺とその両端の角が等しい' },
                            { id: '24-05-04-06', name: 'となり合う2組の辺が等しい四角形の対角線について合同より証明' },
                            { id: '24-05-04-07', name: '1つの角を共有する三角形の合同を証明／2辺とその間の角' },
                            { id: '24-05-04-08', name: '1つの角を共有する三角形の合同を証明／1辺とその両端の角' },
                            { id: '24-05-04-09', name: '回転移動した三角形の共有する角を加減して合同を証明' },
                            { id: '24-05-04-10', name: '正三角形・正方形の辺上に等しい長さをとるとき合同を証明' },
                            { id: '24-05-04-11', name: '1辺を共有する2つの三角形・正方形について合同を証明' },
                            { id: '24-05-04-12', name: '正方形の対角線上の1点と2つの頂点を結ぶとき合同を証明' },
                            { id: '24-05-04-13', name: '長方形を1組の頂点が重なるように折り返したとき合同を証明' },
                            { id: '24-05-04-14', name: '長方形を対角線を折り目として折り返したとき合同を証明' },
                            { id: '24-05-04-15', name: '平行線を利用して合同を証明' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '25', name: '三角形と四角形', children: [
            {
                id: '25-01', name: '二等辺三角形', children: [
                    {
                        id: '25-01-01', name: '二等辺三角形の性質', details: [
                            { id: '25-01-01-01', name: '二等辺三角形の角の大きさを求める' },
                            { id: '25-01-01-02', name: '二等辺三角形の角の大きさを求める／二等辺三角形の組' },
                            { id: '25-01-01-03', name: '二等辺三角形の角の大きさを求める／角の二等分線' },
                            { id: '25-01-01-04', name: '二等辺三角形の角の大きさを求める／二等辺三角形の連続' },
                            { id: '25-01-01-05', name: '二等辺三角形の角の大きさを求める／いろいろな組合せ' },
                            { id: '25-01-01-06', name: '二等辺三角形の角の大きさを求める／まとめ' },
                            { id: '25-01-01-07', name: '直角二等辺三角形の性質／辺と面積' },
                            { id: '25-01-01-08', name: '二等辺三角形になるものをえらぶ' }
                        ]
                    },
                    {
                        id: '25-01-02', name: '二等辺三角形の性質の証明', details: [
                            { id: '25-01-02-01', name: '二等辺三角形の性質の証明／底角が等しい' },
                            { id: '25-01-02-02', name: '二等辺三角形の性質の証明／頂角の二等分線は底辺を垂直に2等分' },
                            { id: '25-01-02-03', name: '二等辺三角形の性質の証明／底辺の中点と頂点を結ぶ線分について' }
                        ]
                    },
                    {
                        id: '25-01-03', name: '二等辺三角形の性質を利用／証明', details: [
                            { id: '25-01-03-01', name: '二等辺三角形の性質より証明／底辺が共通な三角形の合同' },
                            { id: '25-01-03-02', name: '二等辺三角形の性質より証明／底角の二等分線の三角形の合同' },
                            { id: '25-01-03-03', name: '二等辺三角形の性質より証明／頂角の二等分線の三角形の合同' },
                            { id: '25-01-03-04', name: '二等辺三角形の性質より証明／底角が等しい三角形の合同より' },
                            { id: '25-01-03-05', name: '二等辺三角形の性質より証明／底辺共通な2つの二等辺三角形' },
                            { id: '25-01-03-06', name: '二等辺三角形の性質より証明／底辺の中点から等しい角をとる' },
                            { id: '25-01-03-07', name: '二等辺三角形の性質より証明／三角形の合同と角の性質' },
                            { id: '25-01-03-08', name: '二等辺三角形の性質より証明／垂直二等分線の作図について' },
                            { id: '25-01-03-09', name: '二等辺三角形の性質より証明／平行線の性質と二等辺三角形' },
                            { id: '25-01-03-10', name: '二等辺三角形の性質より証明／1辺を共有する二等辺三角形の角' }
                        ]
                    },
                    {
                        id: '25-01-04', name: '二等辺三角形になるための条件／証明', details: [
                            { id: '25-01-04-01', name: '二等辺三角形になるための条件の証明' },
                            { id: '25-01-04-02', name: '二等辺三角形になる証明／三角形の合同より' },
                            { id: '25-01-04-03', name: '二等辺三角形になる証明／底辺が共通な三角形の合同より' },
                            { id: '25-01-04-04', name: '二等辺三角形になる証明／二等辺三角形の性質と合同より' },
                            { id: '25-01-04-05', name: '二等辺三角形になる証明／折り返しと平行線の性質より' },
                            { id: '25-01-04-06', name: '二等辺三角形になる証明／角の大きさを求めて' },
                            { id: '25-01-04-07', name: '二等辺三角形になる証明／底角の二等分線から成る三角形' },
                            { id: '25-01-04-08', name: '二等辺三角形になる証明／角の二等分線と平行線' },
                            { id: '25-01-04-09', name: '二等辺三角形になる証明／底角の二等分線と底辺に平行な直線より' },
                            { id: '25-01-04-10', name: '二等辺三角形になる証明／直角三角形の内角の性質より' }
                        ]
                    },
                    {
                        id: '25-01-05', name: '二等辺三角形になるための条件の利用', details: [
                            { id: '25-01-05-01', name: '二等辺三角形になることより，角の大きさや線分の長さなど' },
                            { id: '25-01-05-02', name: '二等辺三角形になることより，底角の二等分線からなる三角形の周' }
                        ]
                    }
                ]
            },
            {
                id: '25-02', name: '正三角形', children: [
                    {
                        id: '25-02-01', name: '正三角形の性質', details: [
                            { id: '25-02-01-01', name: '正三角形の角の大きさを求める' },
                            { id: '25-02-01-02', name: '正三角形の角の大きさを求める／正三角形と二等辺三角形' },
                            { id: '25-02-01-03', name: '正三角形の角の大きさを求める／正三角形と正三角形' },
                            { id: '25-02-01-04', name: '正三角形の角の大きさを求める／正三角形と平行線' },
                            { id: '25-02-01-05', name: '正三角形の角の大きさを求める／正三角形と正方形' },
                            { id: '25-02-01-06', name: '正三角形の角の大きさを求める／合同を利用する' },
                            { id: '25-02-01-07', name: '正三角形の性質の証明' }
                        ]
                    },
                    {
                        id: '25-02-02', name: '正三角形の性質を利用／証明', details: [
                            { id: '25-02-02-01', name: '正三角形の性質より証明／三角形の合同' },
                            { id: '25-02-02-02', name: '正三角形の性質より証明／三角形の合同と内角の性質' },
                            { id: '25-02-02-03', name: '正三角形の性質より証明／2つの正三角形と合同(60° + ∠x)' },
                            { id: '25-02-02-04', name: '正三角形の性質より証明／2つの正三角形と外角(60° + ∠x)' },
                            { id: '25-02-02-05', name: '正三角形の性質より証明／頂点共有する正三角形(60° - ∠x)' }
                        ]
                    },
                    {
                        id: '25-02-03', name: '正三角形になる／証明', details: [
                            { id: '25-02-03-01', name: '正三角形になる証明／3つの三角形の合同より，3辺が等しい' },
                            { id: '25-02-03-02', name: '正三角形になる証明／三角形の合同と外角より，3つの角が等しい' }
                        ]
                    }
                ]
            },
            {
                id: '25-03', name: '逆', children: [
                    {
                        id: '25-03-01', name: '逆', details: [
                            { id: '25-03-01-01', name: '逆をいう' },
                            { id: '25-03-01-02', name: '逆・反例をいう' }
                        ]
                    }
                ]
            },
            {
                id: '25-04', name: '直角三角形', children: [
                    {
                        id: '25-04-01', name: '直角三角形の合同条件', details: [
                            { id: '25-04-01-01', name: '合同な直角三角形の組をみつけ，そのとき使った合同条件を答える' },
                            { id: '25-04-01-02', name: '直角三角形の合同条件の証明／斜辺と1つの鋭角が等しい' },
                            { id: '25-04-01-03', name: '直角三角形の合同条件의証明／斜辺と他の1辺が等しい' }
                        ]
                    },
                    {
                        id: '25-04-02', name: '直角三角形の合同を利用／証明', details: [
                            { id: '25-04-02-01', name: '直角三角形の合同より証明／角の二等分線上の点から垂線' },
                            { id: '25-04-02-02', name: '直角三角形の合同より証明／三角形の角の二等分線と垂線' },
                            { id: '25-04-02-03', name: '直角三角形の合同より証明／角の2辺からの距離が等しい点' },
                            { id: '25-04-02-04', name: '直角三角形の合同より証明／平行線と交わる直線と垂線' },
                            { id: '25-04-02-05', name: '直角三角形の合同より証明／線分・辺の中点を通る直線と垂線' },
                            { id: '25-04-02-06', name: '直角三角形の合同より証明／直角二等辺三角形の斜辺に垂線をひく' },
                            { id: '25-04-02-07', name: '直角三角形の合同より証明／二等辺三角形の性質について' },
                            { id: '25-04-02-08', name: '直角三角形の合同より証明／二等辺三角形の頂点2つから垂線' },
                            { id: '25-04-02-09', name: '直角三角形の合同より証明／二等辺三角形底辺の中点から垂線' },
                            { id: '25-04-02-10', name: '直角三角形の合同より証明／二等辺三角形になる(底角〜垂線)' },
                            { id: '25-04-02-11', name: '直角三角形の合同より証明／正方形と正三角形' },
                            { id: '25-04-02-12', name: '直角三角形の合同より証明／となり合う直角三角形' },
                            { id: '25-04-02-13', name: '直角三角形の合同より証明／直角二等辺三角形と直角三角形' },
                            { id: '25-04-02-14', name: '直角三角形の合同より証明／三角形の角の二等分線の交点(内心)' },
                            { id: '25-04-02-15', name: '直角三角形の合同より証明／三角形の頂点から下ろした垂線' }
                        ]
                    }
                ]
            },
            {
                id: '25-05', name: '平行四辺形', children: [
                    {
                        id: '25-05-01', name: '平行四辺形の性質', details: [
                            { id: '25-05-01-01', name: '平行四辺形の角の大きさや辺の長さを求める' },
                            { id: '25-05-01-02', name: '平行四辺形の角の大きさや辺の長さを求める／角の二等分線' },
                            { id: '25-05-01-03', name: '平行四辺形の角の大きさや辺の長さを求める／平行線で分けたもの' },
                            { id: '25-05-01-04', name: '平行四辺形の角の大きさを求める／となり合う角の和と比' },
                            { id: '25-05-01-05', name: '平行四辺形の角の大きさや辺の長さを求める／等脚台形' }
                        ]
                    },
                    {
                        id: '25-05-02', name: '平行四辺形の性質の証明', details: [
                            { id: '25-05-02-01', name: '平行四辺形の性質の証明／2組の向かい合う辺はそれぞれ等しい' },
                            { id: '25-05-02-02', name: '平行四辺形の性質の証明／2組の向かい合う角はそれぞれ等しい' },
                            { id: '25-05-02-03', name: '平行四辺形の性質の証明／対角線はそれぞれの中点で交わる' }
                        ]
                    },
                    {
                        id: '25-05-03', name: '平行四辺形の性質を利用／証明', details: [
                            { id: '25-05-03-01', name: '平行四辺形の性質より証明／辺の中点を通り辺の延長と交わる' },
                            { id: '25-05-03-02', name: '平行四辺形の性質より証明／対角線上に2点をとる' },
                            { id: '25-05-03-03', name: '平行四辺形の性質より証明／頂点から辺と同じ長さの点をとる' },
                            { id: '25-05-03-04', name: '平行四辺形の性質より証明／対角の性質を使う' },
                            { id: '25-05-03-05', name: '平行四辺形の性質より証明／対角線の交点を通る線分をひく' },
                            { id: '25-05-03-06', name: '平行四辺形の性質より証明／対角線上に2点をとる(対角線交点有)' },
                            { id: '25-05-03-07', name: '平行四辺形の性質より証明／平行四辺形の辺を共有する正三角形' },
                            { id: '25-05-03-08', name: '平行四辺形の性質より証明／対角線を共有する2つの平行四辺形' },
                            { id: '25-05-03-09', name: '平行四辺形の性質より証明／角の二等分線と辺の延長線が交わる' },
                            { id: '25-05-03-10', name: '平行四辺形の性質より証明／角の二等分線を2本ひく' },
                            { id: '25-05-03-11', name: '平行四辺形の性質より証明／角の二等分線に交わる垂線' },
                            { id: '25-05-03-13', name: '平行四辺形の性質より証明／二等辺三角形になる，線分の長さ' }
                        ]
                    },
                    {
                        id: '25-05-04', name: '平行四辺形になるための条件', details: [
                            { id: '25-05-04-01', name: '平行四辺形になるための条件の証明／2組の対辺について' },
                            { id: '25-05-04-02', name: '平行四辺形になるための条件の証明／2組の対角について' },
                            { id: '25-05-04-03', name: '平行四辺形になるための条件の証明／対角線について' },
                            { id: '25-05-04-04', name: '平行四辺形になるための条件の証明／1組の対辺について' },
                            { id: '25-05-04-05', name: '平行四辺形になるものを選ぶ' }
                        ]
                    },
                    {
                        id: '25-05-05', name: '平行四辺形になる／証明', details: [
                            { id: '25-05-05-01', name: '平行四辺形になる証明／平行四辺形の対角の二等分線をひく' },
                            { id: '25-05-05-02', name: '平行四辺形になる証明／対辺に等しい長さや角をとる' },
                            { id: '25-05-05-03', name: '平行四辺形になる証明／1辺を共有する2つの平行四辺形' },
                            { id: '25-05-05-04', name: '平行四辺形になる証明／平行四辺形の対角線の交点で交わる線分' },
                            { id: '25-05-05-05', name: '平行四辺形になる証明／2本の線分がそれぞれの中点で交わるもの' },
                            { id: '25-05-05-06', name: '平行四辺形になる証明／平行線と二等辺三角形' },
                            { id: '25-05-05-07', name: '平行四辺形になる証明／平行線と中点より三角形の合同' },
                            { id: '25-05-05-08', name: '平行四辺形になる証明／平行四辺形の対角線を含む三角形の合同' },
                            { id: '25-05-05-09', name: '平行四辺形になる証明／交わる2直線に垂線をひき，三角形の合同' },
                            { id: '25-05-05-10', name: '平行四辺形になる証明／平行四辺形の対角線に垂線をひき，合同' },
                            { id: '25-05-05-11', name: '平行四辺形になる証明／平行四辺形の外，内に四角形，2組の合同' },
                            { id: '25-05-05-12', name: '平行四辺形になる証明／3つの正三角形，2組の三角形の合同' }
                        ]
                    },
                    {
                        id: '25-05-06', name: '平行四辺形になるための条件の利用／証明', details: [
                            { id: '25-05-06-01', name: '平行四辺形になることより証明／辺の中点を通り辺の延長と交わる' },
                            { id: '25-05-06-02', name: '平行四辺形になることより証明／等脚台形について' },
                            { id: '25-05-06-03', name: '平行四辺形になることより証明／対角線を一部とする平行四辺形' },
                            { id: '25-05-06-04', name: '平行四辺形になることより証明／三角形の角の二等分線と平行線' },
                            { id: '25-05-06-05', name: '平行四辺形になることより証明／二等辺三角形の辺に平行な線' },
                            { id: '25-05-06-06', name: '平行四辺形になることより証明／2組の平行四辺形が重なる四角形' },
                            { id: '25-05-06-07', name: '平行四辺形になることより証明／平行四辺形の対角線に平行な線' }
                        ]
                    }
                ]
            },
            {
                id: '25-06', name: '特別な平行四辺形', children: [
                    {
                        id: '25-06-01', name: '長方形', details: [
                            { id: '25-06-01-01', name: '長方形の対角線の性質の証明' },
                            { id: '25-06-01-02', name: '平行四辺形の対角線の長さが等しければ長方形であることの証明' },
                            { id: '25-06-01-03', name: '平行四辺形の1つの角が90°ならば長方形であることの証明' },
                            { id: '25-06-01-04', name: '長方形の対角線の性質より直角三角形について証明' },
                            { id: '25-06-01-05', name: '長方形になる証明／三角形の合同より' },
                            { id: '25-06-01-06', name: '長方形になる証明／平行四辺形の角の二等分線に囲まれる図形' }
                        ]
                    },
                    {
                        id: '25-06-02', name: 'ひし形', details: [
                            { id: '25-06-02-01', name: 'ひし形の対角線の性質の証明' },
                            { id: '25-06-02-02', name: 'ひし形の性質より証明／三角形の合同' },
                            { id: '25-06-02-03', name: '平行四辺形のとなり合う辺が等しければひし形であることの証明' },
                            { id: '25-06-02-04', name: '平行四辺形の対角線が垂直に交わるならばひし形であることの証明' },
                            { id: '25-06-02-05', name: 'ひし形になる証明／角の二等分線と平行線' },
                            { id: '25-06-02-06', name: 'ひし形になる証明／2組の平行線より三角形の合同' },
                            { id: '25-06-02-07', name: 'ひし形になる証明／平行四辺形の対角線の交点で垂直に交わる直線' }
                        ]
                    },
                    {
                        id: '25-06-03', name: '正方形', details: [
                            { id: '25-06-03-01', name: '正方形の対角線の性質の証明' },
                            { id: '25-06-03-02', name: '平行四辺形が正方形になるための条件についての証明' },
                            { id: '25-06-03-03', name: '正方形の性質より証明／2つの線分が垂直に交わる' },
                            { id: '25-06-03-04', name: '正方形の性質より証明／2つの正方形と合同(90° ± ∠x)' },
                            { id: '25-06-03-05', name: '正方形になる証明／正方形内の四角形について' }
                        ]
                    },
                    {
                        id: '25-06-04', name: '特別な平行四辺形', details: [
                            { id: '25-06-04-01', name: '特別な平行四辺形の性質について' },
                            { id: '25-06-04-02', name: 'いろいろな四角形の関係について条件と名前を答える' },
                            { id: '25-06-04-03', name: 'いろいろな四角形に条件を加えるとどんな四角形になるか' },
                            { id: '25-06-04-04', name: '四角形の各辺の中点を結んでできる四角形はどんな四角形になるか' },
                            { id: '25-06-04-05', name: 'いろいろな四角形の対角線の性質を考える' }
                        ]
                    }
                ]
            },
            {
                id: '25-07', name: '平行線と面積', children: [
                    {
                        id: '25-07-01', name: '底辺と高さと面積の関係', details: [
                            { id: '25-07-01-01', name: '面積の等しい三角形を選ぶ／底辺や頂点を共有' },
                            { id: '25-07-01-02', name: '面積の等しい三角形を選ぶ／平行を考える' },
                            { id: '25-07-01-03', name: '三角形や平行四辺形の線分の比と面積比を求める' },
                            { id: '25-07-01-04', name: '四角形や多角形の分割された部分の面積を求める' },
                            { id: '25-07-01-05', name: '分割された三角形の面積から平行四辺形の面積を求める' }
                        ]
                    },
                    {
                        id: '25-07-02', name: '底辺と高さと面積の関係より／証明', details: [
                            { id: '25-07-02-01', name: '底辺と高さと面積の関係より証明／面積が等しいならば平行である' },
                            { id: '25-07-02-02', name: '底辺と高さと面積の関係より証明／底辺や頂点を共有する三角形' },
                            { id: '25-07-02-03', name: '底辺と高さと面積の関係より証明／等しい辺を考える' },
                            { id: '25-07-02-04', name: '底辺と高さと面積の関係より証明／平行を考える' },
                            { id: '25-07-02-05', name: '底辺と高さと面積の関係より証明／平行四辺形について面積の割合' }
                        ]
                    },
                    {
                        id: '25-07-03', name: '等積変形', details: [
                            { id: '25-07-03-01', name: '作図／三角形の面積を2等分する' },
                            { id: '25-07-03-02', name: '作図／三角形に等積変形する' },
                            { id: '25-07-03-03', name: '作図(三角形を2等分，四角形・五角形の等積変形)とその証明' },
                            { id: '25-07-03-04', name: '作図／折れ線を直線にする等積変形' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '26', name: '確率', children: [
            {
                id: '26-01', name: '場合の数', children: [
                    {
                        id: '26-01-01', name: 'ならべ方', details: [
                            { id: '26-01-01-01', name: '全部を一列にならべる' },
                            { id: '26-01-01-02', name: '全部を一列にならべる／数' },
                            { id: '26-01-01-03', name: '取り出して一列にならべる' },
                            { id: '26-01-01-04', name: '取り出して一列にならべる／数' },
                            { id: '26-01-01-05', name: '通る道や道順' },
                            { id: '26-01-01-06', name: '硬貨投げや勝負の結果' },
                            { id: '26-01-01-07', name: 'さいころ(2つ・2回)の目の出方' },
                            { id: '26-01-01-08', name: 'じゃんけん(3人)をしたときの出し方' }
                        ]
                    },
                    {
                        id: '26-01-02', name: '組み合わせ', details: [
                            { id: '26-01-02-01', name: 'ものの選び方' },
                            { id: '26-01-02-02', name: 'ものの選び方／2つのグループから選ぶ' },
                            { id: '26-01-02-03', name: '数をつくる／同じ数を含む' },
                            { id: '26-01-02-04', name: '試合の組み合わせ' },
                            { id: '26-01-02-05', name: '硬貨やおもりの組み合わせ' },
                            { id: '26-01-02-06', name: '図形をつくる点の選び方' },
                            { id: '26-01-02-07', name: '最短経路' },
                            { id: '26-01-02-08', name: '条件に合う組み合わせを調べる' }
                        ]
                    }
                ]
            },
            {
                id: '26-02', name: '確率の求め方', children: [
                    {
                        id: '26-02-01', name: '確率の求め方', details: [
                            { id: '26-02-01-01', name: '「同様に確からしい」といえるかどうか' },
                            { id: '26-02-01-02', name: '確率の求め方／1つのさいころを1回投げる' },
                            { id: '26-02-01-03', name: '確率の求め方／正二十面体・正十二面体・正八面体のさいころ' },
                            { id: '26-02-01-04', name: '確率の求め方／色のついた玉を1個取り出す' },
                            { id: '26-02-01-05', name: '確率の求め方／くじを1本ひく' },
                            { id: '26-02-01-06', name: '確率の求め方／トランプを1枚ひく' },
                            { id: '26-02-01-07', name: '確率の求め方／数字をかいたカードを1枚ひく' },
                            { id: '26-02-01-08', name: '確率が1，0を含む場合(さいころ，玉)' },
                            { id: '26-02-01-09', name: '説明文より確率について正しいものを選ぶ' },
                            { id: '26-02-01-10', name: 'くじをひく(あたりやすさ)' }
                        ]
                    },
                    {
                        id: '26-02-02', name: '余事象を含む確率', details: [
                            { id: '26-02-02-01', name: '「Aである」確率から「Aでない」確率を求める' },
                            { id: '26-02-02-02', name: '「Aである」確率を求めてから「Aでない」確率を求める' },
                            { id: '26-02-02-03', name: '余事象を含む確率を求める／さいころを1回投げる' },
                            { id: '26-02-02-04', name: '余事象を含む確率を求める／正多面体のさいころ(正二十面体など)' },
                            { id: '26-02-02-05', name: '余事象を含む確率を求める／色のついた玉を1個取り出す' },
                            { id: '26-02-02-06', name: '余事象を含む確率を求める／くじを1本ひく' },
                            { id: '26-02-02-07', name: '余事象を含む確率を求める／トランプを1枚ひく' },
                            { id: '26-02-02-08', name: '余事象を含む確率を求める／数字をかいたカードを1枚ひく' }
                        ]
                    }
                ]
            },
            {
                id: '26-03', name: 'いろいろな確率', children: [
                    {
                        id: '26-03-01', name: '確率を求める／さいころ', details: [
                            { id: '26-03-01-01', name: '確率を求める／さいころを2つ投げる' },
                            { id: '26-03-01-02', name: '確率を求める／さいころを2つ投げる(余事象含む)' },
                            { id: '26-03-01-03', name: '確率を求める／さいころを2つ投げる(目の数の関係)' },
                            { id: '26-03-01-04', name: '確率を求める／さいころを2つ投げる(目の数が関係式で表示)' },
                            { id: '26-03-01-05', name: '確率を求める／さいころを2つ投げる(マークの組合せ)' },
                            { id: '26-03-01-06', name: '確率を求める／さいころを2回投げる' },
                            { id: '26-03-01-07', name: '確率を求める／さいころを3回(3個)投げる' }
                        ]
                    },
                    {
                        id: '26-03-02', name: '確率を求める／玉', details: [
                            { id: '26-03-02-01', name: '玉を1個ずつ続けて2〜3回取り出す' },
                            { id: '26-03-02-02', name: '玉を同時に2〜3個取り出す' },
                            { id: '26-03-02-03', name: '玉を同時に3個取り出す(余事象含む)' },
                            { id: '26-03-02-04', name: '玉を元に戻してもう一度取り出す' },
                            { id: '26-03-02-05', name: '玉を元に戻してもう一度取り出す(少なくとも)' },
                            { id: '26-03-02-06', name: '玉を取り出し元に戻して取り出す(3回繰り返す)' },
                            { id: '26-03-02-07', name: 'いろいろな取り出し方で玉を2個選ぶ' },
                            { id: '26-03-02-08', name: '確率から玉の個数を求める' },
                            { id: '26-03-02-09', name: '玉を2つのグループから1つずつ選ぶ' }
                        ]
                    },
                    {
                        id: '26-03-03', name: '確率を求める／くじ', details: [
                            { id: '26-03-03-01', name: 'くじを1本ずつ2回ひく' },
                            { id: '26-03-03-02', name: 'くじを同時に2本ひく' },
                            { id: '26-03-03-03', name: 'グループの中から2人を選ぶ' },
                            { id: '26-03-03-04', name: 'グループの中から2人を選ぶ(少なくとも)' },
                            { id: '26-03-03-05', name: '2つのグループから1つずつ選ぶ' },
                            { id: '26-03-03-06', name: 'すべて異なるものの中から続けて選ぶ' },
                            { id: '26-03-03-07', name: '数人の中から何人かを選ぶ' },
                            { id: '26-03-03-08', name: 'あたりやすさとくじの順番' }
                        ]
                    },
                    {
                        id: '26-03-04', name: '確率を求める／硬貨', details: [
                            { id: '26-03-04-01', name: '硬貨を2枚，2回投げる' },
                            { id: '26-03-04-02', name: '硬貨を3枚，3回以上投げる' },
                            { id: '26-03-04-03', name: '種類の異なる硬貨の中から2枚選ぶ' },
                            { id: '26-03-04-04', name: '硬貨を3〜4枚投げる(合計金額)' },
                            { id: '26-03-04-05', name: '硬貨を3〜4回(枚)投げる(合計得点)' }
                        ]
                    },
                    {
                        id: '26-03-05', name: '確率を求める／カード(数)', details: [
                            { id: '26-03-05-01', name: 'カードを全部ならべて整数をつくる' },
                            { id: '26-03-05-02', name: 'カードを続けて取り出す(2けた・3けたの整数)' },
                            { id: '26-03-05-03', name: 'カードを続けて2回取り出す(取り出した数の比較)' },
                            { id: '26-03-05-04', name: 'カードを同時に2枚取り出す' },
                            { id: '26-03-05-05', name: 'カードを同時に2枚取り出す(以上以下・倍数等)' },
                            { id: '26-03-05-06', name: 'カードを同時に3枚取り出す' },
                            { id: '26-03-05-07', name: 'カードをいろいろな取り出し方で選ぶ' },
                            { id: '26-03-05-08', name: 'カードを元に戻してもう一度取り出す' },
                            { id: '26-03-05-09', name: 'カードを元に戻して取り出す(3回繰り返す)' },
                            { id: '26-03-05-10', name: 'カードを2つのグループから1つずつ選ぶ' },
                            { id: '26-03-05-11', name: '文字や人をならべる' }
                        ]
                    },
                    {
                        id: '26-03-06', name: '確率を求める／じゃんけん', details: [
                            { id: '26-03-06-01', name: 'じゃんけんを1回する' }
                        ]
                    },
                    {
                        id: '26-03-07', name: 'いろいろな確率を求める', details: [
                            { id: '26-03-07-01', name: '出方の組合せ(硬貨とさいころ1個ずつ)' },
                            { id: '26-03-07-02', name: '数直線上で点を移動する(硬貨の表裏)' },
                            { id: '26-03-07-03', name: '数直線上で点を移動する(さいころ)' },
                            { id: '26-03-07-04', name: '階段の移動(上り下り・さいころ)' },
                            { id: '26-03-07-05', name: '図形の周上を点を移動する' },
                            { id: '26-03-07-06', name: '座標平面上を移動する点(硬貨，さいころ)' },
                            { id: '26-03-07-07', name: 'さいころの目と条件に合う組み合わせ' },
                            { id: '26-03-07-08', name: '周上の点を結んで三角形をつくる' },
                            { id: '26-03-07-09', name: 'ゲームの得点' }
                        ]
                    }
                ]
            },
            {
                id: '26-04', name: '〈教発〉期待値', children: [
                    {
                        id: '26-04-01', name: '〈教発〉期待値', details: [
                            { id: '26-04-01-01', name: '期待値を求める' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '27', name: 'データの分析', children: [
            {
                id: '27-01', name: '四分位範囲と箱ひげ図', details: [
                    { id: '27-01-01', name: '四分位数を求める' },
                    { id: '27-01-02', name: '範囲と四分位範囲を求める' },
                    { id: '27-01-03', name: '箱ひげ図について' },
                    { id: '27-01-04', name: '箱ひげ図をかく' }
                ]
            },
            {
                id: '27-02', name: '箱ひげ図と活用', details: [
                    { id: '27-02-01', name: '箱ひげ図の読みとり①' },
                    { id: '27-02-02', name: '箱ひげ図の読みとり②' },
                    { id: '27-02-03', name: 'ヒストグラムから箱ひげ図を選ぶ' }
                ]
            }
        ]
    },
    {
        id: '31', name: '展開・因数分解', children: [
            {
                id: '31-01', name: '式の展開', children: [
                    {
                        id: '31-01-01', name: '多項式と単項式の乗法・除法', details: [
                            { id: '31-01-01-01', name: '単項式×多項式／多項式の項２つ' },
                            { id: '31-01-01-02', name: '単項式×多項式／多項式の項３つ' },
                            { id: '31-01-01-03', name: '多項式÷単項式／多項式の項２つ' },
                            { id: '31-01-01-04', name: '多項式÷単項式／多項式の項３つ' },
                            { id: '31-01-01-05', name: '単項式×多項式の和・差' },
                            { id: '31-01-01-06', name: '多項式÷単項式の和・差(単項式×多項式含む)' },
                            { id: '31-01-01-07', name: 'まとめ／多項式と単項式の乗法・除法' }
                        ]
                    },
                    {
                        id: '31-01-02', name: '多項式×多項式', details: [
                            { id: '31-01-02-01', name: '多項式×多項式／２項式×２項式' },
                            { id: '31-01-02-02', name: '多項式×多項式／２項式×３項式' },
                            { id: '31-01-02-03', name: '多項式×多項式／３項式×３項式' }
                        ]
                    },
                    {
                        id: '31-01-03', name: '乗法公式の展開', details: [
                            { id: '31-01-03-01', name: '乗法公式の展開 (x+a)(x+b)／文字１つ' },
                            { id: '31-01-03-02', name: '乗法公式の展開 (x+a)(x+b)／文字２つ' },
                            { id: '31-01-03-03', name: '乗法公式の展開 (x±a)²／文字１つ' },
                            { id: '31-01-03-04', name: '乗法公式の展開 (x±a)²／文字２つ' },
                            { id: '31-01-03-05', name: '乗法公式の展開 (x+a)(x-a)／文字１つ' },
                            { id: '31-01-03-06', name: '乗法公式の展開 (x+a)(x-a)／文字２つ' },
                            { id: '31-01-03-07', name: 'まとめ／乗法公式の展開' }
                        ]
                    },
                    {
                        id: '31-01-04', name: 'いろいろな展開', details: [
                            { id: '31-01-04-01', name: '式を変形して乗法公式の形にする／マイナスを出す' },
                            { id: '31-01-04-02', name: '複数の乗法公式の利用／それぞれ展開し，まとめる' },
                            { id: '31-01-04-03', name: '複数の乗法公式の利用／共通部分をMとおき，展開する' },
                            { id: '31-01-04-04', name: '高次式の展開／くふうして展開する' },
                            { id: '31-01-04-05', name: '３項×３項の展開／展開したときの項の係数を求める' },
                            { id: '31-01-04-06', name: '展開したときの項の係数を利用して文字の値を求める' }
                        ]
                    },
                    {
                        id: '31-01-05', name: '展開／まとめ', details: [
                            { id: '31-01-05-01', name: 'まとめ／式の展開' }
                        ]
                    }
                ]
            },
            {
                id: '31-02', name: '因数分解', children: [
                    {
                        id: '31-02-01', name: '因数分解', details: [
                            { id: '31-02-01-01', name: '共通因数でくくる' },
                            { id: '31-02-01-02', name: '乗法公式より x²+(a+b)x+ab' },
                            { id: '31-02-01-03', name: '乗法公式より x²±2ax+a²／整数' },
                            { id: '31-02-01-04', name: '乗法公式より x²±2ax+a²／分数' },
                            { id: '31-02-01-05', name: '乗法公式より x²±2ax+a²／小数' },
                            { id: '31-02-01-06', name: '乗法公式より x²-a²／整数' },
                            { id: '31-02-01-07', name: '乗法公式より x²-a²／分数' },
                            { id: '31-02-01-08', name: '乗法公式より x²-a²／小数' },
                            { id: '31-02-01-09', name: '〈教外〉たすきがけ abx²+(ad+bc)x+cd' },
                            { id: '31-02-01-10', name: 'まとめ／共通因数・乗法公式' }
                        ]
                    },
                    {
                        id: '31-02-02', name: 'いろいろな因数分解', details: [
                            { id: '31-02-02-01', name: '共通因数でくくり，さらに因数分解する' },
                            { id: '31-02-02-02', name: '共通因数でくくり，さらに因数分解する／分数を含む' },
                            { id: '31-02-02-03', name: '共通部分をMとおき，因数分解する' },
                            { id: '31-02-02-04', name: '４項式の因数分解' },
                            { id: '31-02-02-05', name: '５項以上の式の因数分解' },
                            { id: '31-02-02-06', name: '展開してから因数分解する' },
                            { id: '31-02-02-07', name: '高次式の因数分解' },
                            { id: '31-02-02-08', name: 'まとめ／いろいろな因数分解' }
                        ]
                    },
                    {
                        id: '31-02-03', name: '因数分解／まとめ', details: [
                            { id: '31-02-03-01', name: 'まとめ／因数分解' },
                            { id: '31-02-03-06', name: '数表の数の性質について証明' }
                        ]
                    }
                ]
            },
            {
                id: '31-03', name: '展開・因数分解を利用／図形', details: [
                    { id: '31-03-01', name: '三角形の面積について' },
                    { id: '31-03-02', name: '四角形の面積について' },
                    { id: '31-03-03', name: '円の面積について' },
                    { id: '31-03-04', name: '面積＝中央を通る線の長さ×幅 の証明' }
                ]
            }
        ]
    },
    {
        id: '32', name: '平方根', children: [
            {
                id: '32-01', name: '平方根', children: [
                    {
                        id: '32-01-01', name: '平方根', details: [
                            { id: '32-01-01-01', name: '平方根を求める' },
                            { id: '32-01-01-02', name: '平方根を求める／根号をつける' },
                            { id: '32-01-01-03', name: '根号を使わずに表す' },
                            { id: '32-01-01-04', name: '(±√a)² の値を求める' },
                            { id: '32-01-01-05', name: '平方根について正誤' }
                        ]
                    },
                    {
                        id: '32-01-02', name: '平方根の大小・平方根の値・近似値', details: [
                            { id: '32-01-02-01', name: '平方根の大小／√a の形' },
                            { id: '32-01-02-02', name: 'a と b の間にある無理数を選ぶ' },
                            { id: '32-01-02-03', name: '√n はどんな２つの整数の間にあるのかを求める' },
                            { id: '32-01-02-04', name: 'a < √x < b となる x を求める' },
                            { id: '32-01-02-05', name: 'a < √bx < c となる x を求める' },
                            { id: '32-01-02-06', name: '√a < x < √b となる x を求める' },
                            { id: '32-01-02-07', name: '近似値を求める／平方根の大小関係を利用' },
                            { id: '32-01-02-08', name: '数直線上の数を求める／平方根の大小関係を利用' }
                        ]
                    },
                    {
                        id: '32-01-03', name: '有理数・無理数', details: [
                            { id: '32-01-03-01', name: '有理数と無理数に分ける' },
                            { id: '32-01-03-02', name: '有理数と無理数に分ける／循環小数を含む' },
                            { id: '32-01-03-03', name: '分数を小数で表す／循環小数を含む' },
                            { id: '32-01-03-04', name: '有限小数と循環小数に分ける' },
                            { id: '32-01-03-05', name: '整数と有限小数と循環小数と循環しない無理数に分ける' },
                            { id: '32-01-03-06', name: '循環小数を分数で表す／循環する部分以外は０' },
                            { id: '32-01-03-07', name: '数直線上の数を求める／平方根の大小関係利用(循環小数含)' }
                        ]
                    }
                ]
            },
            {
                id: '32-02', name: '近似値・誤差・有効数字', children: [
                    {
                        id: '32-02-01', name: '近似値', details: [
                            { id: '32-02-01-01', name: '測定値の真の値の範囲を求める' },
                            { id: '32-02-01-02', name: '真の値の範囲を利用して，あてはまる数を求める' },
                            { id: '32-02-01-03', name: '真の値の範囲を利用して，２つの量の範囲を求める' }
                        ]
                    },
                    {
                        id: '32-02-02', name: '誤差', details: [
                            { id: '32-02-02-01', name: '誤差を求める／近似値が与えられているとき' },
                            { id: '32-02-02-02', name: '誤差を求める／近似値を四捨五入して求めてから' },
                            { id: '32-02-02-03', name: '誤差を求める／平均値に含まれる誤差' },
                            { id: '32-02-02-04', name: '誤差の程度を求める' }
                        ]
                    },
                    {
                        id: '32-02-03', name: '有効数字', details: [
                            { id: '32-02-03-01', name: '有効数字を求める' },
                            { id: '32-02-03-02', name: '何の位まで測定したかを求める' },
                            { id: '32-02-03-03', name: '有効数字が分かる形に表す／測定値' },
                            { id: '32-02-03-04', name: '有効数字が分かる形に表す／有効数字のけた数' }
                        ]
                    },
                    {
                        id: '32-02-04', name: 'まとめ／近似値・誤差・有効数字', details: [
                            { id: '32-02-04-01', name: 'まとめ／有効数字について' },
                            { id: '32-02-04-02', name: 'まとめ／真の値の範囲と有効数字を求める' },
                            { id: '32-02-04-03', name: 'まとめ／近似値の有効数字と誤差の程度を求める' }
                        ]
                    }
                ]
            },
            {
                id: '32-03', name: '平方根の乗法・除法', children: [
                    {
                        id: '32-03-01', name: '根号をふくむ式の乗法・除法(有理化なし)', details: [
                            { id: '32-03-01-01', name: '平方根の積／√a × √b (有理化なし)' },
                            { id: '32-03-01-02', name: '平方根の商／√a ÷ √b (有理化なし)' },
                            { id: '32-03-01-03', name: '根号をふくむ数を √a の形に変形する(有理化なし)' },
                            { id: '32-03-01-04', name: '根号をふくむ数を a√b の形に変形する(有理化なし)' },
                            { id: '32-03-01-05', name: '根号をふくむ式の乗除(有理化なし)' },
                            { id: '32-03-01-06', name: 'まとめ／根号をふくむ式の乗除(有理化なし)' }
                        ]
                    },
                    {
                        id: '32-03-02', name: '分母の有理化', details: [
                            { id: '32-03-02-01', name: '分母を有理化する' },
                            { id: '32-03-02-02', name: '平方根の除法(有理化あり)／２数〜３数' },
                            { id: '32-03-02-03', name: '平方根の除法(有理化あり)／２数，分母・分子に平方根' },
                            { id: '32-03-02-04', name: 'まとめ／平方根の乗除(有理化あり)' }
                        ]
                    },
                    {
                        id: '32-03-03', name: '平方根の近似値', details: [
                            { id: '32-03-03-01', name: '平方根の大小／√a，b√c の形' },
                            { id: '32-03-03-02', name: '平方根の近似値を求める／×10，×1/10 等に変形して求める' },
                            { id: '32-03-03-03', name: '平方根の近似値を求める／√a = b√n に変形して求める' },
                            { id: '32-03-03-04', name: '√a の整数部分のけた数を求める' },
                            { id: '32-03-03-05', name: '平方根の近似値を求める／平方根表の利用' }
                        ]
                    },
                    {
                        id: '32-03-04', name: '√a が整数になる条件', details: [
                            { id: '32-03-04-01', name: '√ax が整数になるような x の値を求める／a = m×x' },
                            { id: '32-03-04-02', name: '√a/x が整数になるような x の値を求める／a = m/x' },
                            { id: '32-03-04-03', name: '√a±x が整数になるような x の値を求める／a = m±x' }
                        ]
                    }
                ]
            },
            {
                id: '32-04', name: '根号をふくむ式の計算', children: [
                    {
                        id: '32-04-01', name: '根号をふくむ式の加法・減法', details: [
                            { id: '32-04-01-01', name: '根号をふくむ式の加減／そのまま加減(答えが a√n の形)' },
                            { id: '32-04-01-02', name: '根号をふくむ式の加減／そのまま加減(答えが a√n + b√m の形)' },
                            { id: '32-04-01-03', name: '根号をふくむ式の加減／根号内を整理(答えが a√n の形)' },
                            { id: '32-04-01-04', name: '根号をふくむ式の加減／根号内を整理(答えが a√n + b√m の形)' },
                            { id: '32-04-01-05', name: '根号をふくむ式の加減／有理化して加減' }
                        ]
                    },
                    {
                        id: '32-04-02', name: '根号をふくむ式のいろいろな計算', details: [
                            { id: '32-04-02-01', name: '根号をふくむ式の四則計算' },
                            { id: '32-04-02-02', name: '根号をふくむ式のいろいろな計算／分配法則を利用' },
                            { id: '32-04-02-03', name: '根号をふくむ式のいろいろな計算／乗法公式を利用' },
                            { id: '32-04-02-04', name: '根号をふくむ式のいろいろな計算／分配法則・乗法公式を利用' },
                            { id: '32-04-02-05', name: '根号をふくむ式のいろいろな計算／分配法則・乗法公式を複数利用' },
                            { id: '32-04-02-06', name: '根号をふくむ式のいろいろな計算／因数分解を利用' },
                            { id: '32-04-02-07', name: '根号をふくむ式のいろいろな計算／まとめ' },
                            { id: '32-04-02-08', name: '分子が多項式で根号をふくむ分数の分母の有理化' },
                            { id: '32-04-02-09', name: '分子が多項式で根号をふくむ分数の計算' },
                            { id: '32-04-02-10', name: '〈教発〉分母を有理化／分母が根号をふくむ多項式(乗法公式利用)' },
                            { id: '32-04-02-11', name: '平方根とその加減乗除について正しい' },
                            { id: '32-04-02-12', name: '式の値を求める／根号をふくむ値を代入(因数分解できる式)' },
                            { id: '32-04-02-13', name: '式の値を求める／根号をふくむ値を代入(因数分解できない式)' },
                            { id: '32-04-02-14', name: '式の値を求める／√a の小数部分を x とする' },
                            { id: '32-04-02-15', name: '式の値を求める／a - √b の整数部分を x，小数部分を y とする' },
                            { id: '32-04-02-16', name: '根号をふくむ式のいろいろな計算／連立方程式' }
                        ]
                    }
                ]
            },
            {
                id: '32-05', name: '平方根の利用', children: [
                    {
                        id: '32-05-01', name: '平方根の利用', details: [
                            { id: '32-05-01-01', name: '平方根の利用／正方形の１辺の長さを求める' },
                            { id: '32-05-01-02', name: '平方根の利用／２つの円の面積を合わせた円の半径を求める' },
                            { id: '32-05-01-03', name: '平方根の利用／柱体・球の底面についての長さを求める' },
                            { id: '32-05-01-04', name: '平方根の利用／平方根と確率' },
                            { id: '32-05-01-05', name: '平方根の利用／形をつなぐ' },
                            { id: '32-05-01-06', name: '平方根の利用／コピー用紙の縦と横' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '33', name: '2次方程式', children: [
            {
                id: '33-01', name: '2次方程式', children: [
                    {
                        id: '33-01-01', name: '2次方程式', details: [
                            { id: '33-01-01-01', name: '2次方程式を選ぶ' },
                            { id: '33-01-01-02', name: '2次方程式の係数を答える' },
                            { id: '33-01-01-03', name: '2次方程式の解を選ぶ' },
                            { id: '33-01-01-04', name: 'aを解にもつ2次方程式を選ぶ' }
                        ]
                    },
                    {
                        id: '33-01-02', name: '2次方程式を解く／平方根の利用', details: [
                            { id: '33-01-02-01', name: '2次方程式を解く(平方根の利用)／x²=a' },
                            { id: '33-01-02-02', name: '2次方程式を解く(平方根の利用)／ax²=b, a≠1' },
                            { id: '33-01-02-03', name: '2次方程式を解く(平方根の利用)／(x+a)²=b' },
                            { id: '33-01-02-04', name: '2次方程式を解く(平方根の利用)／a(x+b)²=c' },
                            { id: '33-01-02-05', name: '2次方程式を解く(平方根の利用)／a(x+b)²=c, a≠1' },
                            { id: '33-01-02-06', name: '2次方程式を解く(平方根の利用)／まとめ' }
                        ]
                    },
                    {
                        id: '33-01-03', name: '2次方程式を解く／平方完成', details: [
                            { id: '33-01-03-01', name: '2次方程式を解く(平方完成)／完全平方式にする(穴埋め)' },
                            { id: '33-01-03-02', name: '2次方程式を解く(平方完成)／x²+ax+b=0, a=偶数' },
                            { id: '33-01-03-03', name: '2次方程式を解く(平方完成)／ax²+bx+c=0, b=奇数' },
                            { id: '33-01-03-04', name: '2次方程式を解く(平方完成)／まとめ' }
                        ]
                    },
                    {
                        id: '33-01-04', name: '2次方程式を解く／解の公式', details: [
                            { id: '33-01-04-01', name: '2次方程式を解く(解の公式)／x²の係数＞０' },
                            { id: '33-01-04-02', name: '2次方程式を解く(解の公式)／x²の係数＞０，約分あり' },
                            { id: '33-01-04-03', name: '2次方程式を解く(解の公式)／x²の係数＞０，解が有理数' },
                            { id: '33-01-04-04', name: '2次方程式を解く(解の公式)／まとめ(x²の係数＞０)' },
                            { id: '33-01-04-05', name: '2次方程式を解く(解の公式)／＝０の形に整理する' },
                            { id: '33-01-04-06', name: '2次方程式を解く(解の公式)／かっこをふくむ' },
                            { id: '33-01-04-07', name: '2次方程式を解く(解の公式)／分数をふくむ' },
                            { id: '33-01-04-08', name: '2次方程式を解く(解の公式)／小数をふくむ' },
                            { id: '33-01-04-09', name: '2次方程式を解く(解の公式)／まとめ' }
                        ]
                    },
                    {
                        id: '33-01-05', name: '2次方程式を解く／因数分解の利用', details: [
                            { id: '33-01-05-01', name: '2次方程式を解く(因数分解の利用)／因数分解してあるもの' },
                            { id: '33-01-05-02', name: '2次方程式を解く(因数分解の利用)／因数分解して解く' },
                            { id: '33-01-05-03', name: '2次方程式を解く(因数分解の利用)／式を整理して' },
                            { id: '33-01-05-04', name: '2次方程式を解く(因数分解の利用)／分数・小数をふくむ' },
                            { id: '33-01-05-05', name: '2次方程式を解く(因数分解の利用)／まとめ(整数)' },
                            { id: '33-01-05-06', name: '2次方程式を解く(因数分解の利用)／まとめ(整数・小数・分数)' }
                        ]
                    },
                    {
                        id: '33-01-06', name: '2次方程式を解く／まとめ', details: [
                            { id: '33-01-06-01', name: '2次方程式を解く／まとめ' }
                        ]
                    },
                    {
                        id: '33-01-07', name: '2次方程式の解に関する問題', details: [
                            { id: '33-01-07-01', name: '2次方程式の解の利用／解に条件がある２次方程式' },
                            { id: '33-01-07-02', name: '2次方程式の解の利用／解aについての式の値を求める' },
                            { id: '33-01-07-03', name: '2次方程式の解の利用／解の和・積を求める' },
                            { id: '33-01-07-04', name: '2次方程式の解の利用／解の和・積の利用' },
                            { id: '33-01-07-05', name: '2次方程式の解の利用／１つの解より a の値を求める' },
                            { id: '33-01-07-06', name: '2次方程式の解の利用／１つの解より残りの解を求める' },
                            { id: '33-01-07-07', name: '2次方程式の解の利用／１つの解より残りの解を求める／解の公式' },
                            { id: '33-01-07-08', name: '2次方程式の解の利用／２つの解より a，b の値を求める' },
                            { id: '33-01-07-09', name: '2次方程式の解の利用／a，b の値を求め別の方程式を解く' },
                            { id: '33-01-07-10', name: '2次方程式の解の利用／共通の解をもつ２つの２次方程式' },
                            { id: '33-01-07-11', name: '2次方程式の解の利用／解の関係が分かる２つの２次方程式' },
                            { id: '33-01-07-12', name: '2次方程式の解の利用／解の条件から係数を求める' },
                            { id: '33-01-07-13', name: '2次方程式の解の利用／共通な解をもつ１次方程式と２次方程式' },
                            { id: '33-01-07-14', name: '2次方程式の解の利用／誤った解から正しい解を求める' }
                        ]
                    }
                ]
            },
            {
                id: '33-02', name: '2次方程式の利用', children: [
                    {
                        id: '33-02-01', name: '数に関する2次方程式の問題', details: [
                            { id: '33-02-01-01', name: '2次方程式の利用／ある数を求める' },
                            { id: '33-02-01-02', name: '2次方程式の利用／ある正の数を求める' },
                            { id: '33-02-01-03', name: '2次方程式の利用／誤った計算から，もとの数を求める' },
                            { id: '33-02-01-04', name: '2次方程式の利用／２数の和(差)と２数の関係から，２数を求める' },
                            { id: '33-02-01-05', name: '2次方程式の利用／連続する２つの整数を求める' },
                            { id: '33-02-01-06', name: '2次方程式の利用／連続する３つの整数を求める' },
                            { id: '33-02-01-07', name: '2次方程式の利用／連続する奇数・偶数を求める' },
                            { id: '33-02-01-08', name: '2次方程式の利用／１からnまでの整数の和(公式)からnの値' },
                            { id: '33-02-01-09', name: '2次方程式の利用／２けたの数を求める' },
                            { id: '33-02-01-10', name: '2次方程式の利用／カレンダー' },
                            { id: '33-02-01-11', name: '2次方程式の利用／比例式' }
                        ]
                    },
                    {
                        id: '33-02-02', name: '図形に関する2次方程式の問題', details: [
                            { id: '33-02-02-01', name: '2次方程式の利用／多角形の対角線の数(公式)から，何角形か' },
                            { id: '33-02-02-02', name: '2次方程式の利用／三角形の面積と底辺・高さの関係' },
                            { id: '33-02-02-03', name: '2次方程式の利用／長方形の面積と辺の長さの関係' },
                            { id: '33-02-02-04', name: '2次方程式の利用／正方形→長方形に変形したときの面積' },
                            { id: '33-02-02-05', name: '2次方程式の利用／線分上の２つの正方形の面積の和と１辺の長さ' },
                            { id: '33-02-02-06', name: '2次方程式の利用／台形の面積と上底・下底の長さの関係' },
                            { id: '33-02-02-07', name: '2次方程式の利用／長方形の頂点を含む直角三角形の面積' },
                            { id: '33-02-02-08', name: '2次方程式の利用／直角二等辺三角形の直角を含む長方形の面積' },
                            { id: '33-02-02-09', name: '2次方程式の利用／正方形内の正方形について面積から辺の長さ' },
                            { id: '33-02-02-10', name: '2次方程式の利用／土地のまわりの道と面積' },
                            { id: '33-02-02-11', name: '2次方程式の利用／土地をつらぬく道と面積' },
                            { id: '33-02-02-12', name: '2次方程式の利用／トタン板の四隅を折り曲げたときの側面積' },
                            { id: '33-02-02-13', name: '2次方程式の利用／四角形から直方体の容器をつくる' },
                            { id: '33-02-02-14', name: '2次方程式の利用／立体の表面積から辺の長さ' },
                            { id: '33-02-02-15', name: '2次方程式の利用／立体の体積から辺の長さ' }
                        ]
                    },
                    {
                        id: '33-02-03', name: '動点と面積に関する2次方程式の問題', details: [
                            { id: '33-02-03-01', name: '2次方程式の利用／面積が a となる点の位置(正方形)' },
                            { id: '33-02-03-02', name: '2次方程式の利用／面積が a となるのは何秒後か(長方形)' },
                            { id: '33-02-03-03', name: '2次方程式の利用／面積が a となる点の位置(直角三角形)' }
                        ]
                    },
                    {
                        id: '33-02-04', name: '1次関数と面積に関する2次方程式の問題', details: [
                            { id: '33-02-04-01', name: '2次方程式の利用／１次関数と台形の面積' },
                            { id: '33-02-04-02', name: '2次方程式の利用／座標上の３点を結んだ三角形の面積' },
                            { id: '33-02-04-03', name: '2次方程式の利用／３直線と軸がつくる図形の面積' },
                            { id: '33-02-04-04', name: '2次方程式の利用／１次関数と三角形の面積(面積から座標)' },
                            { id: '33-02-04-05', name: '2次方程式の利用／１次関数と長方形の面積(面積から座標)' },
                            { id: '33-02-04-06', name: '2次方程式の利用／三角形の面積を２等分する直線' }
                        ]
                    },
                    {
                        id: '33-02-05', name: '落下に関する2次方程式の問題', details: [
                            { id: '33-02-05-01', name: '2次方程式の利用／物体を真上に投げるとき高さと時間' }
                        ]
                    },
                    {
                        id: '33-02-06', name: '割合に関する2次方程式の問題', details: [
                            { id: '33-02-06-01', name: '2次方程式の利用／定価(x割の利益)のx割引を売価とする' },
                            { id: '33-02-06-02', name: '2次方程式の利用／定価の数回の値上げの割合' },
                            { id: '33-02-06-03', name: '2次方程式の利用／取り出した食塩水と同量の水を加える' },
                            { id: '33-02-06-04', name: '2次方程式の利用／２つの容器の一部を入替える' },
                            { id: '33-02-06-05', name: '2次方程式の利用／値上げ(値下げ)と売上げ' }
                        ]
                    },
                    {
                        id: '33-02-07', name: '規則性に関する2次方程式', details: [
                            { id: '33-02-07-01', name: '2次方程式の利用／規則的に並べた図形の数について①' },
                            { id: '33-02-07-02', name: '2次方程式の利用／規則的に並べた図形の数について②' },
                            { id: '33-02-07-03', name: '2次方程式の利用／規則的に並べた数について' },
                            { id: '33-02-07-04', name: '2次方程式の利用／規則的に並べた数について(ピラミッド)' }
                        ]
                    },
                    {
                        id: '33-02-08', name: 'いろいろな事象に関する2次方程式の問題', details: [
                            { id: '33-02-08-01', name: '2次方程式の利用／値段と売上げ個数の増減' },
                            { id: '33-02-08-02', name: '2次方程式の利用／試合数' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '34', name: '関数 y=ax²', children: [
            {
                id: '34-01', name: '関数 y=ax²', children: [
                    {
                        id: '34-01-01', name: '関数 y=ax²', details: [
                            { id: '34-01-01-01', name: '「yがxの2乗に比例する式」を選ぶ' },
                            { id: '34-01-01-02', name: '具体的な事象から，yをxの式で表す' },
                            { id: '34-01-01-03', name: 'x，yの値から yをxの式で表す' },
                            { id: '34-01-01-04', name: 'x，yの値から式を求めx，yの値を求める' },
                            { id: '34-01-01-05', name: 'xの値が2，3倍になったとき，yの値について' },
                            { id: '34-01-01-06', name: '「yがxの2乗に比例する式」' }
                        ]
                    }
                ]
            },
            {
                id: '34-02', name: '関数 y=ax² のグラフ', children: [
                    {
                        id: '34-02-01', name: '関数 y=ax² のグラフをかく', details: [
                            { id: '34-02-01-01', name: '関数 y=ax² のグラフをかく／表を完成させて，a＞０' },
                            { id: '34-02-01-02', name: '関数 y=ax² のグラフをかく' },
                            { id: '34-02-01-03', name: 'y=kx², y=-kx² のグラフをかく' }
                        ]
                    },
                    {
                        id: '34-02-02', name: '関数 y=ax² のグラフの特徴', details: [
                            { id: '34-02-02-01', name: 'y=x² のグラフの特徴' },
                            { id: '34-02-02-02', name: 'y=ax² のグラフの特徴' },
                            { id: '34-02-02-03', name: 'いくつかの関数 y=ax² の式から条件にあてはまる式を選ぶ' },
                            { id: '34-02-02-04', name: 'いくつかの関数の式から条件にあてはまる式を選ぶ／１次関数含む' },
                            { id: '34-02-02-05', name: '関数 y=ax² のグラフの特徴にあてはまる式を選ぶ' },
                            { id: '34-02-02-06', name: 'まとめ／関数 y=ax² のグラフについて' }
                        ]
                    },
                    {
                        id: '34-02-03', name: '関数 y=ax² とそのグラフ', details: [
                            { id: '34-02-03-01', name: 'グラフから，y=ax² のグラフの式を求める' },
                            { id: '34-02-03-02', name: 'グラフが通る座標から，y=ax² のaの値を求める' },
                            { id: '34-02-03-03', name: 'グラフが通る座標から，y=ax² のグラフの式を求める' },
                            { id: '34-02-03-04', name: '関数 y=ax² のグラフ上の点を求める' },
                            { id: '34-02-03-05', name: 'グラフから，y=ax² の式，yの値を求める' },
                            { id: '34-02-03-06', name: 'グラフが通る座標から，y=ax² の式，x，yの値を求める' }
                        ]
                    },
                    {
                        id: '34-02-04', name: '関数 y=ax² の変域', details: [
                            { id: '34-02-04-01', name: '関数 y=ax² のグラフをかき，yの変域を求める' },
                            { id: '34-02-04-02', name: '関数 y=ax² のxの変域からyの変域を求める' },
                            { id: '34-02-04-03', name: '関数 y=ax² のxの変域から最大値・最小値を求める' },
                            { id: '34-02-04-04', name: 'x，yの変域から，関数 y=ax² のaの値を求める' },
                            { id: '34-02-04-05', name: 'xの変域とyの最大(小)値から，関数 y=ax² のaの値を求める' },
                            { id: '34-02-04-06', name: '関数 y=ax² のx，yの変域から，文字の値を求める' }
                        ]
                    },
                    {
                        id: '34-02-05', name: '関数 y=ax² の変化の割合', details: [
                            { id: '34-02-05-01', name: '関数 y=ax² の変化の割合を求める／a=整数' },
                            { id: '34-02-05-02', name: '関数 y=ax² の変化の割合を求める／a=分数' },
                            { id: '34-02-05-03', name: '関数 y=ax² の変化の割合を求める／x: 負→正 を含む' },
                            { id: '34-02-05-04', name: 'グラフが通る座標から，関数 y=ax² の変化の割合を求める' },
                            { id: '34-02-05-05', name: 'x，yの増加量から，関数 y=ax² のaの値を求める' },
                            { id: '34-02-05-06', name: '関数 y=ax² の変化の割合から，aの値などを求める' },
                            { id: '34-02-05-07', name: '関数 y=ax² の式，yの増加量から，xの増加量を求める' },
                            { id: '34-02-05-08', name: '関数 y=ax² の式，変化の割合から，xの増加量を求める' }
                        ]
                    },
                    {
                        id: '34-02-06', name: '関数 y=ax² と １次関数', details: [
                            { id: '34-02-06-01', name: '関数 y=ax² と １次関数のxの変域からyの変域を求める' },
                            { id: '34-02-06-02', name: '関数 y=ax² と １次関数の変化の割合を求める' },
                            { id: '34-02-06-03', name: '１次関数と y=ax² のグラフの特徴' },
                            { id: '34-02-06-04', name: '１次関数と y=ax² のx，yの変域が等しいとき文字の値を求める' },
                            { id: '34-02-06-05', name: '１次関数と y=ax² の変化の割合が等しいとき，文字の値を求める' }
                        ]
                    }
                ]
            },
            {
                id: '34-03', name: '関数 y=ax² の利用', children: [
                    {
                        id: '34-03-01', name: '関数 y=ax² の利用／身近な事象', details: [
                            { id: '34-03-01-01', name: '関数 y=ax² の利用／ふりこの周期と長さを求める' },
                            { id: '34-03-01-02', name: '関数 y=ax² の利用／加速度・落下等の平均の速さを求める' },
                            { id: '34-03-01-03', name: '関数 y=ax² の利用／転がり・落下等の式，値を求める' },
                            { id: '34-03-01-04', name: '関数 y=ax² の利用／制動距離について，式，値を求める' },
                            { id: '34-03-01-05', name: '関数 y=ax² の利用／加速度・落下等の平均の速さ，増加量' },
                            { id: '34-03-01-06', name: '関数 y=ax² の利用／式，平均の速さを求める(１次関数含む)' },
                            { id: '34-03-01-07', name: '関数 y=ax² の利用／追いつかれる地点' },
                            { id: '34-03-01-08', name: '関数 y=ax² の利用／タイルの枚数を求める' }
                        ]
                    },
                    {
                        id: '34-03-02', name: '関数 y=ax² の利用／点や図形の移動と面積', details: [
                            { id: '34-03-02-01', name: '関数 y=ax² の利用／四角形上の動点と面積の変化' },
                            { id: '34-03-02-02', name: '関数 y=ax² の利用／直角三角形上の動点と面積の変化' },
                            { id: '34-03-02-03', name: '関数 y=ax² の利用／図形の移動と面積の変化(xの変域１ヶ所)' },
                            { id: '34-03-02-04', name: '関数 y=ax² の利用／図形の移動と面積の変化(xの変域２ヶ所)' }
                        ]
                    }
                ]
            },
            {
                id: '34-04', name: '放物線と直線', children: [
                    {
                        id: '34-04-01', name: '放物線と直線の交点', details: [
                            { id: '34-04-01-02', name: '交点のx座標から，直線の式を求める' },
                            { id: '34-04-01-03', name: '交点の一方のx座標からaの値を求める' },
                            { id: '34-04-01-04', name: '放物線 y=ax² のaの値を求め，交点から直線の式を求める' },
                            { id: '34-04-01-05', name: '放物線と１次関数の変化の割合から放物線・直線の式を求める' },
                            { id: '34-04-01-06', name: '放物線とx軸に平行な直線との交点の座標' },
                            { id: '34-04-01-07', name: '放物線上の点を結んだ線分が直交するときの座標を求める' },
                            { id: '34-04-01-08', name: '〈教発〉交点の座標を求める／２次方程式' }
                        ]
                    },
                    {
                        id: '34-04-02', name: '放物線と線分の長さ', details: [
                            { id: '34-04-02-01', name: '放物線と１次関数と y軸に平行な直線の交点が線分を等分する点' },
                            { id: '34-04-02-02', name: '放物線と１次関数と y軸に平行な直線の交点より線分の長さ' },
                            { id: '34-04-02-03', name: '放物線と y軸に平行な直線の直線上の点の軌跡' },
                            { id: '34-04-02-04', name: '２つの放物線と x軸に平行な直線の交点が線分を等分' },
                            { id: '34-04-02-05', name: '２つの放物線と y軸に平行な直線の交点より線分の長さ' }
                        ]
                    },
                    {
                        id: '34-04-03', name: '放物線と三角形の面積', details: [
                            { id: '34-04-03-01', name: '放物線と直線の交点と原点で囲む三角形／放物線・直線の式' },
                            { id: '34-04-03-02', name: '放物線と直線の交点と原点で囲む三角形／交点の座標・直線の式' },
                            { id: '34-04-03-03', name: '〈教発〉放物線と直線の交点と原点で囲む三角形／交点求めて(連立)' },
                            { id: '34-04-03-04', name: '放物線上の点と x軸上の点で囲む三角形' },
                            { id: '34-04-03-05', name: '放物線上の点と直線との交点で囲む三角形' },
                            { id: '34-04-03-06', name: '２つの放物線上の点で囲む三角形' },
                            { id: '34-04-03-07', name: '放物線上の２点と原点で囲む三角形の面積を２等分する直線の式' },
                            { id: '34-04-03-08', name: '放物線上の３点で囲む三角形の面積を２等分する直線の式' }
                        ]
                    },
                    {
                        id: '34-04-04', name: '放物線と四角形', details: [
                            { id: '34-04-04-01', name: '２つの放物線上の点を頂点とする長方形をつくるときの座標' },
                            { id: '34-04-04-02', name: '放物線と対辺が平行な四角形の面積' },
                            { id: '34-04-04-03', name: '放物線内の四角形の面積を２等分する直線の式' },
                            { id: '34-04-04-04', name: '放物線上の点を頂点とする平行四辺形の座様' },
                            { id: '34-04-04-05', name: '放物線上の点を頂点とする三・四角形の面積比を求める' }
                        ]
                    },
                    {
                        id: '34-04-05', name: '等積変形', details: [
                            { id: '34-04-05-01', name: '〈教発〉放物線内の三角形と等積となる放物線上の座標を求める' },
                            { id: '34-04-05-02', name: '放物線内の三(四)角形の面積が○倍となる座標' }
                        ]
                    },
                    {
                        id: '34-04-06', name: '放物線と体積', details: [
                            { id: '34-04-06-01', name: '放物線と直線と軸からできる図形の回転体の体積を求める' }
                        ]
                    }
                ]
            },
            {
                id: '34-05', name: 'いろいろな関数', children: [
                    {
                        id: '34-05-01', name: '階段関数', details: [
                            { id: '34-05-01-01', name: '階段関数のグラフをかく' },
                            { id: '34-05-01-02', name: '階段関数のグラフをかく，関数の判別' },
                            { id: '34-05-01-03', name: '階段関数のグラフをかく，関数の判別，xやyの値と変域' },
                            { id: '34-05-01-04', name: '階段関数のグラフよりxやyの値，２種類の比較' }
                        ]
                    },
                    {
                        id: '34-05-02', name: 'いろいろな関数', details: [
                            { id: '34-05-02-01', name: 'yをxの式で表す／反比例・１次関数・２次関数' },
                            { id: '34-05-02-02', name: 'yがxの関数であるものを選ぶ／反比例・１次・２次関数等' },
                            { id: '34-05-02-03', name: '文章題／指数関数(自然数の和，表)' },
                            { id: '34-05-02-04', name: '文章題／指数関数' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '35', name: '図形と相似', children: [
            {
                id: '35-01', name: '相似な図形', children: [
                    {
                        id: '35-01-01', name: '相似な図形をかく', details: [
                            { id: '35-01-01-01', name: '相似な図形をかく／相似の中心なし・方眼' },
                            { id: '35-01-01-02', name: '相似な図形をかく／相似の中心あり・方眼' },
                            { id: '35-01-01-03', name: '相似な図形をかく／相似の中心あり' },
                            { id: '35-01-01-04', name: '相似の中心をかく' }
                        ]
                    },
                    {
                        id: '35-01-02', name: '相似な図形の性質', details: [
                            { id: '35-01-02-01', name: '相似な図形の対応する辺・角を求める／相似の中心なし' },
                            { id: '35-01-02-02', name: '相似な図形の対応する辺・角を求める／相似の中心あり' },
                            { id: '35-01-02-03', name: '相似な図形の相似比を求める' },
                            { id: '35-01-02-04', name: '相似な図形の対応する辺・角，相似比を求める／相似の中心なし' },
                            { id: '35-01-02-05', name: '相似な図形の対応する辺・角，相似比を求める／相似の中心あり' },
                            { id: '35-01-02-06', name: 'まとめ／相似な図形の性質' }
                        ]
                    }
                ]
            },
            {
                id: '35-02', name: '三角形の相似条件', children: [
                    {
                        id: '35-02-01', name: '三角形の相似条件について', details: [
                            { id: '35-02-01-01', name: '相似な三角形を見つけ，相似条件を答える' },
                            { id: '35-02-01-02', name: '相似な三角形を見つけ，相似条件を答える／重なる図' },
                            { id: '35-02-01-03', name: '正三角形，正方形などについて，常に相似かどうか' },
                            { id: '35-02-01-04', name: '相似な三角形をつくるとき，残りの１辺の長さ' },
                            { id: '35-02-01-05', name: '相似な三角形を見つけ，辺の長さを求める' },
                            { id: '35-02-01-06', name: 'まとめ／三角形の相似条件' }
                        ]
                    },
                    {
                        id: '35-02-02', name: '相似の証明', details: [
                            { id: '35-02-02-01', name: '相似の証明／相似な三角形の性質を利用して' },
                            { id: '35-02-02-02', name: '相似の証明／辺の長さ・辺の比がわかっている' },
                            { id: '35-02-02-03', name: '相似の証明／１つの角を共有する三角形' },
                            { id: '35-02-02-04', name: '相似の証明／平行線の性質を利用して' },
                            { id: '35-02-02-05', name: '相似の証明／平行四辺形の性質を利用して' },
                            { id: '35-02-02-06', name: '相似の証明／内角・外角の性質を利用して(折り返した図形)' },
                            { id: '35-02-02-07', name: '相似の証明／三角形の内角・外角の性質を利用して' },
                            { id: '35-02-02-08', name: '相似の証明／二等辺三角形の性質を利用して' },
                            { id: '35-02-02-09', name: '相似の証明／合同を利用して' },
                            { id: '35-02-02-10', name: '相似の証明／２組の三角形の相似(相似より辺の比利用)' },
                            { id: '35-02-02-11', name: '相似の証明／２組の三角形の相似(直角三角形の内角利用)' }
                        ]
                    },
                    {
                        id: '35-02-03', name: '相似の証明と辺の長さ', details: [
                            { id: '35-02-03-01', name: '相似の証明と辺の長さ／辺の長さがわかっている三角形' },
                            { id: '35-02-03-02', name: '相似の証明と辺の長さ／１つの角を共有する三角形' },
                            { id: '35-02-03-03', name: '相似の証明と辺の長さ／平行線の性質を利用して' },
                            { id: '35-02-03-04', name: '相似の証明と辺の長さ／三角形の内角・外角の性質を利用して' },
                            { id: '35-02-03-05', name: '相似の証明と辺の長さ／二等辺三角形の性質を利用して' },
                            { id: '35-02-03-06', name: '相似の証明と辺の長さ／長方形の相似(黄金分割)' }
                        ]
                    },
                    {
                        id: '35-02-04', name: '相似の利用', details: [
                            { id: '35-02-04-01', name: '相似の利用／円を利用する' },
                            { id: '35-02-04-02', name: '相似の利用／正五角形とその対角線' }
                        ]
                    }
                ]
            },
            {
                id: '35-03', name: '三角形と比', children: [
                    {
                        id: '35-03-01', name: '三角形と比', details: [
                            { id: '35-03-01-01', name: '三角形と比の定理の証明①' },
                            { id: '35-03-01-02', name: '三角形と比の定理の証明②' },
                            { id: '35-03-01-03', name: '三角形と比の定理の逆について証明' }
                        ]
                    },
                    {
                        id: '35-03-02', name: '三角形と比の利用', details: [
                            { id: '35-03-02-01', name: '三角形と比／線分の長さを求める' },
                            { id: '35-03-02-02', name: '三角形と比／線分の比や長さを求める(平行線１組)' },
                            { id: '35-03-02-03', name: '三角形と比／線分の比や長さを求める(平行線２組)' },
                            { id: '35-03-02-04', name: '三角形と比／線分の比や長さを求める(平行線３組)' },
                            { id: '35-03-02-05', name: '三角形と比／線分の比や長さを求める(角を共有する２つの三角形)' },
                            { id: '35-03-02-06', name: '三角形と比／線分の比を求める(補助線・平行線を引く)' },
                            { id: '35-03-02-07', name: '三角形と比／線分の比を求める(複雑な図形)' },
                            { id: '35-03-02-08', name: '作図／三角形と比の定理より，線分を比に分ける' },
                            { id: '35-03-02-09', name: '三角形と比の定理の逆の性質を利用して平行な線分をみつける' }
                        ]
                    }
                ]
            },
            {
                id: '35-04', name: '中点連結定理', children: [
                    {
                        id: '35-04-01', name: '中点連結定理について', details: [
                            { id: '35-04-01-01', name: '中点連結定理の証明' },
                            { id: '35-04-01-02', name: '中点連結定理の逆の証明' }
                        ]
                    },
                    {
                        id: '35-04-02', name: '中点連結定理の利用／図形の識別', details: [
                            { id: '35-04-02-01', name: '中点連結定理の利用／どんな三角形になるか答える' },
                            { id: '35-04-02-02', name: '中点連結定理の利用／どんな四角形になるか答える' },
                            { id: '35-04-02-03', name: '中点連結定理の利用／与えられた四角形になるときの対角線の関係' }
                        ]
                    },
                    {
                        id: '35-04-03', name: '中点連結定理の利用／線分の長さ', details: [
                            { id: '35-04-03-01', name: '中点連結定理の利用／三角形の線分の長さや角の大きさを求める' },
                            { id: '35-04-03-02', name: '中点連結定理の利用／線分の長さを求める(三角形)' },
                            { id: '35-04-03-03', name: '中点連結定理の利用／線分の長さを求める(台形)' },
                            { id: '35-04-03-04', name: '中点連結定理の利用／線分の長さを求める(角の二等分線と中点)' },
                            { id: '35-04-03-05', name: '中点連結定理の利用／三角形・四角形の周の長さを求める' }
                        ]
                    },
                    {
                        id: '35-04-04', name: '中点連結定理の利用／証明', details: [
                            { id: '35-04-04-01', name: '中点連結定理を利用する証明／三角形の相似' },
                            { id: '35-04-04-02', name: '中点連結定理を利用する証明／いろいろな三角形の線分の長さ' },
                            { id: '35-04-04-03', name: '中点連結定理を利用する証明／台形の２辺の中点を結ぶ(合同)' },
                            { id: '35-04-04-04', name: '中点連結定理を利用する証明／台形の２辺の中点を結ぶ(対角線)' },
                            { id: '35-04-04-05', name: '中点連結定理を利用する証明／二等辺三角形になること' },
                            { id: '35-04-04-06', name: '中点連結定理を利用する証明／平行四辺形になること' },
                            { id: '35-04-04-07', name: '中点連結定理を利用する証明／平行四辺形になることと条件追加' },
                            { id: '35-04-04-08', name: '中点連結定理を利用する証明／長方形・ひし形になること' },
                            { id: '35-04-04-09', name: '中点連結定理を利用する証明／平行になること(平行四辺形の性質)' },
                            { id: '35-04-04-10', name: '中点連結定理を利用する証明／複雑な図形についていろいろな証明' }
                        ]
                    },
                    {
                        id: '35-04-05', name: '中点連結定理の利用／面積', details: [
                            { id: '35-04-05-01', name: '中点連結定理より，辺の比・面積比を求める／三角形' },
                            { id: '35-04-05-02', name: '中点連結定理より，辺の比・面積比を求める／平行四辺形' }
                        ]
                    }
                ]
            },
            {
                id: '35-05', name: '平行線と線分の比', children: [
                    {
                        id: '35-05-01', name: '平行線と比', details: [
                            { id: '35-05-01-01', name: '平行線と線分の比の定理の証明' },
                            { id: '35-05-01-02', name: '平行線と線分の比の定理を利用して平行な３平面について証明' }
                        ]
                    },
                    {
                        id: '35-05-02', name: '平行線と線分の比の利用／線分の長さ', details: [
                            { id: '35-05-02-01', name: '平行線と線分の比の利用／線分の長さを求める(平行線)' },
                            { id: '35-05-02-02', name: '平行線と線分の比の利用／線分の長さを求める(台形・四角形)' },
                            { id: '35-05-02-03', name: '平行線と線分の比の利用／線分の長さを求める(補助線を引く)' },
                            { id: '35-05-02-04', name: '平行線と線分の比の利用／線分の長さを求める(平行線３本)' },
                            { id: '35-05-02-05', name: '平行線と線分の比の利用／線分の長さを求める(台形の対角線)' },
                            { id: '35-05-02-06', name: '平行線と線分の比の利用／線分の長さを求める(長方形の対角線)' },
                            { id: '35-05-02-07', name: '平行線と線分の比の利用／線分の比や長さを求める(平行四辺形)' }
                        ]
                    },
                    {
                        id: '35-05-03', name: '平行線と線分の比の利用／面積', details: [
                            { id: '35-05-03-01', name: '平行線と線分の比の利用／線分の長さや面積を求める(台形)' },
                            { id: '35-05-03-02', name: '平行線と線分の比の利用／線分の長さや面積を求める(平行四辺形)' },
                            { id: '35-05-03-03', name: '平行線と線分の比の利用／線分の比や面積(平行四辺形，和・差)' },
                            { id: '35-05-03-04', name: '平行線と線分の比の利用／線分の比や面積(平行四辺形，２つの比)' },
                            { id: '35-05-03-05', name: '平行線と線分の比の利用／線分の比や面積を求める(三角形)' }
                        ]
                    },
                    {
                        id: '35-05-04', name: '平行線と線分の比の利用／角の二等分線', details: [
                            { id: '35-05-04-01', name: '平行線と線分の比より，三角形の内角の二等分線と辺の比の証明' },
                            { id: '35-05-04-02', name: '平行線と線分の比より，三角形の外角の二等分線と辺の比の証明' },
                            { id: '35-05-04-03', name: '角の二等分線と辺の比を利用して線分の長さなどを求める' },
                            { id: '35-05-04-04', name: '角の二等分線と二等辺三角形の性質を利用して求める' }
                        ]
                    }
                ]
            },
            {
                id: '35-06', name: '相似比と面積比', children: [
                    {
                        id: '35-06-01', name: '相似比→面積比', details: [
                            { id: '35-06-01-01', name: '相似な図形の面積比を求める' },
                            { id: '35-06-01-02', name: '相似な図形の周の長さの比・面積比を求める' },
                            { id: '35-06-01-03', name: '相似な図形の面積を求める' },
                            { id: '35-06-01-04', name: '相似より面積比を求める／三角形の底辺に平行な線分' },
                            { id: '35-06-01-05', name: '相似より面積を求める／三角形の底辺に平行な線分' },
                            { id: '35-06-01-06', name: '相似より面積比を求める／三角形の２辺に平行な線分' },
                            { id: '35-06-01-07', name: '相似より面積を求める／三角形の２辺に平行な線分' },
                            { id: '35-06-01-08', name: '相似より面積比を求める／三角形の底辺に平行な２本の線分' },
                            { id: '35-06-01-09', name: '相似より面積を求める／三角形の底辺に平行な２本の線分' },
                            { id: '35-06-01-10', name: '相似より面積比を求める／角を共有する三角形' },
                            { id: '35-06-01-11', name: '相似より面積比を求める／角を共有する直角三角形' },
                            { id: '35-06-01-12', name: '相似より面積(比)を求める／台形(対角線)' },
                            { id: '35-06-01-13', name: '相似より面積を求める／台形(対角線)' },
                            { id: '35-06-01-14', name: '相似より面積(比)を求める／平行四辺形・長方形' },
                            { id: '35-06-01-15', name: '相似(平行四辺形と三角形)な三角形より，面積(比)を求める' },
                            { id: '35-06-01-16', name: '相似より面積(比)を求める／三角形の底辺に平行な線分と対角線' },
                            { id: '35-06-01-17', name: '相似より面積(比)を求める／平行線３本と三角形' },
                            { id: '35-06-01-18', name: '相似より面積比を求める／３つの同心円' }
                        ]
                    },
                    {
                        id: '35-06-02', name: '面積比→相似比', details: [
                            { id: '35-06-02-01', name: '相似な図形の面積比から辺の長さを求める' },
                            { id: '35-06-02-02', name: '相似な三角形の面積から台形の面積を求める' }
                        ]
                    }
                ]
            },
            {
                id: '35-07', name: '相似比と体積比', children: [
                    {
                        id: '35-07-01', name: '相似比→面積比・体積比', details: [
                            { id: '35-07-01-01', name: '相似な立体をみつける' },
                            { id: '35-07-01-02', name: '相似な立体の相似比より，線分の比を求める' },
                            { id: '35-07-01-03', name: '相似な立体の相似比より，表面積比・体積比を求める' },
                            { id: '35-07-01-04', name: '相似な立体の相似比より，表面積を求める' },
                            { id: '35-07-01-05', name: '相似な立体の相似比より，体積を求める' },
                            { id: '35-07-01-06', name: '相似な立体の相似比より，表面積・体積を求める' },
                            { id: '35-07-01-07', name: '相似より体積比を求める／錐体を底面に平行に切る' },
                            { id: '35-07-01-08', name: '相似より表面積・体積比を求める／錐体を底面に平行に切る' },
                            { id: '35-07-01-09', name: '相似より表面積・体積を求める／錐体を底面に平行に切る' },
                            { id: '35-07-01-10', name: '相似より体積比を求める／錐体を底面に平行に３分割' },
                            { id: '35-07-01-11', name: '相似より体績を求める／錐体を底面に平行に３分割' }
                        ]
                    },
                    {
                        id: '35-07-02', name: '面積比→体積比', details: [
                            { id: '35-07-02-01', name: '相似な立体の表面積比より，体積比を求める' },
                            { id: '35-07-02-02', name: '相似な立体の表面積比より，辺・体積比を求める' },
                            { id: '35-07-02-03', name: '相似な立体の表面積比より，体積を求める' },
                            { id: '35-07-02-04', name: '相似な立体の面積より，体積を求める' },
                            { id: '35-07-02-05', name: '相似な立体の面積より，辺の長さ・体積を求める' },
                            { id: '35-07-02-06', name: '面積比より，辺・体積比を求める／錐体を底面に平行に切る' },
                            { id: '35-07-02-07', name: '面積より，体績を求める／錐体を底面に平行に切る' }
                        ]
                    },
                    {
                        id: '35-07-03', name: '体積比→相似比', details: [
                            { id: '35-07-03-01', name: '体積比より，面積・体積などを求める／錐体を底面に平行に切る' }
                        ]
                    },
                    {
                        id: '35-07-04', name: '相似比・体積比の利用', details: [
                            { id: '35-07-04-01', name: '相似比・体積比の利用／１つの立体を相似な立体に分割する' },
                            { id: '35-07-04-02', name: '相似比・体積比の利用／相似な立体の重さを求める' },
                            { id: '35-07-04-03', name: '相似比・体積比の利用／回転体の表面積・体積を求める／円錐台' },
                            { id: '35-07-04-04', name: '相似比・体積比の利用／円錐形の容器に水を入れた体積と容積の比' },
                            { id: '35-07-04-05', name: '相似比・体積比の利用／円錐形の容器に水を入れた相似比と体積' },
                            { id: '35-07-04-06', name: '相似比・体積比の利用／円錐形から円柱形の容器への水の移しかえ' },
                            { id: '35-07-04-07', name: '相似比・体積比の利用／円錐形の容器にコップで水を入れる' },
                            { id: '35-07-04-08', name: '相似比・体積比の利用／円錐形の容器に水を追加する残りの体積' },
                            { id: '35-07-04-09', name: '相似比・体積比の利用／円錐形の容器に一定量ずつ給水(排水)する' },
                            { id: '35-07-04-10', name: '相似比・体積比の利用／立方体(直方体)の切断(三角錐台の体積)' }
                        ]
                    }
                ]
            },
            {
                id: '35-08', name: '相似の利用', children: [
                    {
                        id: '35-08-01', name: '縮図', details: [
                            { id: '35-08-01-01', name: '縮尺を求める' },
                            { id: '35-08-01-02', name: '縮図をかいて距離を求める' },
                            { id: '35-08-01-03', name: '縮図をかいて距離を求める／仰角，ふかくより' },
                            { id: '35-08-01-04', name: '影の長さと相似／２つのものの影' },
                            { id: '35-08-01-05', name: '影の長さと相似／２つのものの真横からと真上からの相似' }
                        ]
                    },
                    {
                        id: '35-08-02', name: '身近なもの', details: [
                            { id: '35-08-02-01', name: 'どちらが得か身近なものを使って調べる' }
                        ]
                    }
                ]
            },
            {
                id: '35-09', name: '<教発>三角形の重心', children: [
                    {
                        id: '35-09-01', name: '<教発>三角形の重心の定理', details: [
                            { id: '35-09-01-01', name: '<教発>三角形の重心の定理の証明' }
                        ]
                    },
                    {
                        id: '35-09-02', name: '<教発>三角形の重心の利用／証明', details: [
                            { id: '35-09-02-01', name: '<教発>三角形の重心を利用する証明／平行四辺形の対角線と中線' },
                            { id: '35-09-02-02', name: '<教発>三角形の重心を利用する証明／平行四辺形の対角線の３等分' },
                            { id: '35-09-02-03', name: '<教発>三角形の重心を利用する証明／二等辺三角形になる' },
                            { id: '35-09-02-04', name: '<教発>三角形の重心を利用する証明／平行四辺形になる' },
                            { id: '35-09-02-05', name: '<教発>三角形の重心を利用する証明／平行四辺形の対角線と重心' },
                            { id: '35-09-02-06', name: '<教発>三角形の重心を利用する証明／三角形の重心を結んだ線分' },
                            { id: '35-09-02-07', name: '<教発>三角形の重心を利用する証明／重心で分ける３つの三角形' }
                        ]
                    },
                    {
                        id: '35-09-03', name: '<教発>三角形の重心の利用／線分の比', details: [
                            { id: '35-09-03-01', name: '<教発>三角形の重心の利用／線分の比(三角形の中線と平行線)' },
                            { id: '35-09-03-02', name: '<教発>三角形の重心の利用／線分の比(平行四辺形の対角線①)' },
                            { id: '35-09-03-03', name: '<教発>三角形の重心の利用／線分の比(平行四辺形の対角線②)' }
                        ]
                    },
                    {
                        id: '35-09-04', name: '<教発>三角形の重心の利用／線分の長さ', details: [
                            { id: '35-09-04-01', name: '<教発>三角形の重心の利用／線分の長さ(三角形の中線の交点)' },
                            { id: '35-09-04-02', name: '<教発>三角形の重心の利用／線分の長さ(三角形の中線と平行線)' },
                            { id: '35-09-04-03', name: '<教発>三角形の重心の利用／線分の長さ(重心を通り底辺に平行)' },
                            { id: '35-09-04-04', name: '<教発>三角形の重心の利用／線分の長さ(中線と平行線)' },
                            { id: '35-09-04-05', name: '<教発>三角形の重心の利用／線分の長さ(平行四辺形の対角線)' },
                            { id: '35-09-04-06', name: '<教発>三角形の重心の利用／線分の長さ(台形内の三角形の重心)' },
                            { id: '35-09-04-07', name: '<教発>三角形の重心の利用／線分の長さ(重心が対角線上の四角形)' },
                            { id: '35-09-04-08', name: '<教発>三角形の重心の利用／線分の長さ(重心が対角線上にない)' }
                        ]
                    },
                    {
                        id: '35-09-05', name: '<教発>三角形の重心の利用／面積', details: [
                            { id: '35-09-05-01', name: '<教発>三角形の重心の利用／面積(中線でできた四角形)' },
                            { id: '35-09-05-02', name: '<教発>三角形の重心の利用／面積(中線と平行線に囲まれた図形)' },
                            { id: '35-09-05-03', name: '<教発>三角形の重心の利用／面積(重心と中線を利用して面積)' },
                            { id: '35-09-05-04', name: '<教発>三角形の重心の利用／面積(中線からなる四角形，対角線)' }
                        ]
                    },
                    {
                        id: '35-09-06', name: '<教発>三角形の重心の利用／まとめ', details: [
                            { id: '35-09-06-01', name: '<教発>三角形の重心の利用／三角形' },
                            { id: '35-09-06-02', name: '<教発>三角形の重心の利用／平行四辺形' }
                        ]
                    }
                ]
            },
        ]
    },
    {
        id: '36', name: '円', children: [
            {
                id: '36-01', name: '円周角の定理', children: [
                    {
                        id: '36-01-01', name: '円周角の定理', details: [
                            { id: '36-01-01-01', name: '定理の証明／円周角と中心角' },
                            { id: '36-01-01-02', name: '定理の証明／半円の弧に対する円周角' },
                            { id: '36-01-01-03', name: '２つの弦が交わってできる角について証明' },
                            { id: '36-01-01-04', name: '円周角の大きさを求める' },
                            { id: '36-01-01-05', name: '２つの弦が交わってできる角の大きさを求める' },
                            { id: '36-01-01-06', name: '中心角より円周角の大きさを求める' },
                            { id: '36-01-01-07', name: '円周角より中心角等，角の大きさを求める' },
                            { id: '36-01-01-08', name: '半円の弧と円周角より角の大きさを求める' },
                            { id: '36-01-01-09', name: 'まとめ／円周角の大きさを求める' }
                        ]
                    },
                    {
                        id: '36-01-02', name: '円周角と弧', details: [
                            { id: '36-01-02-01', name: '定理の証明／円周角と弧' },
                            { id: '36-01-02-02', name: '等しい弧に対する円周角の大きさを求める' },
                            { id: '36-01-02-03', name: '円に対する弧の割合より角の大きさを求める' },
                            { id: '36-01-02-04', name: '弧の長さと円周角の関係より角の大きさを求める' },
                            { id: '36-01-02-05', name: '弧の長さと円周角の関係より弧の長さを求める' }
                        ]
                    }
                ]
            },
            {
                id: '36-02', name: '円周角の定理の逆', children: [
                    {
                        id: '36-02-01', name: '円周角の定理の逆', details: [
                            { id: '36-02-01-01', name: '円の内部・外部の点と角の大きさについて証明' },
                            { id: '36-02-01-02', name: '４点が同一円周上にあることの証明／同じ大きさの角' },
                            { id: '36-02-01-03', name: '４点が同一円周上にあることの証明／角の大きさを求めて' },
                            { id: '36-02-01-04', name: '４点が同一円周上にあることより角が等しいことの証明' },
                            { id: '36-02-01-05', name: '４点が同一円周上にあるものを選ぶ' },
                            { id: '36-02-01-06', name: '同一円周上にある四角形の角の大きさを求める' },
                            { id: '36-02-01-07', name: '円周角の定理の逆と点の集合' }
                        ]
                    }
                ]
            },
            {
                id: '36-03', name: '円の性質の利用', children: [
                    {
                        id: '36-03-01', name: '円周角の定理(逆)の利用', details: [
                            { id: '36-03-01-01', name: '円周角の定理(の逆)の利用／角や弧の長さについて証明' },
                            { id: '36-03-01-02', name: '円周角の定理(の逆)の利用／弧の長さの和について証明' },
                            { id: '36-03-01-03', name: '円周角の定理(の逆)の利用／円に内接する三角形などの合同の証明' },
                            { id: '36-03-01-04', name: '円周角の定理(の逆)の利用／作図(角をかく)' },
                            { id: '36-03-01-05', name: '円周角の定理(の逆)の利用／作図' }
                        ]
                    },
                    {
                        id: '36-03-02', name: '円と相似', details: [
                            { id: '36-03-02-01', name: '円と相似／相似の証明' },
                            { id: '36-03-02-02', name: '円と相似／相似の証明／角の二等分線' },
                            { id: '36-03-02-03', name: '円と相似／辺の長さを求める' },
                            { id: '36-03-02-04', name: '円と相似／相似の証明(半円含む)' },
                            { id: '36-03-02-05', name: '円と相似／辺の長さを求める(半円含む)' },
                            { id: '36-03-02-06', name: '円と相似／円周角と弧の関係より相似の証明' },
                            { id: '36-03-02-07', name: '円と相似／円周角と弧の関係・平行線より相似の証明' },
                            { id: '36-03-02-08', name: '円と相似／円周角と弧の関係より辺の長さを求める' },
                            { id: '36-03-02-09', name: '円と相似／円周角と弧の関係より合同の証明' },
                            { id: '36-03-02-10', name: '円と相似／交わる２円について相似の証明' },
                            { id: '36-03-02-11', name: '円と相似／平方根の長さの作図' },
                            { id: '36-03-02-12', name: '<教発>円と相似／方べきの定理について証明' }
                        ]
                    },
                    {
                        id: '36-03-03', name: '円と接線', details: [
                            { id: '36-03-03-01', name: '円と接線／作図(円外の点からの接線)' },
                            { id: '36-03-03-02', name: '円と接線／円外の点からひいた２つの接線の長さなどの証明' },
                            { id: '36-03-03-03', name: '円と接線／接線の長さを求める' },
                            { id: '36-03-03-04', name: '円と接線／円と３つの接線について証明' },
                            { id: '36-03-03-05', name: '円と接線／角の大きさを求める' },
                            { id: '36-03-03-06', name: '円と接線／角の大きさを求める(接線と円周角)' },
                            { id: '36-03-03-07', name: '円と接線／角の大きさを求める(いろいろな図形の性質)' },
                            { id: '36-03-03-08', name: '円と接線／円が内接する三角形の辺・線分の長さを求める' },
                            { id: '36-03-03-09', name: '円と接線／円が内接する直角三角形の周・線分の長さを求める' },
                            { id: '36-03-03-10', name: '<教発>円と接線／内接円の半径を求める(直角三角形)' },
                            { id: '36-03-03-11', name: '<教外>円と接線／内接円ের半径を求める(三角形の面積から求める)' },
                            { id: '36-03-03-12', name: '<教発>円と接線／円に外接する四角形の辺の長さに関する証明' },
                            { id: '36-03-03-13', name: '<教発>円と接線／円に外接する四角形の線分の長さを求める' }
                        ]
                    },
                    {
                        id: '36-03-04', name: '円と作図', details: [
                            { id: '36-03-04-01', name: '弦を１辺とし，三角形の面積が最大となる円周上の点を求める' }
                        ]
                    }
                ]
            },
            {
                id: '36-04', name: '<教外>円と直線', children: [
                    {
                        id: '36-04-01', name: '<教外>弧と弦', details: [
                            { id: '36-04-01-01', name: '<教外>弧と弦의性格について' }
                        ]
                    },
                    {
                        id: '36-04-02', name: '<教外>円の弦', details: [
                            { id: '36-04-02-01', name: '<教外>円の弦の性質の証明／弦の垂直二等分線は円の中心を通る' },
                            { id: '36-04-02-02', name: '<教外>円の弦の性質の利用／証明①' },
                            { id: '36-04-02-03', name: '<教外>円の弦の性質の利用／証明②' }
                        ]
                    },
                    {
                        id: '36-04-03', name: '<教外>三角形の外心と外接円', details: [
                            { id: '36-04-03-01', name: '<教外>三角形の外心／外心の性質の証明' },
                            { id: '36-04-03-02', name: '<教外>三角形の外心／作図(外接円)' },
                            { id: '36-04-03-03', name: '<教外>三角形の外心／三角形の種類と外心の位置' },
                            { id: '36-04-03-04', name: '<教外>三角形の外心／直角三角形の斜辺の中点が外心となる証明' },
                            { id: '36-04-03-05', name: '<教外>三角形の外心／三角形の外心と角について証明' },
                            { id: '36-04-03-06', name: '<教外>三角形の外心／角の大きさを求める' }
                        ]
                    },
                    {
                        id: '36-04-04', name: '<教外>円と直線の位置関係', details: [
                            { id: '36-04-04-01', name: '<教外>円の中心と直線との距離・共有点／図あり' },
                            { id: '36-04-04-02', name: '<教外>円の中心と直線との距離・共有点／半径がわかっている' },
                            { id: '36-04-04-03', name: '<教外>数直線上を動く円と直線の位置関係・共有点の数' }
                        ]
                    },
                    {
                        id: '36-04-05', name: '<教外>円に外接する四角形', details: [
                            { id: '36-04-05-01', name: '<教外>外接する台形の面積を求める' },
                            { id: '36-04-05-02', name: '<教外>外接する四角形の頂点と円の中心を結んだ角の大きさ' }
                        ]
                    },
                    {
                        id: '36-04-06', name: '<教外>三角形の内心と内接円', details: [
                            { id: '36-04-06-01', name: '<教外>三角形の内心／内心の性質の証明' },
                            { id: '36-04-06-02', name: '<教外>三角形の内心／作図(内接円)' },
                            { id: '36-04-06-03', name: '<教外>三角形の内心／三角形の内心と角について証明' },
                            { id: '36-04-06-04', name: '<教外>三角形の内心／角の大きさを求める' },
                            { id: '36-04-06-05', name: '<教外>三角形の内心／内心を通る平行線の性質について証明' }
                        ]
                    },
                    {
                        id: '36-04-07', name: '<教外>三角形の外心と内心', details: [
                            { id: '36-04-07-01', name: '<教外>三角形の外心と内心／角の大きさを求める' },
                            { id: '36-04-07-02', name: '<教外>三角形の内心と３辺について対称な点を結んでできる三角形' }
                        ]
                    }
                ]
            },
            {
                id: '36-05', name: '<教外>2つの円', children: [
                    {
                        id: '36-05-01', name: '<教外>2つの円の位置関係', details: [
                            { id: '36-05-01-01', name: '<教外>2つの円の位置関係／半径ｒ,ｒ\'と中心間の距離ｄの関係' },
                            { id: '36-05-01-02', name: '<教外>2つの円の位置関係／中心間の距離がきまっている' },
                            { id: '36-05-01-03', name: '<教外>2つの円の位置関係／2つの円の半径がきまっている' },
                            { id: '36-05-01-04', name: '<教外>2つの円の位置関係／半径ｒ,ｒ\'と中心間の距離ｄの値' },
                            { id: '36-05-01-05', name: '<教外>2つの円の位置関係／半径ｒの値の範囲を求める' },
                            { id: '36-05-01-06', name: '<教外>2つの円の位置関係／中心間の距離ｄの値の範囲を求める' },
                            { id: '36-05-01-07', name: '<教外>2つの円の位置関係／外接・内接するとき２円の半径' }
                        ]
                    },
                    {
                        id: '36-05-02', name: '<教外>2つの円と中心線', details: [
                            { id: '36-05-02-01', name: '<教外>2つの円の接点は中心線上にあることの証明' },
                            { id: '36-05-02-02', name: '<教外>2つの円に共通な弦は中心線に２等分されることの証明' }
                        ]
                    },
                    {
                        id: '36-05-03', name: '<教外>互いに接する円', details: [
                            { id: '36-05-03-01', name: '<教外>作図／互いに接する３つの円' },
                            { id: '36-05-03-02', name: '<教外>接する３つの円の半径や中心間の距離を求める' }
                        ]
                    },
                    {
                        id: '36-05-04', name: '<教外>2つの円の共通接線', details: [
                            { id: '36-05-04-01', name: '<教外>2つの円の共通接線／位置関係から共通接線の数を求める' },
                            { id: '36-05-04-02', name: '<教外>2つの円の共通接線／半径と中心間の距離から共通接線の数' },
                            { id: '36-05-04-03', name: '<教外>2つの円の共通接線／共通外接線や共通内接線について証明' },
                            { id: '36-05-04-04', name: '<教外>2つの円の共通接線／接する２円の接線の長さについて証明' },
                            { id: '36-05-04-05', name: '<教外>2つの円の共通接線／接する２円の接線の長さや角の証明' },
                            { id: '36-05-04-06', name: '<教外>2つの円の共通接線／角の大きさを求める' }
                        ]
                    },
                    {
                        id: '36-05-05', name: '<教外>共通接線と中心線', details: [
                            { id: '36-05-05-01', name: '<教外>共通接線と中心線／線分の長さを求める(三角形の相似)' }
                        ]
                    }
                ]
            },
            {
                id: '36-06', name: '<教外・発>円に内接する四角形', children: [
                    {
                        id: '36-06-01', name: '<教外・発>円に内接する四角形の性質', details: [
                            { id: '36-06-01-01', name: '<教外>円に内接する四角形の性質の証明／中心角と円周角' },
                            { id: '36-06-01-02', name: '<教外>円に内接する四角形の性質の証明／対角線をひいて' },
                            { id: '36-06-01-03', name: '<教外>円に内接する四角形の性質／三角形の相似の証明' },
                            { id: '36-06-01-04', name: '<教外>円に内接する四角形の性質／相似より線分の長さを求める' },
                            { id: '36-06-01-05', name: '<教外>円に内接する四角形の性質／相似・線分の長さの証明' },
                            { id: '36-06-01-06', name: '<教外>円に内接する四角形の性質／二等辺三角形である証明' },
                            { id: '36-06-01-07', name: '<教外>円に内接する四角形の性質／角の大きさを求める' },
                            { id: '36-06-01-08', name: '<教外>円に内接する四角形の性質／角の大きさ(三角形の外角)' },
                            { id: '36-06-01-09', name: '<教外>円に内接する四角形の性質／角の大きさ(方程式をつくる)' },
                            { id: '36-06-01-10', name: '<教外>円に内接する四角形の性質／角の大きさ(円周角)' },
                            { id: '36-06-01-11', name: '<教外>円に内接する四角形の性質／内接するときの角の大きさ' },
                            { id: '36-06-01-12', name: '<教外>円に内接する四角形の性質／内接するときの角度(円周角)' }
                        ]
                    },
                    {
                        id: '36-06-02', name: '<教外>四角形が円に内接する条件', details: [
                            { id: '36-06-02-01', name: '<教外>四角形が円に内接する条件の証明' },
                            { id: '36-06-02-02', name: '<教外>四角形が円に内接するものを選ぶ' },
                            { id: '36-06-02-03', name: '<教外>四角形が円に内接するものを選ぶ／円周角の定理の逆' },
                            { id: '36-06-02-04', name: '<教外>四角形が円に内接する証明／平行線の性質を使う' },
                            { id: '36-06-02-05', name: '<教外>四角形が円に内接する証明／垂線をひいた図について' },
                            { id: '36-06-02-06', name: '<教外>四角形が円に内接する証明／円周角の定理を使う' },
                            { id: '36-06-02-07', name: '<教外>四角形が円に内接する証明／角の大きさを求めて' }
                        ]
                    },
                    {
                        id: '36-06-03', name: '<教外>円に内接する平行四辺形', details: [
                            { id: '36-06-03-01', name: '<教外>円に内接する平行四辺形について' }
                        ]
                    }
                ]
            },
            {
                id: '36-07', name: '<教外・発>接線と弦のつくる角', children: [
                    {
                        id: '36-07-01', name: '<教外・発>接線と弦のつくる角', details: [
                            { id: '36-07-01-01', name: '<教発>接線と弦のつくる角の定理の証明' },
                            { id: '36-07-01-02', name: '<教発>接線と弦のつくる角／角の大きさを求める' },
                            { id: '36-07-01-03', name: '<教発>接線と弦のつくる角／角の大きさを求める(接線の性質)' },
                            { id: '36-07-01-04', name: '<教発>接線と弦のつくる角／角の大きさを求める(円周角)' },
                            { id: '36-07-01-05', name: '<教発>接線と弦のつくる角／角の大きさを求める(円周角・外角)' },
                            { id: '36-07-01-06', name: '<教外>接線と弦のつくる角／角の大きさを求める(内接する四角形)' },
                            { id: '36-07-01-07', name: '<教外>接線と弦のつくる角／角の大きさを求める(複数定理)' },
                            { id: '36-07-01-08', name: '<教外>接線と弦のつくる角の定理の利用／三角形の相似の証明' },
                            { id: '36-07-01-09', name: '<教外>接線と弦のつくる角の定理の利用／相似より線分の長さ' },
                            { id: '36-07-01-10', name: '<教外>接線と弦のつくる角の定理の利用／相似・線分の長さの証明' },
                            { id: '36-07-01-11', name: '<教外>接線と弦のつくる角の定理の利用／証明・線分の長さ' },
                            { id: '36-07-01-12', name: '<教外>接線と弦のつくる角の定理の利用／相似の証明(複数定理)' },
                            { id: '36-07-01-13', name: '<教外>接線と弦のつくる角の定理の利用／平行より相似の証明' },
                            { id: '36-07-01-14', name: '<教外>接線と弦のつくる角の定理の利用／二等辺三角形の証明①' },
                            { id: '36-07-01-15', name: '<教外>接線と弦のつくる角の定理ের利用／二等辺三角形の証明②' },
                            { id: '36-07-01-16', name: '<教外>接線と弦のつくる角の定理の利用／二等辺三角形の証明③' }
                        ]
                    }
                ]
            },
            {
                id: '36-08', name: '<教外>2つの円といろいろな定理', children: [
                    {
                        id: '36-08-01', name: '<教外>交わる２円といろいろな定理', details: [
                            { id: '36-08-01-01', name: '<教外>交わる２円について／三角形の相似の証明(内接する四角形)' },
                            { id: '36-08-01-02', name: '<教外>交わる２円について／三角形の相似の証明(複数定理)' },
                            { id: '36-08-01-03', name: '<教外>交わる２円について／二等辺三角形である証明(円周角)' },
                            { id: '36-08-01-04', name: '<教外>交わる２円について／二等辺三角形である証明(複数定理)' },
                            { id: '36-08-01-05', name: '<教外>交わる２円について／四角形が円に内接する証明' },
                            { id: '36-08-01-06', name: '<教外>交わる２円について／四角形が円に内接する証明(複数定理)' },
                            { id: '36-08-01-07', name: '<教外>交わる２円について／平行になる証明(円に内接する四角形)' },
                            { id: '36-08-01-08', name: '<教外>交わる２円について／平行になる証明(複数定理)' },
                            { id: '36-08-01-09', name: '<教外>交わる２円について／角の大きさ(円に内接する四角形)' },
                            { id: '36-08-01-10', name: '<教外>交わる２円について／角の大きさを求める(複数の定理)' }
                        ]
                    },
                    {
                        id: '36-08-02', name: '<教外>接する２円といろいろな定理', details: [
                            { id: '36-08-02-01', name: '<教外>接する２円について／平行の証明(外接する２円)' },
                            { id: '36-08-02-02', name: '<教外>接する２円について／平行の証明(内接する２円)' },
                            { id: '36-08-02-03', name: '<教外>接する２円について／角の証明(外接する２円)' },
                            { id: '36-08-02-04', name: '<教外>接する２円について／角の証明(内接する２円)' },
                            { id: '36-08-02-05', name: '<教外>接する２円について／角の大きさを求める(外接する２円)' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '37', name: '三平方の定理', children: [
            {
                id: '37-01', name: '三平方の定理', children: [
                    {
                        id: '37-01-01', name: '三平方の定理の証明', details: [
                            { id: '37-01-01-01', name: '三平方の定理の証明／大きい正方形の面積を2通りの式で表す' },
                            { id: '37-01-01-02', name: '三平方の定理の証明／台形の面積を2通りの式で表す' },
                            { id: '37-01-01-03', name: '三平方の定理の証明／相似比を使って証明する' },
                            { id: '37-01-01-04', name: '三平方の定理の証明／合同を使って証明する' }
                        ]
                    },
                    {
                        id: '37-01-02', name: '三平方の定理', details: [
                            { id: '37-01-02-01', name: '直角三角形の辺の長さを求める' },
                            { id: '37-01-02-02', name: '直角三角形の辺の長さ(2通り)を求める' },
                            { id: '37-01-02-03', name: '直角三角形の斜辺と周の長さより、辺の長さを求める' },
                            { id: '37-01-02-04', name: '直角三角形の3辺の長さを文字で表し、辺の長さを求める' },
                            { id: '37-01-02-05', name: '直角三角形の3辺を1辺の長さとする正方形の面積' }
                        ]
                    },
                    {
                        id: '37-01-03', name: '三平方の定理の逆', details: [
                            { id: '37-01-03-01', name: '三平方の定理の逆より、直角三角形になるかどうかを調べる' },
                            { id: '37-01-03-02', name: '作図／正方形の面積(和・差)と等積の正方形の1辺の長さ' }
                        ]
                    }
                ]
            },
            {
                id: '37-02', name: '三平方の定理の利用／平面図形', children: [
                    {
                        id: '37-02-01', name: '三角形', details: [
                            { id: '37-02-01-01', name: '三平方の定理の利用／直角三角形の面積を求める' },
                            { id: '37-02-01-02', name: '三平方の定理の利用／二等辺三角形の高さ・面積を求める' },
                            { id: '37-02-01-03', name: '三平方の定理の利用／辺の長さを求める(三平方の定理 2回)' },
                            { id: '37-02-01-04', name: '三平方の定理の利用／直角三角形の斜辺への垂線の長さ(面積より)' },
                            { id: '37-02-01-05', name: '三平方の定理の利用／直角三角形の辺の長さを求める(相似を利用)' },
                            { id: '37-02-01-06', name: '三平方の定理の利用／直角三角形の高さ・面積(方程式利用)' },
                            { id: '37-02-01-07', name: '三平方の定理の利用／つながる直角三角形の面積(相似利用)' },
                            { id: '37-02-01-08', name: '三平方の定理の利用／高さ1の直角三角形をつなげた図(√xの長さ)' },
                            { id: '37-02-01-09', name: '三平方の定理の利用／高さ1の平行線と円弧から(√xの長さ)' }
                        ]
                    },
                    {
                        id: '37-02-02', name: '特別な3辺の比をもつ直角三角形', details: [
                            { id: '37-02-02-01', name: '特別な3辺の比をもつ直角三角形／辺の長さを求める' },
                            { id: '37-02-02-02', name: '特別な3辺の比をもつ直角三角形／鈍角三角形の辺の長さ(補助線)' },
                            { id: '37-02-02-03', name: '特別な3辺の比をもつ直角三角形／正方形の対角線から1辺の長さ' },
                            { id: '37-02-02-04', name: '特別な3辺の比をもつ直角三角形／面積を求める' },
                            { id: '37-02-02-05', name: '特別な3辺の比をもつ直角三角形／鈍角三角形の面積(補助線)' },
                            { id: '37-02-02-06', name: '特別な3辺の比をもつ直角三角形／台形・平行四辺形等の面積' },
                            { id: '37-02-02-07', name: '特別な3辺の比をもつ直角三角形／正多角形の面積(補助線)' },
                            { id: '37-02-02-08', name: '特別な3辺の比をもつ直角三角形／正八角形の面積(正方形から)' }
                        ]
                    },
                    {
                        id: '37-02-03', name: '四角形・多角形', details: [
                            { id: '37-02-03-01', name: '三平方の定理の利用／長方形の対角線，辺の長さを求める' },
                            { id: '37-02-03-02', name: '三平方の定理の利用／長方形等の辺の長さを求める(方程式の利用)' },
                            { id: '37-02-03-03', name: '三平方の定理の利用／ひし形の対角線，辺の長さを求める' },
                            { id: '37-02-03-04', name: '三平方の定理の利用／四角形・五角形の辺の長さを求める(補助線)' },
                            { id: '37-02-03-05', name: '三平方の定理の利用／四角形・五角形の面積を求める(補助線)' },
                            { id: '37-02-03-06', name: '三平方の定理の利用／正方形と交わる線分からなる三角形の面積' },
                            { id: '37-02-03-07', name: '三平方の定理の利用／直角を挟む辺を1辺とする正三角形(相似利用)' },
                            { id: '37-02-03-08', name: '三平方の定理の利用／四角形の辺上を2点が動くときの線分の長さ' },
                            { id: '37-02-03-09', name: '三平方の定理の利用／紙を折返したときの線分の長さ(方程式利用)' },
                            { id: '37-02-03-10', name: '三平方の定理の利用／紙を折返したときの線分の長さ(合同，方程式)' },
                            { id: '37-02-03-11', name: '三平方の定理の利用／相似を利用して線分の長さを求める' },
                            { id: '37-02-03-12', name: '三平方の定理の利用／相似を利用して面積を求める' }
                        ]
                    },
                    {
                        id: '37-02-04', name: '三角形・四角形／証明', details: [
                            { id: '37-02-04-01', name: '三平方の定理の利用／三角形や四角形の線分について等式の証明' },
                            { id: '37-02-04-02', name: '三平方の定理の利用／面積に関する等式の証明' },
                            { id: '37-02-04-03', name: '三平方の定理の利用／直角三角形になる証明' },
                            { id: '37-02-04-04', name: '三平方の定理の利用／直角三角形になる証明(3辺の長さが文字)' }
                        ]
                    },
                    {
                        id: '37-02-05', name: '座標平面', details: [
                            { id: '37-02-05-01', name: '三平方の定理の利用／座標上の2点間の距離を求める' },
                            { id: '37-02-05-02', name: '三平方の定理の利用／座標上の3点でできる三角形' },
                            { id: '37-02-05-03', name: '三平方の定理の利用／座標上の3点でできる三角形の面積' },
                            { id: '37-02-05-04', name: '三平方の定理の利用／座標上の3点でできる三角形(中点連結定理)' },
                            { id: '37-02-05-05', name: '三平方の定理の利用／座標上の3点が頂点となる平行四辺形' },
                            { id: '37-02-05-06', name: '三平方の定理の利用／座標上の AP+BP の最短距離' },
                            { id: '37-02-05-07', name: '三平方の定理の利用／x軸， y=ax上の点からなる二等辺三角形' },
                            { id: '37-02-05-08', name: '三平方の定理の利用／原点と直線の距離(面積から)' },
                            { id: '37-02-05-09', name: '三平方の定理の利用／放物線と直線の交点間の長さ(直線の式含む)' }
                        ]
                    },
                    {
                        id: '37-02-06', name: '円／接線・弦', details: [
                            { id: '37-02-06-01', name: '三平方の定理の利用／円の中心から弦までの長さ，弦の長さ' },
                            { id: '37-02-06-02', name: '三平方の定理の利用／円の中心から弦までの長さ,弦の長さ(方程式)' },
                            { id: '37-02-06-03', name: '三平方の定理の利用／円周角を利用して円周角60°の弦の長さ' },
                            { id: '37-02-06-04', name: '三平方の定理の利用／1つの頂点が円周上にある三角形がつくる弦' },
                            { id: '37-02-06-05', name: '三平方の定理の利用／接線，半径等の長さを求める／円と三角形' },
                            { id: '37-02-06-06', name: '三平方の定理の利用／接線等を利用して線分の長さ／重なる半円' },
                            { id: '37-02-06-07', name: '<教外>三平方の定理の利用／接弦定理などを使って辺の長さ' },
                            { id: '37-02-06-08', name: '<教発>三平方の定理の利用／共通外接線・共通内接線の長さの利用' }
                        ]
                    },
                    {
                        id: '37-02-07', name: '円／内接・外接する図形', details: [
                            { id: '37-02-07-01', name: '<教発>三平方の定理の利用／直角三角形に内接する円の半径や辺' },
                            { id: '37-02-07-02', name: '三平方の定理の利用／三角形に内接する円の半径(面積から)' },
                            { id: '37-02-07-03', name: '三平方の定理の利用／四角形に内接する半円の直径や辺の長さ' },
                            { id: '37-02-07-04', name: '三平方の定理の利用／おうぎ形に内接する円の半径' },
                            { id: '37-02-07-05', name: '<教外>三平方の定理の利用／さまざまな図形に内接する複数の円' },
                            { id: '37-02-07-06', name: '三平方の定理の利用／三角形が内接する円の半径(中心角から)' },
                            { id: '37-02-07-07', name: '三平方の定理の利用／三角形が内接する円の半径や三角形の辺' },
                            { id: '37-02-07-08', name: '<教外>三平方の定理の利用／円が内接・外接する正三角形の面積' },
                            { id: '37-02-07-09', name: '三平方の定理の利用／3頂点が円周上にある平行四辺形の面積' },
                            { id: '37-02-07-10', name: '三平方の定理の利用／正方形とおうぎ形の重なる部分の面積' },
                            { id: '37-02-07-11', name: '三平方の定理の利用／2つの円の重なる部分の面積' },
                            { id: '37-02-07-12', name: '<教外>三平方の定理の利用／外接する2円と共通接線の間の面積' },
                            { id: '37-02-07-13', name: '三平方の定理の利用／円に内接する図形と面積' }
                        ]
                    },
                    {
                        id: '37-02-08', name: '転がる図形', details: [
                            { id: '37-02-08-01', name: '三平方の定理の利用／三角形・四角形が直線上を転がるときの面積' }
                        ]
                    }
                ]
            },
            {
                id: '37-03', name: '三平方の定理の利用／空間図形', children: [
                    {
                        id: '37-03-01', name: '直方体・立方体', details: [
                            { id: '37-03-01-01', name: '三平方の定理の利用／直方体・立方体の対角線の長さ' },
                            { id: '37-03-01-02', name: '三平方の定理の利用／直方体・立方体の対角線に下ろした垂線' },
                            { id: '37-03-01-03', name: '三平方の定理の利用／立方体の対角線の長さから体積を求める' },
                            { id: '37-03-01-04', name: '三平方の定理の利用／直方体・立方体の2点間の距離' },
                            { id: '37-03-01-05', name: '三平方の定理の利用／直方体・立方体の2点間の距離(動点)' },
                            { id: '37-03-01-06', name: '三平方の定理の利用／直方体・立方体の切断面の面積(三角形)' },
                            { id: '37-03-01-07', name: '三平方の定理の利用／直方体・立方体の切断面の面積(多角形)' },
                            { id: '37-03-01-08', name: '三平方の定理の利用／直方体・立方体の切断と体積(角を含む切断)' },
                            { id: '37-03-01-09', name: '三平方の定理の利用／立方体の切断と体積(切断面が多角形)' },
                            { id: '37-03-01-10', name: '三平方の定理の利用／立方体の切断と体積(三角錐台，体積比)' }
                        ]
                    },
                    {
                        id: '37-03-02', name: '角錐', details: [
                            { id: '37-03-02-01', name: '三平方の定理の利用／四角錐の体積・表面積を求める' },
                            { id: '37-03-02-02', name: '三平方の定理の利用／四角錐の体積・表面積を求める(展開図)' },
                            { id: '37-03-02-03', name: '三平方の定理の利用／正四面体の高さと体積を求める' },
                            { id: '37-03-02-04', name: '三平方の定理の利用／四角錐の高さと体積を求める(展開図)' },
                            { id: '37-03-02-05', name: '三平方の定理の利用／正四角錐の切断面の面積を求める' },
                            { id: '37-03-02-06', name: '三平方の定理の利用／三角錐の切断と体積' },
                            { id: '37-03-02-07', name: '三平方の定理の利用／正四角錐の切断(角錐台)と体積(相似比より)' }
                        ]
                    },
                    {
                        id: '37-03-03', name: '円錐', details: [
                            { id: '37-03-03-01', name: '三平方の定理の利用／円錐の高さや母線の長さを求める' },
                            { id: '37-03-03-02', name: '三平方の定理の利用／円錐の体積を求める' },
                            { id: '37-03-03-03', name: '三平方の定理の利用／円錐の母線・表面積を求める(見取図)' },
                            { id: '37-03-03-04', name: '三平方の定理の利用／円錐の高さと体積を求める(展開図)' },
                            { id: '37-03-03-05', name: '三平方の定理の利用／円錐の底面の半径と体積を求める(展開図)' },
                            { id: '37-03-03-06', name: '三平方の定理の利用／円錐の切断(円錐台)と体積(相似比と体積比)' },
                            { id: '37-03-03-07', name: '三平方の定理の利用／回転体の体積を求める(円錐)' },
                            { id: '37-03-03-08', name: '三平方の定理の利用／回転体の体積を求める(円錐と円柱)' },
                            { id: '37-03-03-09', name: '三平方の定理の利用／回転体(円錐台)の体積(相似比と体積比)' }
                        ]
                    },
                    {
                        id: '37-03-04', name: '立体の面上の最短距離', details: [
                            { id: '37-03-04-01', name: '三平方の定理の利用／直方体・立方体の最短距離を求める' },
                            { id: '37-03-04-02', name: '三平方の定理の利用／直方体・立方体の最短距離と三角形の面積' },
                            { id: '37-03-04-03', name: '三平方の定理の利用／四角錐の最短距離を求める' },
                            { id: '37-03-04-04', name: '三平方の定理の利用／円錐の最短距離を求める' },
                            { id: '37-03-04-05', name: '三平方の定理の利用／三角錐の最短距離・切断した体積を求める' }
                        ]
                    },
                    {
                        id: '37-03-05', name: '球', details: [
                            { id: '37-03-05-01', name: '三平方の定理の利用／球の切り口の半径を求める' },
                            { id: '37-03-05-02', name: '三平方の定理の利用／球の切り口の円の面積を求める' },
                            { id: '37-03-05-03', name: '三平方の定理の利用／球の切り口より球の半径を求める' },
                            { id: '37-03-05-04', name: '三平方の定理の利用／球の切り口の面積より球の体積と表面積' }
                        ]
                    },
                    {
                        id: '37-03-06', name: '球と組み合わせた立体', details: [
                            { id: '37-03-06-01', name: '三平方の定理の利用／半球と円錐を組み合わせた立体の体積・表面積' },
                            { id: '37-03-06-02', name: '三平方の定理の利用／半球と円錐を組み合わせた回転体の体積・表面積' },
                            { id: '37-03-06-03', name: '三平方の定理の利用／球に内接する円錐の底面の半径・体積比' },
                            { id: '37-03-06-04', name: '三平方の定理の利用／球に内接する立方体の1辺の長さ' },
                            { id: '37-03-06-05', name: '三平方の定理の利用／円柱の底面の中心が球の中心と同じ立体' },
                            { id: '37-03-06-06', name: '三平方の定理の利用／円錐に内接する球の半径・体積' },
                            { id: '37-03-06-07', name: '三平方の定理の利用／円錐台に内接する球の半径' },
                            { id: '37-03-06-08', name: '三平方の定理の利用／角錐に内接する球の半径・体積' },
                            { id: '37-03-06-09', name: '三平方の定理の利用／正四面体と球' },
                            { id: '37-03-06-10', name: '三平方の定理の利用／柱体に内接する2つの球について' }
                        ]
                    }
                ]
            },
            {
                id: '37-04', name: '三平方の定理の利用／身近なことがら', children: [
                    {
                        id: '37-04-01', name: '身近なことがら', details: [
                            { id: '37-04-01-01', name: '三平方の定理の利用／身近なことがらを三平方の定理から求める' }
                        ]
                    }
                ]
            }
        ]
    },
    {
        id: '38', name: '標本調査', children: [
            {
                id: '38-01', name: '標本調査', children: [
                    {
                        id: '38-01-01', name: '全数調査と標本調査', details: [
                            { id: '38-01-01-01', name: '全数調査と標本調査について／穴埋め問題' },
                            { id: '38-01-01-02', name: '標本調査について' },
                            { id: '38-01-01-03', name: '標本の選び方として適切なもの' },
                            { id: '38-01-01-04', name: '全数調査と標本調査のどちらが適しているか' }
                        ]
                    },
                    {
                        id: '38-01-02', name: '標本調査の利用', details: [
                            { id: '38-01-02-01', name: '標本平均を求める' },
                            { id: '38-01-02-02', name: '標本の大きさと箱ひげ図' },
                            { id: '38-01-02-03', name: '母集団における特定の種類の個数を推測' },
                            { id: '38-01-02-04', name: '母集団における特定の種類の個数を推測／２種類' },
                            { id: '38-01-02-05', name: '母集団の大きさを推測／目印をつける' },
                            { id: '38-01-02-06', name: '母集団の大きさを推測／別の種類を追加' },
                            { id: '38-01-02-07', name: '特定の種類の個数より，母集団の大きさを推測' },
                            { id: '38-01-02-08', name: '特定の種類の個数より，母集団に対する割合' }
                        ]
                    }
                ]
            }
        ]
    }
];

type DiffType = '基礎' | '基本' | '標準' | '応用' | '発展';
type ClassLevel = '大' | '中' | '小' | '細';
interface DiffSelection { diff: DiffType; count: number; }
interface SelectedCategory { categoryId: string; categoryName: string; diff: DiffType; weaknessMode: boolean; questionCount: number; classLevel?: ClassLevel; diffSelections?: DiffSelection[]; }

export default function CreateTestPage() {
    const router = useRouter();
    const searchParams = useSearchParams();
    const mode = searchParams.get('mode');

    // ... Existing state ...
    const [selectedGrade, setSelectedGrade] = useState('j1');
    const [selectedSubject, setSelectedSubject] = useState('math');
    const [expandedNodes, setExpandedNodes] = useState<Set<string>>(new Set(['11', '11-01', '11-01-01']));
    const [previewCategoryId, setPreviewCategoryId] = useState<string | null>(null);
    const [previewCategoryName, setPreviewCategoryName] = useState('');
    const [selectedDiff, setSelectedDiff] = useState<DiffType>('基本');
    const [weaknessMode, setWeaknessMode] = useState(false);

    // 分類レベル別モード用ステート
    const [selectionMode, setSelectionMode] = useState<'normal' | 'level'>('normal');
    const [levelPreviewId, setLevelPreviewId] = useState<string | null>(null);
    const [levelPreviewName, setLevelPreviewName] = useState('');
    const [levelPreviewLevel, setLevelPreviewLevel] = useState<ClassLevel>('大');
    const [levelDiffCounts, setLevelDiffCounts] = useState<{ foundation: number; basic: number; standard: number; applied: number; advanced: number } | null>(null);
    const [levelDiffInputs, setLevelDiffInputs] = useState<Record<DiffType, number>>({ '基礎': 0, '基本': 0, '標準': 0, '応用': 0, '発展': 0 });
    const [autoTestName, setAutoTestName] = useState(true);

    // Updated: Accept Review Questions
    const [reviewQuestions, setReviewQuestions] = useState<Question[]>([]);

    const [selectedCategories, setSelectedCategories] = useState<SelectedCategory[]>([]);
    const [testName, setTestName] = useState('無題のテスト');
    const [assignedStudentIds, setAssignedStudentIds] = useState<string[]>([]);
    const [showPrint, setShowPrint] = useState(false);
    const [printQuestions, setPrintQuestions] = useState<Question[]>([]);
    const [showAssignModal, setShowAssignModal] = useState(false);

    // 新しく追加: APIから取得するデータ用のステート
    const [previewData, setPreviewData] = useState<{ foundation: Question | null; basic: Question | null; standard: Question | null; applied: Question | null; advanced: Question | null } | null>(null);
    const [difficultyCounts, setDifficultyCounts] = useState<{ foundation: number; basic: number; standard: number; applied: number; advanced: number } | null>(null);
    const [isLoadingPreview, setIsLoadingPreview] = useState(false);
    const [students, setStudents] = useState<Student[]>([]);

    // 生徒データを取得
    useEffect(() => {
        setStudents(getStudents());
    }, []);

    // カテゴリ選択時にデータを取得
    useEffect(() => {
        if (previewCategoryId) {
            setIsLoadingPreview(true);
            const p = getPreviewQuestions(previewCategoryId);
            const c = getDifficultyCount(previewCategoryId);
            setPreviewData(p);
            setDifficultyCounts(c);
            setIsLoadingPreview(false);
        } else {
            setPreviewData(null);
            setDifficultyCounts(null);
        }
    }, [previewCategoryId]);

    // Load Review Questions
    useEffect(() => {
        if (mode === 'review') {
            const stored = sessionStorage.getItem('review_questions');
            const studentName = sessionStorage.getItem('review_student_name');
            const originalTitle = sessionStorage.getItem('review_original_title');

            if (stored) {
                try {
                    const qs = JSON.parse(stored) as Question[];
                    setReviewQuestions(qs);

                    // Set Title
                    if (studentName && originalTitle) {
                        setTestName(`AI対策：${originalTitle}（${studentName}様）`);
                    }

                    // Automatically Select them
                    const mockCatId = 'review-generated';
                    setSelectedCategories([{
                        categoryId: mockCatId,
                        categoryName: '復習(AI生成)',
                        diff: '標準',
                        weaknessMode: true,
                        questionCount: qs.length
                    }]);
                } catch (e) {
                    console.error('Failed to parse review questions', e);
                }
            }
        }
    }, [mode]);

    // ...

    // Print Options state
    const [printOptions, setPrintOptions] = useState({
        question: true,
        answer: true,
        explanation: false,
        sheet: false
    });

    // 動的教科リスト
    const currentSubjects = useMemo(() => {
        const isHS = selectedGrade.startsWith('h');
        const isJH = selectedGrade.startsWith('j');
        const isElem = selectedGrade.startsWith('e');

        const list = [];
        if (isHS) {
            list.push(
                { id: 'math1', name: '数I', icon: '📐' }, { id: 'mathA', name: '数A', icon: '📐' },
                { id: 'math2', name: '数II', icon: '📐' }, { id: 'mathB', name: '数B', icon: '📐' },
                { id: 'math3', name: '数III', icon: '📐' }, { id: 'mathC', name: '数C', icon: '📐' }
            );
        } else if (isElem) {
            list.push({ id: 'math', name: '算数', icon: '🔢' });
        } else {
            list.push({ id: 'math', name: '数学', icon: '📐' });
        }

        list.push({ id: 'english', name: '英語', icon: '🔤' });
        list.push({ id: 'japanese', name: '国語', icon: '📖' });
        list.push({ id: 'science', name: '理科', icon: '🔬' });

        if (isJH || isHS) {
            list.push(
                { id: 'history', name: '歴史', icon: '🏯' },
                { id: 'geography', name: '地理', icon: '🌏' },
                { id: 'civics', name: '公民', icon: '⚖️' }
            );
        } else {
            list.push({ id: 'social', name: '社会', icon: '🌍' });
        }
        return list;
    }, [selectedGrade]);

    // 教科選択リセット
    const handleGradeChange = (gid: string) => {
        setSelectedGrade(gid);
        setSelectedSubject(gid.startsWith('h') ? 'math1' : 'math');
    };

    const toggleExpand = (id: string) => setExpandedNodes(p => { const n = new Set(p); n.has(id) ? n.delete(id) : n.add(id); return n; });
    const selectCategory = (id: string, name: string) => { setPreviewCategoryId(id); setPreviewCategoryName(name); setSelectedDiff('基本'); setWeaknessMode(false); };

    // 分類レベル別モード: ノード選択ハンドラ
    const getNodeLevel = (id: string): ClassLevel => {
        const parts = id.split('-').length;
        if (parts === 1) return '大';
        if (parts === 2) return '中';
        if (parts === 3) return '小';
        return '細';
    };
    const selectLevelCategory = (id: string, name: string) => {
        setLevelPreviewId(id);
        setLevelPreviewName(name);
        setLevelPreviewLevel(getNodeLevel(id));
        const counts = getDifficultyCountByPrefix(id);
        setLevelDiffCounts(counts);
        setLevelDiffInputs({ '基礎': 0, '基本': 0, '標準': 0, '応用': 0, '発展': 0 });
    };

    // 学年と教科に基づいたカテゴリフィルタリング
    const filteredTreeData = useMemo(() => {
        // 現在、treeDataには数学のデータのみが含まれていると仮定
        if (selectedSubject !== 'math' && !['math1', 'mathA', 'math2', 'mathB', 'math3', 'mathC'].includes(selectedSubject)) {
            return [];
        }

        return treeData.filter(node => {
            const isJuniorHighCategory = ['1', '2', '3'].some(prefix => node.id.startsWith(prefix));

            // 無学年の場合は、それぞれの校種に対応するカテゴリのみを表示
            if (selectedGrade === 'j_all') return isJuniorHighCategory;
            if (selectedGrade === 'h_all') return !isJuniorHighCategory;

            // 各学年別
            if (selectedGrade === 'j1') return node.id.startsWith('1');
            if (selectedGrade === 'j2') return node.id.startsWith('2');
            if (selectedGrade === 'j3') return node.id.startsWith('3');

            return false;
        });
    }, [selectedGrade, selectedSubject]);

    const confirmCategory = () => {
        if (!previewCategoryId) return;
        const questions = getQuestionsByCategory(previewCategoryId);
        const available = questions.filter(q => q.diff === selectedDiff).length;
        const count = Math.min(2, available);
        setSelectedCategories(p => [...p.filter(c => !(c.categoryId === previewCategoryId && c.diff === selectedDiff)), { categoryId: previewCategoryId, categoryName: previewCategoryName, diff: selectedDiff, weaknessMode, questionCount: count }]);
        setPreviewCategoryId(null);
    };

    // 分類レベル別モード: 決定ハンドラ
    const confirmLevelCategory = () => {
        if (!levelPreviewId) return;
        const diffSelections: DiffSelection[] = [];
        const diffKeys: DiffType[] = ['基礎', '基本', '標準', '応用', '発展'];
        for (const d of diffKeys) {
            if (levelDiffInputs[d] > 0) {
                diffSelections.push({ diff: d, count: levelDiffInputs[d] });
            }
        }
        if (diffSelections.length === 0) return;
        const totalCount = diffSelections.reduce((s, d) => s + d.count, 0);
        const diffLabel = diffSelections.map(d => `${d.diff}${d.count}`).join('＋');
        const catName = `${levelPreviewName}(${levelPreviewLevel})`;
        // リストに追加。代表難易度は最初の選択を使用
        setSelectedCategories(p => [...p, {
            categoryId: levelPreviewId,
            categoryName: catName,
            diff: diffSelections[0].diff,
            weaknessMode: false,
            questionCount: totalCount,
            classLevel: levelPreviewLevel,
            diffSelections
        }]);
        // テスト名自動生成
        if (autoTestName) {
            setTestName(`${levelPreviewName}【${levelPreviewLevel}】${diffLabel}`);
        }
        setLevelPreviewId(null);
    };

    const getAllSelectedQuestions = useCallback((): Question[] => {
        if (reviewQuestions.length > 0 && selectedCategories.some(c => c.categoryId === 'review-generated')) {
            return reviewQuestions;
        }

        const r: Question[] = [];
        const pushQuestions = (qs: Question[], uniqueByQuestion: boolean) => {
            if (!uniqueByQuestion) {
                r.push(...qs);
                return;
            }
            const seen = new Set(r.map(q => q.question || ''));
            for (const q of qs) {
                const key = q.question || '';
                if (seen.has(key)) continue;
                seen.add(key);
                r.push(q);
            }
        };
        for (const c of selectedCategories) {
            if (c.diffSelections && c.diffSelections.length > 0) {
                // 分類レベル別モード: 各難易度からランダム抽出
                for (const ds of c.diffSelections) {
                    const qs = getRandomQuestionsByDifficulty(c.categoryId, ds.diff, ds.count);
                    const uniqueByQuestion = c.categoryId === '11-05-04-04';
                    pushQuestions(qs, uniqueByQuestion);
                }
            } else {
                // 通常モード: 各細分類から2問ランダム抽出
                const qs = getRandomQuestionsByDifficulty(c.categoryId, c.diff, c.questionCount);
                const uniqueByQuestion = c.categoryId === '11-05-04-04';
                pushQuestions(qs, uniqueByQuestion);
            }
        }
        return r;
    }, [selectedCategories, reviewQuestions]);

    // 難易度別の色設定 (Static classes to fix dynamic color issues)
    const diffStyles = {
        '基礎': { tag: 'Intro', label: '基礎', border: 'border-slate-500', bg: 'bg-slate-50', ring: 'ring-slate-200', text: 'text-slate-600', textDark: 'text-slate-800', bgDark: 'bg-slate-500', bgLight: 'bg-slate-50' },
        '基本': { tag: 'Basic', label: '基本', border: 'border-emerald-500', bg: 'bg-emerald-50', ring: 'ring-emerald-200', text: 'text-emerald-600', textDark: 'text-emerald-800', bgDark: 'bg-emerald-500', bgLight: 'bg-emerald-50' },
        '標準': { tag: 'Std', label: '標準', border: 'border-sky-500', bg: 'bg-sky-50', ring: 'ring-sky-200', text: 'text-sky-600', textDark: 'text-sky-800', bgDark: 'bg-sky-500', bgLight: 'bg-sky-50' },
        '応用': { tag: 'Appl', label: '応用', border: 'border-amber-500', bg: 'bg-amber-50', ring: 'ring-amber-200', text: 'text-amber-600', textDark: 'text-amber-800', bgDark: 'bg-amber-500', bgLight: 'bg-amber-50' },
        '発展': { tag: 'Adv', label: '発展', border: 'border-rose-500', bg: 'bg-rose-50', ring: 'ring-rose-200', text: 'text-rose-600', textDark: 'text-rose-800', bgDark: 'bg-rose-500', bgLight: 'bg-rose-50' },
    };

    // プレミアムデザインのHTML生成
    const testNameFontClass =
        testName.length >= 36 ? 'text-sm' :
            testName.length >= 28 ? 'text-base' :
                testName.length >= 20 ? 'text-lg' :
                    'text-xl';

    const generatePremiumHTML = useCallback((qs: Question[], type: 'question' | 'answer' | 'explanation' | 'sheet') => {
        const isSheet = type === 'sheet';
        const isAnswer = type === 'answer';
        const isExplanation = type === 'explanation';
        const isQuestion = type === 'question';

        const subtitle = isQuestion ? '' : isAnswer ? '（解答）' : isExplanation ? '（解説）' : '（答案用紙）';
        const printTitleFontSize =
            testName.length >= 36 ? 18 :
                testName.length >= 28 ? 20 :
                    testName.length >= 20 ? 22 : 26;

        let html = `
            <div class="print-page">
                <div class="sample-header">
                    <div class="sample-title" style="font-size: ${printTitleFontSize}px;">${testName}${subtitle}</div>
                </div>
        `;

        if (isSheet) {
            html += '<div class="answer-grid-container">';
            qs.forEach((q, i) => {
                const subMatch = q.question.match(/\(\d+\)|[①-⑩]/g);
                if (q.answerStyle === 'numberLine') {
                    html += `
                        <div class="sheet-question-row full-width">
                            <div class="sheet-label">[ ${i + 1} ]</div>
                            <div class="sheet-content">
                                <div class="sub-item" style="border-bottom: 0.5px dashed #ccc; padding-bottom: 15px; margin-bottom: 15px;">
                                    <div class="sub-label">(${i + 1}) ① &nbsp;数直線上に表しなさい。</div>
                                    <div class="number-line-box">${generateNumberLine({ min: -6, max: 6, labelInterval: 2, width: 620, height: 60 })}</div>
                                </div>
                                <div class="sub-item">
                                    <div class="sub-label">(${i + 1}) ② &nbsp;各点の値を答えなさい。</div>
                                    <div class="sub-answer-boxes">
                                        <div class="sub-answer-box"><div class="mini-label">①</div></div>
                                        <div class="sub-answer-box"><div class="mini-label">②</div></div>
                                        <div class="sub-answer-box"><div class="mini-label">③</div></div>
                                        <div class="sub-answer-box"><div class="mini-label">④</div></div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    `;
                } else if (subMatch) {
                    html += `
                        <div class="sheet-question-row">
                            <div class="sheet-label">[ ${i + 1} ]</div>
                            <div class="sheet-sub-grid">
                                ${subMatch.map(m => `
                                    <div class="sheet-sub-box">
                                        <div class="mini-label">${i + 1}${m}</div>
                                    </div>
                                `).join('')}
                            </div>
                        </div>
                    `;
                } else {
                    html += `
                        <div class="sheet-question-row">
                            <div class="sheet-label">[ ${i + 1} ]</div>
                            <div class="sheet-box"></div>
                        </div>
                    `;
                }
            });
            html += '</div>';
        } else {
            qs.forEach((q, i) => {
                if (isQuestion) {
                    html += `
                        <div class="sample-question">
                            <div class="sample-qbox">問</div>
                            <div class="sample-qbody">
                                <div class="sample-qtext">
                                    ${formatMath(q.question || '')}
                                </div>
                            </div>
                        </div>
                    `;
                } else if (isAnswer) {
                    html += `
                        <div class="sample-answer">
                            <div class="sample-abox">答</div>
                            <div class="sample-abody">
                                ${formatMath(q.answer || '')}
                            </div>
                        </div>
                    `;
                } else if (isExplanation) {
                    html += `
                        <div class="sample-explanation">
                            <div class="sample-ebox">解説</div>
                            <div class="sample-ebody">
                                ${formatMath(q.explanation || '')}
                            </div>
                        </div>
                    `;
                }
            });
        }

        html += '</div>';
        return html;
    }, [testName]);

    // 印刷プレビュー用の問題を固定
    useEffect(() => {
        if (!showPrint) return;
        setPrintQuestions(getAllSelectedQuestions());
    }, [showPrint, selectedCategories, reviewQuestions, getAllSelectedQuestions]);

    // 印刷処理
    const preparePrint = useCallback(() => {
        const qs = printQuestions.length > 0 ? printQuestions : getAllSelectedQuestions();
        if (qs.length === 0) { alert('問題未選択'); return; }
        if (!Object.values(printOptions).some(v => v)) { alert('印刷内容未選択'); return; }

        sessionStorage.setItem('grading_target_questions', JSON.stringify(qs));
        sessionStorage.setItem('grading_test_title', testName);
        sessionStorage.setItem('grading_test_date', new Date().toLocaleDateString('ja-JP'));

        const c = document.getElementById('print-area'); if (!c) return;

        let h = `
            <style>
                @media print {
                    body { margin: 0; padding: 0; }
                    #print-area { display: block !important; width: 210mm; }
                    .print-page { 
                        width: 210mm; 
                        padding: 15mm 20mm; 
                        page-break-after: always; 
                        box-sizing: border-box;
                        font-family: 'Sawarabi Mincho', serif;
                    }
                    .print-page:last-child { page-break-after: auto; }
                }
                .sample-header {
                    border-bottom: 2px solid #000;
                    padding: 6px 0 8px;
                    margin-bottom: 18px;
                }
                .sample-title {
                    font-weight: bold;
                    letter-spacing: 1px;
                    font-family: 'Sawarabi Mincho', serif;
                }
                .sample-question {
                    display: flex;
                    gap: 10px;
                    margin-bottom: 18px;
                    font-size: 15px;
                }
                .sample-qbox {
                    width: 28px;
                    height: 28px;
                    border: 1px solid #000;
                    display: flex;
                    align-items: center;
                    justify-content: center;
                    font-weight: bold;
                    flex-shrink: 0;
                }
                .sample-qbody { flex: 1; }
                .sample-qtext { line-height: 1.8; }
                .sample-answer,
                .sample-explanation {
                    display: flex;
                    gap: 10px;
                    margin-bottom: 12px;
                    font-size: 14px;
                }
                .sample-abox,
                .sample-ebox {
                    width: 28px;
                    height: 28px;
                    border: 1px solid #000;
                    display: flex;
                    align-items: center;
                    justify-content: center;
                    font-weight: bold;
                    flex-shrink: 0;
                }
                .sample-abody,
                .sample-ebody { line-height: 1.7; }
                .answer-grid-container {
                    display: grid;
                    grid-template-columns: 1fr 1fr;
                    gap: 20px;
                }
                .sheet-question-row {
                    border: 1px solid #000;
                    padding: 10px;
                    display: flex;
                    flex-direction: column;
                    min-height: 100px;
                }
                .sheet-question-row.full-width {
                    grid-column: span 2;
                }
                .sheet-label {
                    font-weight: bold;
                    font-size: 14px;
                    margin-bottom: 5px;
                }
                .sheet-box { flex-grow: 1; }
                .sheet-sub-grid {
                    display: grid;
                    grid-template-columns: 1fr 1fr;
                    gap: 8px;
                    flex-grow: 1;
                }
                .sheet-sub-box {
                    border: 1px dashed #ccc;
                    height: 40px;
                    position: relative;
                }
                .mini-label {
                    font-size: 10px;
                    position: absolute;
                    top: 2px;
                    left: 2px;
                    color: #666;
                }
                .sub-item { margin-bottom: 20px; }
                .sub-label { font-weight: bold; margin-bottom: 5px; }
                .sub-answer-boxes { display: flex; gap: 10px; }
                .sub-answer-box { border: 1px solid #000; width: 60px; height: 40px; position: relative; }
                .number-line-box { text-align: center; padding: 10px 0; border: 1px solid #eee; }
            </style>
        `;

        if (printOptions.question) h += generatePremiumHTML(qs, 'question');
        if (printOptions.answer) h += generatePremiumHTML(qs, 'answer');
        if (printOptions.explanation) h += generatePremiumHTML(qs, 'explanation');
        if (printOptions.sheet) h += generatePremiumHTML(qs, 'sheet');

        c.innerHTML = h;
        window.print();
    }, [printOptions, printQuestions, getAllSelectedQuestions, testName, generatePremiumHTML]);

    // Recursive Tree Renderer with Animation and Styling
    const renderTree = (nodes: any[], depth = 0) => (
        <div className={`transition-all duration-300 ease-out ${depth > 0 ? '' : ''}`} style={depth > 0 ? { marginLeft: `${depth}em` } : {}}>
            {nodes.map(node => {
                const isExpanded = expandedNodes.has(node.id);
                // Check if terminal (no children array) or category container (L3 which has details)
                if (node.details) {
                    return (
                        <div key={node.id} className="mb-2">
                            <button onClick={() => toggleExpand(node.id)} className="flex items-center w-full p-2 rounded text-left font-bold text-stone-600 text-sm hover:bg-stone-50 transition-colors">
                                <span className={`mr-2 text-[10px] text-stone-400 transform transition-transform duration-200 ${isExpanded ? 'rotate-90' : ''}`}>▶</span>
                                {node.name}
                            </button>
                            {/* Accordion Content */}
                            <div className={`overflow-hidden transition-all duration-300 ease-in-out ${isExpanded ? 'max-h-[800px] opacity-100' : 'max-h-0 opacity-0'}`}>
                                <div className="ml-5 mt-1 space-y-1 border-l-2 border-stone-100 pl-2">
                                    {node.details.map((d: any) => {
                                        const has = getQuestionsByCategory(d.id).length > 0;
                                        const active = previewCategoryId === d.id;
                                        return (
                                            <button
                                                key={d.id}
                                                onClick={() => has && selectCategory(d.id, d.name)}
                                                className={`
                                                    w-full text-left py-2 px-3 rounded-md text-sm transition-all duration-200 flex items-center justify-between
                                                    ${active
                                                        ? 'bg-blue-50 text-blue-700 font-bold shadow-sm translate-x-2'
                                                        : has
                                                            ? 'text-blue-600 hover:bg-blue-50/50 hover:pl-4 font-medium'
                                                            : 'text-stone-300 cursor-not-allowed'}
                                                `}
                                            >
                                                <span>{d.name}</span>
                                                {active && <span className="animate-pulse">👉</span>}
                                            </button>
                                        );
                                    })}
                                </div>
                            </div>
                        </div>
                    );
                }

                if (node.children) {
                    return (
                        <div key={node.id} className="mb-2">
                            <button onClick={() => toggleExpand(node.id)} className="flex items-center w-full p-2 hover:bg-stone-100/50 rounded text-left font-bold text-stone-700 text-sm transition-all">
                                <span className={`mr-2 text-[10px] text-stone-400 transform transition-transform duration-200 ${isExpanded ? 'rotate-90' : ''}`}>▶</span>
                                {node.name}
                            </button>
                            <div className={`overflow-hidden transition-all duration-300 ease-in-out ${isExpanded ? 'max-h-[2000px] opacity-100' : 'max-h-0 opacity-0'}`}>
                                {renderTree(node.children, depth + 1)}
                            </div>
                        </div>
                    );
                }
                return null;
            })}
        </div>
    );

    // 分類レベル別モード用ツリーレンダラー（全ノードがクリック可能）
    const levelBadge: Record<string, { label: string; color: string }> = {
        '1': { label: '大', color: 'bg-red-100 text-red-700' },
        '2': { label: '中', color: 'bg-orange-100 text-orange-700' },
        '3': { label: '小', color: 'bg-sky-100 text-sky-700' },
        '4': { label: '細', color: 'bg-violet-100 text-violet-700' },
    };
    const renderLevelTree = (nodes: any[], depth = 0): React.ReactNode => (
        <div style={depth > 0 ? { marginLeft: `${depth * 0.8}em` } : {}}>
            {nodes.map((node: any) => {
                const isExpanded = expandedNodes.has(node.id);
                const parts = node.id.split('-').length;
                const badge = levelBadge[String(parts)] || levelBadge['4'];
                const isActive = levelPreviewId === node.id;
                const hasChildren = node.children || node.details;

                return (
                    <div key={node.id} className="mb-1">
                        <div className="flex items-center gap-1">
                            {hasChildren && (
                                <button onClick={() => toggleExpand(node.id)} className="p-1 text-[10px] text-stone-400 hover:text-stone-600 shrink-0">
                                    <span className={`transform transition-transform duration-200 inline-block ${isExpanded ? 'rotate-90' : ''}`}>▶</span>
                                </button>
                            )}
                            <button
                                onClick={() => selectLevelCategory(node.id, node.name)}
                                className={`flex-1 text-left py-1.5 px-2 rounded-md text-sm transition-all flex items-center gap-2 ${isActive ? 'bg-indigo-50 text-indigo-700 font-bold shadow-sm ring-2 ring-indigo-200' : 'text-stone-700 hover:bg-stone-50 font-medium'}`}
                            >
                                <span className={`text-[9px] px-1.5 py-0.5 rounded font-bold shrink-0 ${badge.color}`}>{badge.label}</span>
                                <span className="truncate">{node.name}</span>
                                {isActive && <span className="ml-auto text-indigo-400 animate-pulse text-xs">◀</span>}
                            </button>
                        </div>
                        {hasChildren && (
                            <div className={`overflow-hidden transition-all duration-300 ${isExpanded ? 'max-h-[2000px] opacity-100' : 'max-h-0 opacity-0'}`}>
                                {node.children && renderLevelTree(node.children, depth + 1)}
                                {node.details && (
                                    <div style={{ marginLeft: `${(depth + 1) * 0.8}em` }}>
                                        {node.details.map((d: any) => {
                                            const dActive = levelPreviewId === d.id;
                                            return (
                                                <div key={d.id} className="mb-0.5">
                                                    <button
                                                        onClick={() => selectLevelCategory(d.id, d.name)}
                                                        className={`w-full text-left py-1.5 px-2 rounded-md text-sm transition-all flex items-center gap-2 ${dActive ? 'bg-indigo-50 text-indigo-700 font-bold shadow-sm ring-2 ring-indigo-200' : 'text-stone-600 hover:bg-stone-50'}`}
                                                    >
                                                        <span className={`text-[9px] px-1.5 py-0.5 rounded font-bold shrink-0 ${levelBadge['4'].color}`}>細</span>
                                                        <span className="truncate">{d.name}</span>
                                                        {dActive && <span className="ml-auto text-indigo-400 animate-pulse text-xs">◀</span>}
                                                    </button>
                                                </div>
                                            );
                                        })}
                                    </div>
                                )}
                            </div>
                        )}
                    </div>
                );
            })}
        </div>
    );
    return (
        <>
            <div className="h-screen flex flex-col bg-stone-50 text-stone-900 font-sans">
                {/* Header */}
                <header className="bg-white border-b border-stone-200 px-6 py-4 flex justify-between items-center shadow-sm z-10">
                    <div className="flex items-center gap-6">
                        <button onClick={() => window.location.href = '/'} className="text-stone-400 hover:text-stone-600 font-bold text-xl shrink-0">← 教室に戻る</button>
                        <div className="flex flex-col">
                            <h1 className="text-xs font-bold text-stone-400 mb-1 tracking-widest uppercase">Test Wizard</h1>
                            <input
                                type="text"
                                value={testName}
                                onChange={(e) => { setTestName(e.target.value); setAutoTestName(false); }}
                                placeholder="テスト名を入力してください..."
                                className={`${testNameFontClass} font-bold text-blue-700 bg-transparent border-b-2 border-stone-100 hover:border-blue-200 focus:border-blue-500 focus:outline-none transition-all w-[400px]`}
                            />
                        </div>
                    </div>
                    <div className="flex items-center gap-3 min-w-0 flex-1 justify-end">
                        <div className="flex items-center gap-2 overflow-x-auto max-w-[60vw] px-2">
                            {selectedCategories.map((c, i) => {
                            const d = diffStyles[c.diff];
                            return (
                                <span key={i} className="px-3 py-1.5 rounded-full text-sm font-bold bg-white border border-stone-200 shadow-sm flex items-center gap-2 whitespace-nowrap">
                                    <span className={`w-3 h-3 rounded-full ${d.bgDark}`} />
                                    {c.diffSelections ? `${c.categoryName} ${c.diffSelections.map(ds => `${ds.diff}${ds.count}`).join('+')}` : `${c.categoryName}(${c.diff})`}
                                    <button onClick={() => setSelectedCategories(p => p.filter((_, x) => x !== i))} className="text-stone-400 hover:text-red-500 font-bold px-1 text-lg">✕</button>
                                </span>
                            );
                        })}
                        </div>
                        {selectedCategories.length > 0 && (
                            <div className="flex gap-2 shrink-0">
                                <button
                                    onClick={() => setShowAssignModal(true)}
                                    className={`px-4 py-2 rounded-lg font-bold border-2 transition-all flex items-center gap-2 ${assignedStudentIds.length > 0 ? 'bg-emerald-50 border-emerald-500 text-emerald-700' : 'bg-white border-stone-200 text-stone-500 hover:bg-stone-50'}`}
                                >
                                    <span className="text-lg">👥</span>
                                    {assignedStudentIds.length > 0 ? `${assignedStudentIds.length}名に配信予約中` : '配信先を選択'}
                                </button>
                                <button onClick={() => setShowPrint(true)} className="px-5 py-2 bg-blue-600 text-white rounded-lg font-bold hover:bg-blue-700 shadow-md flex items-center gap-1 shrink-0 text-base active:rotate-1 transition-transform">
                                    <span className="text-lg">🖨️</span> 作成
                                </button>
                            </div>
                        )}
                    </div>
                </header>

                <div className="flex-1 flex overflow-hidden">
                    {/* 左サイドバー */}
                    <div className="w-[300px] bg-white border-r border-stone-200 flex flex-col overflow-y-auto shadow-[2px_0_10px_rgba(0,0,0,0.02)] z-10 shrink-0">
                        <div className="p-5 border-b border-stone-100">
                            <p className="text-xs font-bold text-stone-400 mb-3 tracking-widest">TARGET GRADE</p>
                            <div className="flex flex-wrap gap-2">
                                {grades.map(g => (
                                    <button key={g.id} onClick={() => handleGradeChange(g.id)} className={`px-3 py-2 rounded-md text-sm font-bold transition-all ${selectedGrade === g.id ? 'bg-stone-800 text-white shadow' : 'bg-stone-100 text-stone-500 hover:bg-stone-200'}`}>{g.name}</button>
                                ))}
                            </div>
                        </div>
                        <div className="p-5 border-b border-stone-100">
                            <p className="text-xs font-bold text-stone-400 mb-3 tracking-widest">SUBJECT</p>
                            <div className="grid grid-cols-4 gap-2">
                                {currentSubjects.map(s => (
                                    <button key={s.id} onClick={() => setSelectedSubject(s.id)} className={`py-2 rounded-lg flex flex-col items-center justify-center transition-all ${selectedSubject === s.id ? 'bg-blue-600 text-white shadow' : 'bg-stone-100 text-stone-500 hover:bg-stone-200'}`}>
                                        <span className="text-lg">{s.icon}</span><span className="text-[10px] font-bold mt-1">{s.name}</span>
                                    </button>
                                ))}
                            </div>
                        </div>
                        <div className="p-4 border-b border-stone-100">
                            <p className="text-xs font-bold text-stone-400 mb-2 tracking-widest">MODE</p>
                            <div className="flex gap-1 bg-stone-100 rounded-lg p-1">
                                <button onClick={() => { setSelectionMode('normal'); setLevelPreviewId(null); }} className={`flex-1 py-2 rounded-md text-xs font-bold transition-all ${selectionMode === 'normal' ? 'bg-white text-stone-800 shadow-sm' : 'text-stone-400 hover:text-stone-600'}`}>通常</button>
                                <button onClick={() => { setSelectionMode('level'); setPreviewCategoryId(null); }} className={`flex-1 py-2 rounded-md text-xs font-bold transition-all ${selectionMode === 'level' ? 'bg-indigo-600 text-white shadow-sm' : 'text-stone-400 hover:text-stone-600'}`}>分類レベル別</button>
                            </div>
                        </div>
                        <div className="p-5 flex-1 overflow-y-auto">
                            <p className="text-xs font-bold text-stone-400 mb-3 tracking-widest">{selectionMode === 'level' ? 'CATEGORY (レベル選択)' : 'CATEGORY'}</p>
                            {selectionMode === 'level' ? renderLevelTree(filteredTreeData) : renderTree(filteredTreeData)}
                        </div>
                    </div>

                    {/* メインエリア */}
                    <div className="flex-1 bg-stone-50 p-8 overflow-y-auto flex flex-col items-center">
                        <div className="w-full max-w-7xl">
                            {selectionMode === 'level' ? (
                                /* === 分類レベル別モード === */
                                levelPreviewId && levelDiffCounts ? (() => {
                                    const diffs: { key: keyof typeof levelDiffCounts; l: DiffType }[] = [
                                        { key: 'foundation', l: '基礎' },
                                        { key: 'basic', l: '基本' },
                                        { key: 'standard', l: '標準' },
                                        { key: 'applied', l: '応用' },
                                        { key: 'advanced', l: '発展' }
                                    ];
                                    const totalSelected = Object.values(levelDiffInputs).reduce((s, n) => s + n, 0);
                                    const badge = levelBadge[String(levelPreviewId.split('-').length)] || levelBadge['4'];
                                    const isSai = levelPreviewLevel === '細';
                                    const levelPreview = isSai ? getPreviewQuestionsByPrefix(levelPreviewId) : null;

                                    return (
                                        <>
                                            <div className="mb-8 border-b border-stone-200 pb-4">
                                                <div className="flex items-center gap-3 mb-2">
                                                    <span className={`text-sm px-3 py-1 rounded-lg font-bold ${badge.color}`}>{levelPreviewLevel}分類</span>
                                                    <h2 className="text-3xl font-bold text-stone-800">{levelPreviewName}</h2>
                                                </div>
                                                <p className="text-sm text-stone-500">各難易度から抽出する問題数を指定してください</p>
                                            </div>

                                            <div className="grid grid-cols-5 gap-4 mb-8">
                                                {diffs.map(({ key, l }) => {
                                                    const d = diffStyles[l];
                                                    const available = levelDiffCounts[key];
                                                    const inputVal = levelDiffInputs[l];
                                                    const previewQ = levelPreview ? levelPreview[key] : null;

                                                    return (
                                                        <div key={l} className={`rounded-xl border-2 ${d.border} bg-white shadow-sm overflow-hidden flex flex-col ${isSai ? 'h-[420px]' : ''}`}>
                                                            <div className={`p-4 ${d.bgLight} border-b border-stone-100`}>
                                                                <div className="flex justify-between items-center mb-1">
                                                                    <span className={`text-xs px-2 py-0.5 rounded font-bold ${d.text} bg-white border ${d.border}`}>{d.tag}</span>
                                                                    <span className="text-lg font-bold text-stone-700">{available}問</span>
                                                                </div>
                                                                <h3 className={`text-xl font-bold ${d.textDark}`}>{l}</h3>
                                                            </div>

                                                            {/* プレビュー（細分類のみ） */}
                                                            {isSai && (
                                                                <div className="p-3 flex-1 overflow-y-auto text-sm scrollbar-hide border-b border-stone-100">
                                                                    {previewQ ? (
                                                                        <>
                                                                            <span className="text-[10px] font-bold text-stone-400 block mb-1">EXAMPLE</span>
                                                                            <div className="font-medium text-stone-800 leading-relaxed text-xs" dangerouslySetInnerHTML={{ __html: formatMath(previewQ.question) }} />
                                                                            <div className={`mt-2 pt-2 border-t border-dashed border-stone-200 ${d.text} font-bold text-xs`}>
                                                                                <span className="mr-1">A.</span><span dangerouslySetInnerHTML={{ __html: formatMath(previewQ.answer) }} />
                                                                            </div>
                                                                        </>
                                                                    ) : (
                                                                        <div className="h-full flex items-center justify-center text-stone-300 font-bold text-xs">No Data</div>
                                                                    )}
                                                                </div>
                                                            )}

                                                            {/* 抽出数入力 */}
                                                            <div className={`p-3 flex flex-col items-center justify-center gap-2 ${isSai ? '' : 'flex-1'}`}>
                                                                <label className="text-xs font-bold text-stone-500">抽出数</label>
                                                                <div className="flex items-center gap-2">
                                                                    <button
                                                                        onClick={() => setLevelDiffInputs(p => ({ ...p, [l]: Math.max(0, p[l] - 1) }))}
                                                                        className="w-8 h-8 rounded-lg bg-stone-100 text-stone-500 font-bold hover:bg-stone-200 transition-colors"
                                                                    >−</button>
                                                                    <input
                                                                        type="number"
                                                                        min={0}
                                                                        max={available}
                                                                        value={inputVal}
                                                                        onChange={e => setLevelDiffInputs(p => ({ ...p, [l]: Math.min(available, Math.max(0, parseInt(e.target.value) || 0)) }))}
                                                                        className={`w-16 h-10 text-center text-lg font-bold rounded-lg border-2 ${inputVal > 0 ? `${d.border} ${d.bgLight}` : 'border-stone-200'} focus:outline-none transition-all`}
                                                                    />
                                                                    <button
                                                                        onClick={() => setLevelDiffInputs(p => ({ ...p, [l]: Math.min(available, p[l] + 1) }))}
                                                                        className="w-8 h-8 rounded-lg bg-stone-100 text-stone-500 font-bold hover:bg-stone-200 transition-colors"
                                                                    >+</button>
                                                                </div>
                                                                {inputVal > 0 && (
                                                                    <span className={`text-xs font-bold ${d.text} animate-pulse`}>✓ {inputVal}問選択</span>
                                                                )}
                                                            </div>
                                                        </div>
                                                    );
                                                })}
                                            </div>

                                            {/* サマリーと決定ボタン */}
                                            <div className="flex flex-col items-center gap-4">
                                                {totalSelected > 0 && (
                                                    <div className="bg-white rounded-xl border border-stone-200 px-6 py-3 shadow-sm">
                                                        <span className="text-sm text-stone-500 mr-3">合計:</span>
                                                        <span className="text-2xl font-bold text-indigo-600">{totalSelected}問</span>
                                                        <span className="text-sm text-stone-400 ml-2">
                                                            ({Object.entries(levelDiffInputs).filter(([, v]) => v > 0).map(([k, v]) => `${k}${v}`).join('＋')})
                                                        </span>
                                                    </div>
                                                )}
                                                <button
                                                    onClick={confirmLevelCategory}
                                                    disabled={totalSelected === 0}
                                                    className={`px-16 py-4 rounded-full font-bold shadow-xl flex items-center gap-3 transition-all ${totalSelected > 0 ? 'bg-indigo-600 text-white hover:bg-indigo-700 hover:scale-105' : 'bg-stone-200 text-stone-400 cursor-not-allowed'}`}
                                                >
                                                    <span className="text-lg">決定してリストに追加</span>
                                                    <span className={`text-xs px-2 py-1 rounded ${totalSelected > 0 ? 'bg-white text-indigo-600' : 'bg-stone-300 text-stone-500'}`}>＋</span>
                                                </button>
                                            </div>
                                        </>
                                    );
                                })() : (
                                    <div className="h-full flex flex-col items-center justify-center text-stone-300 mt-28">
                                        <div className="text-6xl mb-6">👈</div>
                                        <p className="text-2xl font-bold text-stone-400">分類を選択してください</p>
                                        <p className="text-sm text-stone-400 mt-2">大・中・小・細 どのレベルでも選択できます</p>
                                    </div>
                                )
                            ) : (
                                /* === 通常モード === */
                                previewCategoryId ? (() => {
                                    if (isLoadingPreview || !previewData || !difficultyCounts) {
                                        return (
                                            <div className="h-full flex flex-col items-center justify-center text-blue-400 mt-28">
                                                <div className="animate-spin text-4xl mb-4">🌀</div>
                                                <p className="text-xl font-bold">データを読み込み中...</p>
                                            </div>
                                        );
                                    }
                                    const preview = previewData;
                                    const counts = difficultyCounts;
                                    const diffs: { key: keyof typeof counts, l: DiffType }[] = [
                                        { key: 'foundation', l: '基礎' },
                                        { key: 'basic', l: '基本' },
                                        { key: 'standard', l: '標準' },
                                        { key: 'applied', l: '応用' },
                                        { key: 'advanced', l: '発展' }
                                    ];

                                    return (
                                        <>
                                            <div className="mb-8 flex items-end justify-between border-b border-stone-200 pb-4">
                                                <div>
                                                    <h2 className="text-3xl font-bold text-stone-800 mb-2 flex items-center gap-3">
                                                        <span className="text-4xl">📂</span> {previewCategoryName}
                                                    </h2>
                                                    <p className="text-sm text-stone-500">難易度を選択して追加してください</p>
                                                </div>
                                                <label className="flex items-center gap-2 cursor-pointer bg-white px-4 py-2 rounded-lg border border-stone-200 hover:bg-stone-50">
                                                    <input type="checkbox" checked={weaknessMode} onChange={() => setWeaknessMode(w => !w)} className="w-5 h-5 accent-blue-600" />
                                                    <span className="font-bold text-stone-700 text-sm">弱点克服モード</span>
                                                </label>
                                            </div>

                                            {/* 5列グリッド */}
                                            <div className="grid grid-cols-5 gap-4 mb-8">
                                                {diffs.map(({ key, l }) => {
                                                    const d = diffStyles[l];
                                                    const q = preview[key];
                                                    const cnt = counts[key];
                                                    const isSel = selectedDiff === l;

                                                    return (
                                                        <button key={l} onClick={() => setSelectedDiff(l)}
                                                            className={`relative text-left rounded-xl border-2 transition-all flex flex-col h-[420px] overflow-hidden group hover:-translate-y-1 hover:shadow-lg ${isSel ? `${d.border} bg-white shadow-xl scale-[1.02] z-10 ring-4 ${d.ring}` : 'border-transparent bg-white shadow-sm'}`}>

                                                            {/* Header */}
                                                            <div className={`p-4 border-b border-stone-100 ${isSel ? d.bgLight : 'bg-gray-50'}`}>
                                                                <div className="flex justify-between items-start mb-2">
                                                                    <span className={`text-xs px-2 py-1 rounded font-bold bg-white ${d.text} border ${d.border} border-opacity-30`}>{d.tag}</span>
                                                                    <span className="text-xl font-bold text-stone-700">{cnt}問</span>
                                                                </div>
                                                                <h3 className={`text-xl font-bold ${d.textDark}`}>{l}</h3>
                                                            </div>

                                                            {/* Example Content (Scrollable) */}
                                                            <div className="p-4 flex-1 overflow-y-auto text-sm scrollbar-hide">
                                                                {q ? (
                                                                    <>
                                                                        <div className="mb-3">
                                                                            <span className="text-[10px] font-bold text-stone-400 block mb-1">EXAMPLE</span>
                                                                            <div className="font-medium text-stone-800 leading-relaxed" dangerouslySetInnerHTML={{ __html: formatMath(q.question) }} />
                                                                        </div>
                                                                        <div className={`mt-3 pt-3 border-t border-dashed border-stone-200 ${d.text} font-bold`}>
                                                                            <span className="mr-2">A.</span><span dangerouslySetInnerHTML={{ __html: formatMath(q.answer) }} />
                                                                        </div>
                                                                    </>
                                                                ) : (
                                                                    <div className="h-full flex items-center justify-center text-stone-300 font-bold">No Data</div>
                                                                )}
                                                            </div>

                                                            {/* Footer Selection Indicator */}
                                                            <div className={`p-3 text-center text-sm font-bold transition-colors ${isSel ? `${d.bgDark} text-white` : 'bg-stone-50 text-stone-400 group-hover:bg-stone-100'}`}>
                                                                {isSel ? '✓ 選択中' : '選択'}
                                                            </div>
                                                        </button>
                                                    );
                                                })}
                                            </div>

                                            <div className="flex justify-center">
                                                <button onClick={confirmCategory} className="px-16 py-4 bg-stone-900 text-white rounded-full font-bold shadow-xl hover:bg-black hover:scale-105 transition-all flex items-center gap-3">
                                                    <span className="text-lg">決定してリストに追加</span>
                                                    <span className="bg-white text-black text-xs px-2 py-1 rounded">＋</span>
                                                </button>
                                            </div>
                                        </>
                                    );
                                })() : (
                                    <div className="h-full flex flex-col items-center justify-center text-stone-300 mt-28">
                                        <div className="text-6xl mb-6">👈</div>
                                        <p className="text-2xl font-bold text-stone-400">カテゴリを選択してください</p>
                                    </div>
                                ))}
                        </div>
                    </div>
                </div>
            </div>

            {/* Print Modal */}
            {/* 配信先選択モーダル */}
            {
                showAssignModal && (
                    <div className="fixed inset-0 bg-slate-900/60 backdrop-blur-sm z-[100] flex items-center justify-center p-4 animate-in fade-in duration-200">
                        <div className="bg-white rounded-3xl w-full max-w-2xl overflow-hidden shadow-2xl flex flex-col max-h-[90vh]">
                            <div className="p-6 bg-slate-50 border-b border-slate-100 flex justify-between items-center">
                                <div>
                                    <h2 className="text-xl font-black text-slate-800 flex items-center gap-2">
                                        <span className="p-1.5 bg-emerald-100 text-emerald-700 rounded-lg">👥</span>
                                        配信先の生徒を選択
                                    </h2>
                                    <p className="text-xs text-slate-400 font-bold mt-1 uppercase tracking-tight">Select Students to Assign</p>
                                </div>
                                <button onClick={() => setShowAssignModal(false)} className="text-slate-400 hover:text-slate-600 transition-colors px-2 py-1 text-xl">✕</button>
                            </div>

                            <div className="flex-1 overflow-y-auto p-6">
                                <div className="grid grid-cols-2 gap-3">
                                    {students.filter(s => {
                                        const gMap: Record<string, string> = { 'j1': '中1', 'j2': '中2', 'j3': '中3', 'e1': '小1', 'e2': '小2', 'e3': '小3', 'e4': '小4', 'e5': '小5', 'e6': '小6' };
                                        const targetGrade = gMap[selectedGrade] || selectedGrade;
                                        return s.grade === targetGrade || selectedGrade.includes('all');
                                    }).map(student => {
                                        const isSelected = assignedStudentIds.includes(student.id);
                                        const avatar = getAvatarById(student.avatarId);
                                        return (
                                            <button
                                                key={student.id}
                                                onClick={() => {
                                                    setAssignedStudentIds(prev =>
                                                        isSelected ? prev.filter(id => id !== student.id) : [...prev, student.id]
                                                    );
                                                }}
                                                className={`p-4 rounded-2xl border-2 transition-all flex items-center gap-3 text-left ${isSelected ? 'border-emerald-500 bg-emerald-50 shadow-md ring-4 ring-emerald-50' : 'border-slate-100 bg-slate-50 hover:border-slate-200'}`}
                                            >
                                                <span className="text-2xl">{avatar.emoji}</span>
                                                <div>
                                                    <p className="text-[10px] text-slate-400 font-bold leading-none mb-1">{student.id} / {student.grade}</p>
                                                    <p className="font-bold text-slate-800">{student.name}</p>
                                                </div>
                                                {isSelected && <span className="ml-auto text-emerald-500 font-xl font-bold">✓</span>}
                                            </button>
                                        );
                                    })}
                                </div>
                            </div>

                            <div className="p-6 bg-slate-50 border-t border-slate-100 flex items-center justify-between">
                                <p className="text-sm font-bold text-slate-500">
                                    <span className="text-emerald-600 px-3 py-1 bg-white rounded-lg border border-emerald-200 mr-2 font-black">{assignedStudentIds.length}名</span> 選択中
                                </p>
                                <button
                                    onClick={() => setShowAssignModal(false)}
                                    className="px-8 py-3 bg-slate-800 text-white rounded-xl font-bold hover:bg-slate-900 transition-all shadow-lg active:scale-95"
                                >
                                    完了
                                </button>
                            </div>
                        </div>
                    </div>
                )
            }

            {
                showPrint && (
                    <div className="fixed inset-0 z-50 flex items-center justify-center bg-black/60 backdrop-blur-sm p-8">
                        <div className="bg-white rounded-2xl shadow-2xl w-full h-full max-w-[1400px] flex overflow-hidden">
                            {/* Print Options Sidebar */}
                            <div className="w-80 bg-stone-50 border-r border-stone-200 p-6 flex flex-col">
                                <h3 className="font-bold text-xl mb-6 text-stone-800 flex items-center gap-2">🖨️ 印刷設定</h3>

                                <div className="space-y-4 mb-8">
                                    <label className="flex items-center gap-3 p-3 bg-white rounded-lg border border-stone-200 shadow-sm cursor-pointer hover:bg-blue-50 transition-colors">
                                        <input type="checkbox" checked={printOptions.question} onChange={e => setPrintOptions(p => ({ ...p, question: e.target.checked }))} className="w-5 h-5 accent-blue-600" />
                                        <span className="font-bold text-stone-700">問題</span>
                                    </label>
                                    <label className="flex items-center gap-3 p-3 bg-white rounded-lg border border-stone-200 shadow-sm cursor-pointer hover:bg-blue-50 transition-colors">
                                        <input type="checkbox" checked={printOptions.answer} onChange={e => setPrintOptions(p => ({ ...p, answer: e.target.checked }))} className="w-5 h-5 accent-blue-600" />
                                        <span className="font-bold text-stone-700">解答</span>
                                    </label>
                                    <label className="flex items-center gap-3 p-3 bg-white rounded-lg border border-stone-200 shadow-sm cursor-pointer hover:bg-blue-50 transition-colors">
                                        <input type="checkbox" checked={printOptions.explanation} onChange={e => setPrintOptions(p => ({ ...p, explanation: e.target.checked }))} className="w-5 h-5 accent-blue-600" />
                                        <span className="font-bold text-stone-700">解説</span>
                                    </label>
                                    <label className="flex items-center gap-3 p-3 bg-white rounded-lg border border-stone-200 shadow-sm cursor-pointer hover:bg-blue-50 transition-colors">
                                        <input type="checkbox" checked={printOptions.sheet} onChange={e => setPrintOptions(p => ({ ...p, sheet: e.target.checked }))} className="w-5 h-5 accent-blue-600" />
                                        <span className="font-bold text-stone-700">答案用紙</span>
                                    </label>
                                </div>

                                <div className="mt-auto space-y-3">
                                    <button onClick={preparePrint} className="w-full py-4 bg-blue-600 text-white rounded-xl font-bold shadow-lg hover:bg-blue-700 transition-all flex items-center justify-center gap-2 text-lg">
                                        <span>🖨️</span> 印刷 / PDF保存
                                    </button>
                                    <div className="text-center text-xs text-stone-400 font-bold my-1">👇 印刷が終わったら...</div>
                                    <button onClick={() => {
                                        // Save before navigating (just in case they didn't print)
                                        const qs = printQuestions.length > 0 ? printQuestions : getAllSelectedQuestions();
                                        if (qs.length > 0) {
                                            sessionStorage.setItem('grading_target_questions', JSON.stringify(qs));
                                            sessionStorage.setItem('grading_test_date', new Date().toLocaleDateString('ja-JP'));
                                            sessionStorage.setItem('grading_test_title', testName);
                                        }
                                        router.push('/results');
                                    }} className="w-full py-3 bg-indigo-600 text-white rounded-xl font-bold shadow-md hover:bg-indigo-700 transition-all flex items-center justify-center gap-2">
                                        <span>📊</span> 採点・結果入力へ
                                    </button>
                                    <button onClick={() => setShowPrint(false)} className="w-full py-3 bg-white border-2 border-stone-200 text-stone-500 rounded-xl font-bold hover:bg-stone-100 hover:text-stone-700">閉じる</button>
                                </div>
                            </div>

                            {/* Preview Area */}
                            <div className="flex-1 bg-stone-200 p-8 flex justify-center overflow-y-auto">
                                <div className="bg-white shadow-2xl origin-top transition-all" style={{ width: '210mm', minHeight: '297mm', padding: '15mm 20mm', transform: 'scale(0.85)' }}>
                                    <style>{`
                                    .print-page { font-family: 'Sawarabi Mincho', serif; margin-bottom: 40px; border: 1px dashed #eee; padding: 10px; }
                                    .sample-header { border-bottom: 2px solid #000; padding: 6px 0 8px; margin-bottom: 18px; }
                                    .sample-title { font-weight: bold; letter-spacing: 1px; }
                                    .sample-question { display: flex; gap: 10px; margin-bottom: 18px; font-size: 15px; }
                                    .sample-qbox { width: 28px; height: 28px; border: 1px solid #000; display: flex; align-items: center; justify-content: center; font-weight: bold; flex-shrink: 0; }
                                    .sample-qbody { flex: 1; }
                                    .sample-qtext { line-height: 1.8; }
                                    .sample-answer, .sample-explanation { display: flex; gap: 10px; margin-bottom: 12px; font-size: 14px; }
                                    .sample-abox, .sample-ebox { width: 28px; height: 28px; border: 1px solid #000; display: flex; align-items: center; justify-content: center; font-weight: bold; flex-shrink: 0; }
                                    .sample-abody, .sample-ebody { line-height: 1.7; }
                                    .answer-grid-container { display: grid; grid-template-columns: 1fr 1fr; gap: 20px; }
                                    .sheet-question-row { border: 1px solid #000; padding: 10px; display: flex; flex-direction: column; min-height: 100px; }
                                    .sheet-question-row.full-width { grid-column: span 2; }
                                    .sheet-label { font-weight: bold; font-size: 14px; margin-bottom: 5px; }
                                    .sheet-sub-grid { display: grid; grid-template-columns: 1fr 1fr; gap: 8px; flex-grow: 1; }
                                    .sheet-sub-box { border: 1px dashed #ccc; height: 40px; position: relative; }
                                    .mini-label { font-size: 10px; position: absolute; top: 2px; left: 2px; color: #666; }
                                    .sub-item { margin-bottom: 20px; }
                                    .sub-label { font-weight: bold; margin-bottom: 5px; }
                                    .sub-answer-boxes { display: flex; gap: 10px; }
                                    .sub-answer-box { border: 1px solid #000; width: 60px; height: 40px; position: relative; }
                                    .number-line-box { text-align: center; padding: 10px 0; border: 1px solid #eee; }
                                    @import url('https://fonts.googleapis.com/css2?family=Sawarabi+Mincho&family=Sawarabi+Gothic&display=swap');
                                `}</style>
                                    {/* Preview Content */}
                                    {(() => {
                                        const qs = printQuestions.length > 0 ? printQuestions : getAllSelectedQuestions();
                                        let content = '';
                                        if (printOptions.question) content += generatePremiumHTML(qs, 'question');
                                        if (printOptions.answer) content += generatePremiumHTML(qs, 'answer');
                                        if (printOptions.explanation) content += generatePremiumHTML(qs, 'explanation');
                                        if (printOptions.sheet) content += generatePremiumHTML(qs, 'sheet');

                                        if (!content) return (
                                            <div className="h-full flex flex-col items-center justify-center text-stone-300 py-20">
                                                <p className="text-xl font-bold">左のメニューから印刷する項目を選択してください</p>
                                            </div>
                                        );

                                        return <div dangerouslySetInnerHTML={{ __html: content }} />;
                                    })()}
                                </div>
                            </div>
                        </div>
                    </div>
                )
            }
            <div id="print-area" />
            <style>{`@media print { body > *:not(#print-area) { display: none !important; } #print-area { display: block !important; } .print-page { padding: 20mm; page-break-after: always; } .print-page:last-child { page-break-after: auto; } } @media screen { #print-area { display: none; } }`}</style>
        </>
    );
}



